{
  "id": "06ed9e10-b42f-4253-8087-87ebcbf4dda2",
  "name": "WORK",
  "items": [
    {
      "id": "cb3c3938-090b-4ded-b7f0-ffd0899035b3",
      "word": "Occupation",
      "synonyms": [
        "Profession",
        "career"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The occupation of a doctor requires a lot of dedication and hard work.",
          "translation": "Pekerjaan seorang dokter memerlukan dedikasi dan kerja keras yang besar."
        },
        {
          "type": "Complex",
          "text": "While many people consider a career in medicine to be a noble occupation, it is also extremely challenging.",
          "translation": "Meskipun banyak orang memandang karir di bidang kedokteran sebagai pekerjaan mulia, namun juga sangat menantang."
        },
        {
          "type": "Compound",
          "text": "Being a teacher is not only a rewarding occupation, but it also allows individuals to make a positive impact on society.",
          "translation": "Menjadi guru bukan hanya pekerjaan yang menguntungkan, tetapi juga memungkinkan individu untuk memiliki pengaruh positif pada masyarakat."
        },
        {
          "type": "Compound-Complex",
          "text": "The rising cost of living has forced many individuals to change their occupation in order to find more stable employment, which can be both a positive and negative experience.",
          "translation": "Kenaikan biaya hidup telah memaksa banyak individu untuk mengubah pekerjaan mereka agar dapat menemukan pekerjaan yang lebih stabil, yang bisa menjadi pengalaman positif dan negatif sekaligus."
        }
      ],
      "phonetics": {
        "us": "/ɒkjuːˈpeɪʃən/",
        "uk": "/ɒkjʊˈpeɪʃən/"
      },
      "meaning": "Pekerjaan utama",
      "synonymMeanings": [
        "profesi",
        "pekerjaan utama",
        "bidang kerja"
      ],
      "definition": "The job or profession that someone does, especially the one that they do for most of their adult life."
    },
    {
      "id": "4a9737ea-c413-46f0-b6bb-cdf8733db44e",
      "word": "Profession",
      "synonyms": [
        "Career",
        "vocation"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "My profession has been teaching English for over 10 years.",
          "translation": "Pekerjaan utama saya adalah mengajar bahasa Inggris selama lebih dari 10 tahun."
        },
        {
          "type": "Complex",
          "text": "The increasing demand for professionals in the IT sector has led to a rise in the number of universities offering courses in this field.",
          "translation": "Kebutuhan meningkat untuk profesional di sektor teknologi informasi telah menyebabkan peningkatan jumlah universitas yang menawarkan program studi di bidang ini."
        },
        {
          "type": "Compound",
          "text": "Some people choose to change their profession after they get married, while others prefer to continue working in the same field.",
          "translation": "Beberapa orang memilih untuk mengubah pekerjaan mereka setelah menikah, sementara yang lain lebih suka melanjutkan pekerjaan di bidang yang sama."
        },
        {
          "type": "Compound-Complex",
          "text": "Although many students are interested in pursuing a career in medicine, few of them are aware of the long and challenging process of becoming a professional doctor.",
          "translation": "Meskipun banyak siswa tertarik untuk mengejar karir di bidang kedokteran, sedikit di antara mereka menyadari bahwa proses panjang dan berkelanjutan untuk menjadi seorang dokter profesional."
        }
      ],
      "phonetics": {
        "us": "/ˈprɑːfəʃən/",
        "uk": "/ˈprɒf.əʃən/"
      },
      "meaning": "Pekerjaan utama",
      "synonymMeanings": [
        "Pekerjaan",
        "Karier",
        "Jurusan",
        "Pengalaman kerja"
      ],
      "definition": "A person's regular occupation or job."
    },
    {
      "id": "dbac60ec-ab9e-4b0c-a36a-6ae505016a18",
      "word": "Employment",
      "synonyms": [
        "Work",
        "occupation"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "In many countries, finding employment is a major challenge for young people.",
          "translation": "Di banyak negara, mencari pekerjaan adalah tantangan besar bagi generasi muda."
        },
        {
          "type": "Complex",
          "text": "While many people believe that employment is the key to a happy and fulfilling life, others argue that it can be a source of stress and anxiety.",
          "translation": "Meskipun banyak orang percaya bahwa pekerjaan adalah kunci untuk kehidupan bahagia dan penuh makna, beberapa orang lain berpendapat bahwa pekerjaan dapat menjadi sumber stres dan kecemasan."
        },
        {
          "type": "Compound",
          "text": "Employment agencies often help job seekers find suitable employment opportunities, and career counseling services provide guidance on how to navigate the job market.",
          "translation": "Biro pekerjaan sering membantu pencari kerja menemukan kesempatan pekerjaan yang sesuai, dan jasa konseling karir memberikan panduan tentang bagaimana menavigasi pasar kerja."
        },
        {
          "type": "Compound-Complex",
          "text": "In addition to providing employment opportunities, many companies also offer training and development programs to help employees improve their skills and advance their careers, which can lead to increased job satisfaction and reduced turnover rates.",
          "translation": "Selain memberikan kesempatan pekerjaan, banyak perusahaan juga menawarkan program pelatihan dan pengembangan untuk membantu karyawan meningkatkan kemampuan dan maju karirnya, yang dapat menyebabkan peningkatan kepuasan kerja dan pengurangan tingkat pergantian pekerja."
        }
      ],
      "phonetics": {
        "us": "/ɛmˈploʊmənt/",
        "uk": "/ɛmˈploʊmənt/"
      },
      "meaning": "Pekerjaan atau kegiatan menggaji seseorang untuk melakukan tugas tertentu",
      "synonymMeanings": [
        "Pekerjaan",
        "Gaji",
        "Pengangkatan",
        "Menggaji"
      ],
      "definition": "The act of engaging or hiring someone to do a job, or the state of being employed."
    },
    {
      "id": "2a5c2125-6ce3-4433-9558-1beb0c737460",
      "word": "Unemployment",
      "synonyms": [
        "Joblessness",
        "redundancy"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Unemployment rates have been rising in many countries.",
          "translation": "Keterampilan tidak bekerja telah meningkat di banyak negara."
        },
        {
          "type": "Complex",
          "text": "The government has implemented various policies to reduce unemployment among young people.",
          "translation": "Pemerintah telah menerapkan berbagai kebijakan untuk mengurangi keterampilan tidak bekerja di kalangan masyarakat muda."
        },
        {
          "type": "Compound",
          "text": "Unemployment and poverty are two major problems facing many societies today.",
          "translation": "Keterampilan tidak bekerja dan kemiskinan adalah dua masalah besar yang dihadapi banyak masyarakat pada saat ini."
        },
        {
          "type": "Compound-Complex",
          "text": "The increasing rate of unemployment has led to a significant increase in crime rates, as many people are desperate for work.",
          "translation": "Keterampilan tidak bekerja yang meningkat telah menyebabkan peningkatan signifikan dalam tingkat kejahatan, karena banyak orang yang sangat membutuhkan pekerjaan."
        }
      ],
      "phonetics": {
        "us": "/ˌʌnɛmˈplɔɪmənt/",
        "uk": "/ˌʌnɛmˈplɔɪmənt/"
      },
      "meaning": "Keterampilan tidak bekerja atau tidak memiliki pekerjaan",
      "synonymMeanings": [
        "keterampilan kosong",
        "tidak memiliki pekerjaan",
        "tidak bekerja",
        "miskin tenaga kerja"
      ],
      "definition": "The state of being without a job, especially when someone is actively looking for work."
    },
    {
      "id": "c382ece1-98b4-43da-ba7c-47134539b262",
      "word": "Workforce",
      "synonyms": [
        "Labor force",
        "employees"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing workforce in emerging countries threatens the global economy.",
          "translation": "Peningkatan angkatan kerja di negara-negara berkembang mengancam ekonomi dunia."
        },
        {
          "type": "Complex",
          "text": "Although the workforce in our industry has grown significantly, we still face a shortage of skilled workers.",
          "translation": "Meskipun angkatan kerja di industri kami telah meningkat secara signifikan, kami masih menghadapi kekurangan tenaga kerja terlatih."
        },
        {
          "type": "Compound",
          "text": "The growing workforce and technological advancements have transformed the job market.",
          "translation": "Peningkatan angkatan kerja dan kemajuan teknologi telah mengubah pasar kerja."
        },
        {
          "type": "Compound-Complex",
          "text": "The increasing workforce and lack of proper training have led to a significant decrease in productivity, which in turn affects the economy as a whole.",
          "translation": "Peningkatan angkatan kerja dan kekurangan pelatihan yang tepat telah menyebabkan penurunan drastis dalam produktivitas, yang pada akhirnya mempengaruhi ekonomi secara keseluruhan."
        }
      ],
      "phonetics": {
        "us": "/ˈwɜːr.fɔːrs/",
        "uk": "/ˈwɜːr.fɔːrs/"
      },
      "meaning": "Kerja paksa atau karyawan",
      "synonymMeanings": [
        "karyawan",
        "tenaga kerja",
        "angkatan kerja",
        "bekerja"
      ],
      "definition": "The people employed in a particular industry or country."
    },
    {
      "id": "c6ca1cdb-e1d7-44c8-b002-3ffd3ab60292",
      "word": "Job security",
      "synonyms": [
        "Employment stability",
        "tenure"
      ],
      "userGuesses": [],
      "status": "hidden",
      "examples": [
        {
          "type": "Simple",
          "text": "Job security is a major concern for many employees.",
          "translation": "Keamanan pekerjaan adalah kekhawatiran utama bagi banyak karyawan."
        },
        {
          "type": "Complex",
          "text": "The company's decision to downsize has undermined job security for many employees.",
          "translation": "Keputusan perusahaan untuk mengurangi jumlah karyawan telah menghancurkan keamanan pekerjaan bagi banyak karyawan."
        },
        {
          "type": "Compound",
          "text": "Job security, flexibility, and good working conditions are essential for employee satisfaction.",
          "translation": "Keamanan pekerjaan, fleksibilitas, dan kondisi kerja yang baik adalah penting untuk kepuasan karyawan."
        },
        {
          "type": "Compound-Complex",
          "text": "If employers prioritize job security, they may need to consider alternative methods of staffing, such as temporary workers or contractors.",
          "translation": "Jika pengusaha memberikan prioritas keamanan pekerjaan, mereka mungkin perlu mempertimbangkan metode stafing alternatif, seperti pekerja sementara atau kontraktor."
        }
      ],
      "phonetics": {
        "us": "/dʒɒb sɛkjʊrɪti/",
        "uk": "/dʒɒb sɛkjuːəri/"
      },
      "meaning": "Keamanan pekerjaan",
      "synonymMeanings": [
        "Kerja tetap",
        "Kondisi kerja yang stabil",
        "Keadilan pekerja"
      ],
      "definition": "The state of having a secure and stable job, free from the threat of redundancy or dismissal."
    },
    {
      "id": "99aef081-7e0e-4dcf-b708-ebd77b8e797e",
      "word": "Freelancer",
      "synonyms": [
        "Self-employed worker",
        "contractor"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Many students choose to work as freelancers during their university years.",
          "translation": "Banyak mahasiswa memilih bekerja sebagai freelancer selama tahun-tahun mereka di universitas."
        },
        {
          "type": "Complex",
          "text": "As a freelancer, she has the flexibility to choose her own projects and work schedule.",
          "translation": "Sebagai freelancer, ia memiliki fleksibilitas untuk memilih proyek dan jadwal kerja sendiri."
        },
        {
          "type": "Compound",
          "text": "Freelancers often face challenges in managing their time and finances effectively.",
          "translation": "Freelancer sering menghadapi tantangan dalam mengelola waktu dan keuangan mereka secara efektif."
        },
        {
          "type": "Compound-Complex",
          "text": "However, many freelancers enjoy the freedom and autonomy that comes with working independently, which allows them to be more creative and innovative in their work.",
          "translation": "Namun, banyak freelancer menyukai kebebasan dan otonomi yang datang dengan bekerja secara mandiri, yang memungkinkan mereka untuk lebih kreatif dan inovatif dalam pekerjaan mereka."
        }
      ],
      "phonetics": {
        "us": "/ˈfriːˌleɪnˌsɔːr/",
        "uk": "/ˈfriːlˌeɪnzər/"
      },
      "meaning": "Seorang freelancer adalah orang yang menawarkan kemampuan dan jasa mereka kepada klien berdasarkan proyek, sering bekerja secara mandiri.",
      "synonymMeanings": [
        "penyedia jasa independen",
        "pekerja lepas",
        "penyedia jasa bebas",
        "penyedia jasa proyek"
      ],
      "definition": "A person who offers their skills and services to clients on a project basis, often working independently."
    },
    {
      "id": "aadefb54-2f33-4d1f-88ca-0f8c96ead0ca",
      "word": "Entrepreneur",
      "synonyms": [
        "Business owner",
        "innovator"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The entrepreneur's innovative idea revolutionized the industry.",
          "translation": "Wirausaha itu berinisiatif dengan ide inovatif yang menggoyang industri."
        },
        {
          "type": "Complex",
          "text": "While some people view entrepreneurship as a high-risk venture, many others see it as an opportunity to create new jobs and stimulate economic growth.",
          "translation": "Meskipun ada yang melihat wirausaha sebagai usaha berisiko tinggi, banyak yang melihatnya sebagai kesempatan untuk menciptakan lapangan kerja baru dan meningkatkan pertumbuhan ekonomi."
        },
        {
          "type": "Compound",
          "text": "The entrepreneur invested a significant amount of money in the business, but it paid off in the end.",
          "translation": "Wirausaha itu menginvestasikan jumlah besar uang dalam bisnis, tetapi pada akhirnya segalanya berakhir dengan sukses."
        },
        {
          "type": "Compound-Complex",
          "text": "However, the entrepreneur's decision to expand the business to new markets was hindered by the lack of funding, which was exacerbated by the economic downturn.",
          "translation": "Namun, keputusan wirausaha untuk memperluas bisnis ke pasar baru dipengaruhi oleh kekurangan dana, yang semakin parah oleh kemunduran ekonomi."
        }
      ],
      "phonetics": {
        "us": "/ɛntəˈpɾənɪːər/",
        "uk": "/ɛntəˈpɹəʊnɪər/"
      },
      "meaning": "Wirausaha",
      "synonymMeanings": [
        "Pembuat Bisnis",
        "Pengusaha",
        "Wirausaha Kreatif",
        "Pendiri Usaha"
      ],
      "definition": "A person who sets up and runs their own business or organization, taking on financial and management risks in the hope of making a profit."
    },
    {
      "id": "373b7108-968e-43aa-8a55-ea74bbcc4843",
      "word": "Internship",
      "synonyms": [
        "Work placement",
        "training",
        "program"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "During my internship, I gained valuable experience in marketing strategies.",
          "translation": "Dalam pengalaman kerja praktis saya, saya memperoleh pengalaman berharga di strategi pemasaran."
        },
        {
          "type": "Complex",
          "text": "If you are a student, you can apply for an internship in a company to gain relevant work experience.",
          "translation": "Jika Anda seorang siswa, Anda dapat mendaftar sebagai pengalaman kerja praktis di sebuah perusahaan untuk memperoleh pengalaman bekerja relevan."
        },
        {
          "type": "Compound",
          "text": "Many students take internships to gain hands-on experience, but they also learn a lot from their colleagues.",
          "translation": "Banyak siswa yang melakukan pengalaman kerja praktis untuk memperoleh pengalaman langsung, namun mereka juga belajar banyak dari rekan-rekannya."
        },
        {
          "type": "Compound-Complex",
          "text": "While some companies offer internships to students, others require them to have relevant work experience before they can apply for an internship.",
          "translation": "Sementara beberapa perusahaan menawarkan pengalaman kerja praktis kepada siswa, yang lain meminta mereka untuk memiliki pengalaman bekerja yang relevan sebelum mereka dapat mendaftar sebagai pengalaman kerja praktis."
        }
      ],
      "phonetics": {
        "us": "/ɪnˈtɜrnʃɪp/",
        "uk": "/ɪnˈtɜːrnʃɪp/"
      },
      "meaning": "Pengalaman kerja praktis",
      "synonymMeanings": [
        "Pengalaman kerja, Pendidikan profesional"
      ],
      "definition": "A period of work experience, especially one that is unpaid and is designed to give a student or a young person practical training in a particular job or profession."
    },
    {
      "id": "3ef16041-64aa-408e-9a10-a27ce644fa24",
      "word": "Promotion",
      "synonyms": [
        "Career advancement",
        "elevation"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The company's promotion of the new product was highly successful.",
          "translation": "Perusahaan tersebut berhasil memasarkan produk baru mereka."
        },
        {
          "type": "Complex",
          "text": "The marketing team's promotion of the new product helped to increase sales significantly.",
          "translation": "Tim pemasaran berhasil meningkatkan penjualan produk baru tersebut secara signifikan."
        },
        {
          "type": "Compound",
          "text": "The company's expansion into new markets was accompanied by a large-scale promotion of their products.",
          "translation": "Perusahaan tersebut memasuki pasar-pasar baru bersamaan dengan kampanye promosi produk mereka yang besar."
        },
        {
          "type": "Compound-Complex",
          "text": "The company's decision to promote the new product was influenced by the success of their previous campaigns, and it was also driven by the need to increase revenue.",
          "translation": "Keputusan perusahaan untuk memasarkan produk baru mereka dipengaruhi oleh kesuksesan kampanye sebelumnya, serta didorong oleh kebutuhan meningkatkan pendapatan."
        }
      ],
      "phonetics": {
        "us": "/prəˈmuʊʃən/",
        "uk": "/prəˈmʊʃən/"
      },
      "meaning": "Pemasaran atau promosi",
      "synonymMeanings": [
        "Pemasaran",
        "Promosi Komersial",
        "Iklan",
        "Pengenalan"
      ],
      "definition": "The action of making something known or widely available in order to increase its popularity, especially a product or an idea."
    },
    {
      "id": "235ef38d-ced4-4649-85ab-bc992163fa9d",
      "word": "Demotion",
      "synonyms": [
        "Downgrade",
        "dismissal"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The company's decision to demote the manager was met with widespread criticism.",
          "translation": "Perusahaan itu memutuskan untuk menurunkan pangkat manajer dan menerima kritik dari masyarakat."
        },
        {
          "type": "Complex",
          "text": "Despite his protests, the employee was demoted to a lower position after being accused of misconduct.",
          "translation": "Meskipun ia berkeras menolak, karyawan itu akhirnya diturunkan ke posisi yang lebih rendah setelah dituduh melakukan pelanggaran."
        },
        {
          "type": "Compound",
          "text": "The employee was both demoted and given a warning for his poor performance.",
          "translation": "Karyawan itu diturunkan pangkat dan diingatkan tentang perilakunya yang kurang baik."
        },
        {
          "type": "Compound-Complex",
          "text": "The company's decision to demote the manager was met with widespread criticism, and it was also accused of being unfair and biased.",
          "translation": "Perusahaan itu memutuskan untuk menurunkan pangkat manajer dan menerima kritik dari masyarakat, dan juga dituduh tidak adil dan diskriminatif."
        }
      ],
      "phonetics": {
        "us": "/dɪˈmoʊʃən/",
        "uk": "/dɪˈmoʊʃən/"
      },
      "meaning": "Kenaikan pangkat ke tingkat yang lebih rendah",
      "synonymMeanings": [
        "Kenaikan pangkat ke tingkat yang lebih rendah",
        "Diturunkan pangkat",
        "Ditunjuk ke posisi yang lebih rendah"
      ],
      "definition": "The act of reducing someone's status or position in a job or organization, often as a punishment."
    },
    {
      "id": "56ae42ab-e4f4-4112-9f35-cc4e8462209c",
      "word": "Salary",
      "synonyms": [
        "Wages",
        "income"
      ],
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The salary of university professors is generally higher than that of high school teachers.",
          "translation": "Gaji profesor universitas biasanya lebih tinggi daripada gaji guru SMA."
        },
        {
          "type": "Complex",
          "text": "Although the company claims to pay its employees a fair salary, many staff members are dissatisfied with their current compensation.",
          "translation": "Meskipun perusahaan mengaku membayar karyawan dengan gaji yang adil, banyak staf merasa tidak puas dengan kompensasi mereka saat ini."
        },
        {
          "type": "Compound",
          "text": "The government has increased the minimum salary for public servants, but it still falls short of the standard living wage.",
          "translation": "Pemerintah telah meningkatkan gaji minimum untuk pejabat publik, tetapi masih belum mencapai standar gaji hidup yang layak."
        },
        {
          "type": "Compound-Complex",
          "text": "On the one hand, a higher salary can motivate employees to work harder and be more productive, but on the other hand, it can also lead to higher expectations and increased pressure.",
          "translation": "Dari satu sisi, gaji yang lebih tinggi dapat memotivasi karyawan untuk bekerja lebih keras dan lebih produktif, tetapi dari sisi lain, hal ini juga dapat menyebabkan harapan yang lebih tinggi dan tekanan yang lebih besar."
        }
      ],
      "phonetics": {
        "us": "/ˈsæləri/",
        "uk": "/ˈsæləri/"
      },
      "meaning": "Gaji bulanan",
      "synonymMeanings": [
        "upah",
        "penghasilan",
        "hak gaji"
      ],
      "definition": "The amount of money that an employee is paid regularly, usually monthly or weekly, for their work."
    },
    {
      "id": "3b317220-45c8-4df9-a652-c5746b0a1989",
      "word": "Wages",
      "synonyms": [
        "Pay",
        "earnings"
      ],
      "userGuesses": [],
      "status": "discovered"
    },
    {
      "id": "81add737-4bd3-407e-a421-c85e75f61131",
      "word": "Income",
      "synonyms": [
        "Earnings",
        "revenue"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "d819e46a-9b63-4bcb-9b3b-e2afaa107321",
      "word": "Overtime",
      "synonyms": [
        "Extra work",
        "additional",
        "shift"
      ],
      "userGuesses": [],
      "status": "discovered"
    },
    {
      "id": "d304299e-74c0-4e98-af83-48a47638c2c2",
      "word": "Bonus",
      "synonyms": [
        "Incentive",
        "reward"
      ],
      "userGuesses": [],
      "status": "discovered"
    },
    {
      "id": "b82284ae-f78d-4c1a-b724-88778d1ed25d",
      "word": "Pension",
      "synonyms": [
        "Retirement fund",
        "savings"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "7df0d4c8-7525-4989-9279-9e03ec02b0c0",
      "word": "Work-life balance",
      "synonyms": [
        "Lifestyle management",
        "equilibrium"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "0fcd4d43-e7e1-4dff-8658-88d079ec0767",
      "word": "Job satisfaction",
      "synonyms": [
        "Work fulfillment",
        "career",
        "happiness"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "cda9adbc-c82e-4143-851e-5181126711b0",
      "word": "Productivity",
      "synonyms": [
        "Efficiency",
        "output"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "8529a15d-65c8-47c8-a63e-356a9897d4d3",
      "word": "Efficiency",
      "synonyms": [
        "Effectiveness",
        "proficiency"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "37c6bf64-61ce-4d44-aebb-f1915cebf5d8",
      "word": "Redundancy",
      "synonyms": [
        "Layoff",
        "dismissal"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "70d0ad4b-6011-4004-a1a2-70dc60f00004",
      "word": "Resignation",
      "synonyms": [
        "Departure",
        "quitting"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "35e717bf-e10f-423d-925b-0a76aa6ac0e0",
      "word": "Termination",
      "synonyms": [
        "Dismissal",
        "firing"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "692be3c1-793d-4cab-b41b-798f1a606177",
      "word": "Recruitment",
      "synonyms": [
        "Hiring",
        "employment"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "4dc82627-0326-4e2e-b057-212da13b5f8f",
      "word": "Headhunting",
      "synonyms": [
        "Executive search",
        "talent",
        "scouting"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "857c1d93-c35b-445a-ab76-be3bf1243b2c",
      "word": "Workplace discrimination",
      "synonyms": [
        "Bias",
        "prejudice"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "1f5a5392-fd32-4e34-8875-51bc806ccf5c",
      "word": "Trade union",
      "synonyms": [
        "Labor union",
        "workers’",
        "association"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "c667d785-2b04-4b43-a4e7-7c42d80ce4ff",
      "word": "Corporate ladder",
      "synonyms": [
        "Career hierarchy",
        "professional growth"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "eda4cb21-1a07-4cb7-9342-30eb56530495",
      "word": "Glass ceiling",
      "synonyms": [
        "Career barrier",
        "professional limitation"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "eb1aac8b-645f-430c-803a-1b79f93444cb",
      "word": "Micromanagement",
      "synonyms": [
        "Overcontrol",
        "close",
        "monitoring"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "10fe9f2a-b5d0-4f8f-b77b-71b7062e1b7d",
      "word": "Networking",
      "synonyms": [
        "Professional connections",
        "business contacts"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "35e427aa-8fe8-4ef9-bd14-941b15bc8ae0",
      "word": "Job burnout",
      "synonyms": [
        "Work fatigue",
        "exhaustion"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "63cd00cb-f220-4b23-bf41-6f4369ad36ec",
      "word": "Telecommuting",
      "synonyms": [
        "Remote work",
        "working",
        "from home"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "c072c870-7f4c-4356-b7a6-66e95f867ad9",
      "word": "Freelancing",
      "synonyms": [
        "Self-employment",
        "contract",
        "work"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "75ea257b-5072-41c7-8f6d-b44dcd8c06a6",
      "word": "Career progression",
      "synonyms": [
        "Professional growth",
        "promotion"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "e8dd0ae0-5ca4-4e07-8c1b-b4a638a35684",
      "word": "Apprenticeship",
      "synonyms": [
        "Internship",
        "traineeship"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "032a792e-118a-487d-9bd3-635556c2a3a4",
      "word": "Attrition",
      "synonyms": [
        "Employee turnover",
        "downsizing"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "4d745bad-1881-44c8-b31d-26f67022df98",
      "word": "Automation",
      "synonyms": [
        "Mechanization",
        "robotics"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "3d12f930-5853-4f2c-8232-b2a379544590",
      "word": "Blue-collar",
      "synonyms": [
        "Labor-intensive",
        "hands-on"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "d35c0f52-5e17-4961-91ed-51955af7090d",
      "word": "White-collar",
      "synonyms": [
        "Corporate",
        "managerial"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "0a850f87-1f4e-47c4-8470-e1b42fa8cec0",
      "word": "Brain drain",
      "synonyms": [
        "Talent exodus",
        "workforce",
        "migration"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "9eaaf15e-f6a5-49bf-bcef-2155cd69f00a",
      "word": "Career ladder",
      "synonyms": [
        "Career path",
        "professional",
        "growth"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "74a8cbba-7039-4b4a-9ecd-305819b28555",
      "word": "Commission",
      "synonyms": [
        "Incentive",
        "percentage"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "55ad72f7-ce80-4567-af18-c092112803b3",
      "word": "Competency",
      "synonyms": [
        "Skill",
        "expertise"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "84bda0b8-8cbf-46ab-b768-402a758f7ccf",
      "word": "Conglomerate",
      "synonyms": [
        "Corporation",
        "multinational"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "4bf41a76-9853-4089-b23b-97b5f79b2d2b",
      "word": "Dead-end job",
      "synonyms": [
        "Stagnant position",
        "unpromising career"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "e81acc70-0546-4a4a-b148-057533ec6029",
      "word": "Deductions",
      "synonyms": [
        "Withholdings",
        "reductions"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "08f16e90-8b1c-40b2-9f22-9b5db546b79f",
      "word": "Downsizing",
      "synonyms": [
        "Layoff",
        "retrenchment"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "bca2b0c9-4144-45e9-b17d-ab2923304cf5",
      "word": "Entrepreneurship",
      "synonyms": [
        "Business ownership",
        "self-employment"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "870e1692-3467-405d-861b-479d10557284",
      "word": "Fringe benefits",
      "synonyms": [
        "Perks",
        "employee benefits"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "a2d9142e-fd24-4be1-9893-1fd2d17eac53",
      "word": "Glassdoor review",
      "synonyms": [
        "Employee feedback",
        "company rating"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "61bd7d97-bb95-43f3-b9bf-75be3f67d78d",
      "word": "Hierarchy",
      "synonyms": [
        "Chain of command",
        "ranking"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "1effc1d3-5359-4305-8e9b-8f6b4d0b4a99",
      "word": "Job mobility",
      "synonyms": [
        "Career flexibility",
        "advancement"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "091283e5-d901-4577-a78f-afef8d6610e5",
      "word": "Layoff",
      "synonyms": [
        "Redundancy",
        "dismissal"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "4dac9b31-36b3-4689-bafa-3c6dc64e911a",
      "word": "Mentorship",
      "synonyms": [
        "Coaching",
        "guidance"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "9b78a352-e352-4695-bc7d-6423397f712f",
      "word": "Moonlighting",
      "synonyms": [
        "Side job",
        "extra work"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "f84c8cd2-e99e-4018-8ed2-5f3791080ea9",
      "word": "Outsourcing",
      "synonyms": [
        "Subcontracting",
        "external hiring"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "517d0342-dab1-46ba-b403-3b65319fb565",
      "word": "Probation period",
      "synonyms": [
        "Trial period",
        "assessment",
        "phase"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "c3cce863-b9c3-412c-91f1-ee717a6c94ce",
      "word": "Reskilling",
      "synonyms": [
        "Retraining",
        "upskilling"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "acf7402a-c04c-4024-9430-0cb10a28e001",
      "word": "Severance package",
      "synonyms": [
        "Redundancy pay",
        "compensation"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "5fc93f15-d2fb-4b7b-b724-bab756427c57",
      "word": "Succession planning",
      "synonyms": [
        "Leadership development",
        "career planning"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "41c01aef-59f0-47ac-b1b3-6134db0f57e0",
      "word": "Unionization",
      "synonyms": [
        "Collective bargaining",
        "labor organization"
      ],
      "userGuesses": [],
      "status": "hidden"
    },
    {
      "id": "9798595e-f380-4a3a-ab79-053550051bf6",
      "word": "Workplace morale",
      "synonyms": [
        "Job satisfaction",
        "employee motivation"
      ],
      "userGuesses": [],
      "status": "hidden"
    }
  ],
  "createdAt": 1770602925726
}