{
  "id": "5dc6ce02-4cf9-4f6c-a338-e37ab3450f5f",
  "name": "HEALTH",
  "items": [
    {
      "id": "1224371e-8c61-4b88-830d-c4c2b9a44195",
      "word": "Well-being",
      "synonyms": [
        "Wellness",
        "good health"
      ],
      "definition": "The state of being happy, healthy, and prosperous.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kesejahteraan",
      "phonetics": {
        "us": "/ˈwɛlˌbiɪŋ/",
        "uk": "/ˈwɛlˌbiːɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Exercise is essential for our well-being.",
          "translation": "Olahraga sangat penting untuk kesejahteraan kita."
        },
        {
          "type": "Complex",
          "text": "Because regular exercise improves our well-being, we should make it a habit.",
          "translation": "Karena olahraga teratur meningkatkan kesejahteraan kita, kita sebaiknya menjadikannya kebiasaan."
        },
        {
          "type": "Compound",
          "text": "I prioritize my well-being, and I also value my relationships.",
          "translation": "Saya mengutamakan kesejahteraan saya, dan saya juga menghargai hubungan saya."
        },
        {
          "type": "Compound-Complex",
          "text": "While I prioritize my well-being, and I also value my relationships, I believe that a balance between the two is crucial because it affects my overall happiness.",
          "translation": "Saya mengutamakan kesejahteraan saya, dan saya juga menghargai hubungan saya, tetapi saya percaya bahwa keseimbangan antara keduanya sangat penting karena mempengaruhi kebahagiaan saya secara keseluruhan."
        }
      ],
      "synonymMeanings": [
        "Kesehatan",
        "Kebahagiaan",
        "Keselamatan"
      ]
    },
    {
      "id": "0c40f089-70af-4aa8-bd66-fb2a9b30e554",
      "word": "Immunity",
      "synonyms": [
        "Resistance",
        "defense"
      ],
      "definition": "The state of being resistant to a particular disease or infection, often due to the body's immune system.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kekebalan tubuh terhadap suatu penyakit atau infeksi tertentu.",
      "phonetics": {
        "us": "/ɪˈmjuːnɪti/",
        "uk": "/ɪˈmjuːnɪtɪ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The new vaccine has been shown to provide immunity against deadly diseases.",
          "translation": "Vaksin baru ini telah membuktikan bahwa dapat memberikan kekebalan tubuh terhadap penyakit berbahaya."
        },
        {
          "type": "Complex",
          "text": "The country's immunity to the economic crisis has been weakened due to the lack of investment in the education sector.",
          "translation": "Kekebalan negara terhadap krisis ekonomi telah melemah karena kurangnya investasi di sektor pendidikan."
        },
        {
          "type": "Compound",
          "text": "The new policy aims to enhance the country's immunity to diseases, while also promoting economic growth.",
          "translation": "Kebijakan baru ini bertujuan untuk meningkatkan kekebalan tubuh negara terhadap penyakit, sementara juga mempromosikan pertumbuhan ekonomi."
        },
        {
          "type": "Compound-Complex",
          "text": "However, the country's immunity to the economic crisis has been weakened due to the lack of investment in the education sector, which has led to a decline in the quality of human resources.",
          "translation": "Namun, kekebalan negara terhadap krisis ekonomi telah melemah karena kurangnya investasi di sektor pendidikan, yang telah menyebabkan penurunan kualitas sumber daya manusia."
        }
      ],
      "synonymMeanings": [
        "kekebalan tubuh",
        "penguatan sistem kekebalan",
        "toleransi terhadap penyakit"
      ]
    },
    {
      "id": "5492f24a-fa37-460b-bf85-6c0f9f3f5a30",
      "word": "Nutrition",
      "synonyms": [
        "Diet",
        "nourishment"
      ],
      "definition": "The study of food and how it affects the body, or the process of eating and using food to keep the body healthy",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Gizi",
      "phonetics": {
        "us": "/nuˈtrɪʃən/",
        "uk": "/njuːˈtrɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Proper nutrition is essential for good health.",
          "translation": "Gizi yang tepat sangat penting untuk kesehatan yang baik."
        },
        {
          "type": "Complex",
          "text": "Because she had a poor diet, she decided to take a course on nutrition to learn how to eat healthier.",
          "translation": "Karena dia memiliki pola makan yang buruk, dia memutuskan untuk mengikuti kursus gizi untuk belajar makan lebih sehat."
        },
        {
          "type": "Compound",
          "text": "I exercise regularly and I also eat a balanced diet to maintain good nutrition and overall health.",
          "translation": "Saya berolahraga secara teratur dan saya juga makan makanan seimbang untuk menjaga gizi dan kesehatan secara keseluruhan."
        },
        {
          "type": "Compound-Complex",
          "text": "While many people believe that a low-carb diet is the key to weight loss, others argue that a balanced nutrition plan, which includes a variety of foods, is more effective in the long run, because it provides the body with all the necessary nutrients.",
          "translation": "Sementara banyak orang percaya bahwa diet rendah karbohidrat adalah kunci untuk menurunkan berat badan, yang lain berargumentasi bahwa rencana gizi seimbang, yang mencakup berbagai makanan, lebih efektif dalam jangka panjang, karena menyediakan tubuh dengan semua nutrisi yang diperlukan."
        }
      ],
      "synonymMeanings": [
        "Pemberian makan",
        "Penggunaan makanan",
        "Keseimbangan makanan",
        "Pemasukan makanan"
      ]
    },
    {
      "id": "39dfa10f-e952-4fa5-8ffd-b18aa8eeecb9",
      "word": "Obesity",
      "synonyms": [
        "Overweight",
        "excessive fat"
      ],
      "definition": "A medical condition in which a person has an excessive amount of body fat.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kegemukan",
      "phonetics": {
        "us": "/ˌob.ɪˈsɪti/",
        "uk": "/ˌəʊ.bɪˈsɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Obesity is a major risk factor for heart disease.",
          "translation": "Kegemukan adalah salah satu faktor resiko besar penyakit jantung."
        },
        {
          "type": "Complex",
          "text": "While some people may blame genetics for obesity, research suggests that diet and lifestyle play a significant role.",
          "translation": "Meskipun beberapa orang mungkin menuduh genetik sebagai penyebab kegemukan, penelitian menunjukkan bahwa pola makan dan gaya hidup memiliki peran yang signifikan."
        },
        {
          "type": "Compound",
          "text": "Obesity and smoking are two major public health concerns in many countries.",
          "translation": "Kegemukan dan merokok adalah dua masalah kesehatan masyarakat besar di banyak negara."
        },
        {
          "type": "Compound-Complex",
          "text": "The increasing prevalence of obesity worldwide is attributed to a combination of factors, including urbanization, lack of physical activity, and unhealthy eating habits.",
          "translation": "Peningkatan prevalensi kegemukan di seluruh dunia disebabkan oleh kombinasi faktor-faktor, termasuk urbanisasi, kurangnya aktivitas fisik, dan kebiasaan makan yang tidak sehat."
        }
      ],
      "synonymMeanings": [
        "Gemukan",
        "Kerentanan",
        "Kegemukan Berat"
      ]
    },
    {
      "id": "b9ac9776-0325-424d-ac5e-15ec03664d82",
      "word": "Sedentary lifestyle",
      "synonyms": [
        "Inactive lifestyle",
        "desk-bound routine"
      ],
      "definition": "A lifestyle that involves little or no physical activity, often leading to health problems.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Gaya hidup yang kurang aktif secara fisik",
      "phonetics": {
        "us": "/sɪdɛnˈtɛri lɪˈfaɪl/",
        "uk": "/sɪdɛnˈtɛri laɪˈfaɪl/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "A sedentary lifestyle has been linked to various health issues.",
          "translation": "Gaya hidup yang kurang aktif secara fisik telah terkait dengan berbagai masalah kesehatan."
        },
        {
          "type": "Complex",
          "text": "Research has shown that a sedentary lifestyle can lead to obesity and other health problems, especially for children.",
          "translation": "Penelitian telah menunjukkan bahwa gaya hidup yang kurang aktif secara fisik dapat menyebabkan kelebihan berat badan dan masalah kesehatan lainnya, terutama pada anak-anak."
        },
        {
          "type": "Compound",
          "text": "Exercising regularly and eating a balanced diet can help reduce the risks associated with a sedentary lifestyle, but it is also important to limit screen time.",
          "translation": "Berolahraga secara teratur dan mengonsumsi diet seimbang dapat membantu mengurangi risiko yang terkait dengan gaya hidup yang kurang aktif secara fisik, tetapi juga penting untuk membatasi waktu menyaksikan layar."
        },
        {
          "type": "Compound-Complex",
          "text": "While a sedentary lifestyle can have many negative consequences, it is also a common phenomenon in modern society, where people often spend most of their time sitting in front of computers or watching TV.",
          "translation": "Meskipun gaya hidup yang kurang aktif secara fisik dapat memiliki banyak konsekuensi negatif, hal ini juga merupakan fenomena umum dalam masyarakat modern, di mana orang sering menghabiskan waktu mereka duduk di depan komputer atau menonton TV."
        }
      ],
      "synonymMeanings": [
        "gaya hidup kurang aktif",
        "gaya hidup tidak aktif",
        "gaya hidup tidak bergerak"
      ]
    },
    {
      "id": "cfabfa98-154c-450f-a9e3-30803f2e806b",
      "word": "Cardiovascular disease",
      "synonyms": [
        "Heart disease",
        "circulatory disorder"
      ],
      "definition": "A medical condition that affects the heart and blood vessels, often caused by a lack of exercise, a poor diet, and smoking.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Penyakit peredaran darah",
      "phonetics": {
        "us": "/ˌkɑr.dioʊˈvæskjʊˌlɛr dɪˈziːz/",
        "uk": "/ˌkɑːr.dioʊˈvæskjʊˌlɛr dɪˈziːz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Cardiovascular disease is the leading cause of death worldwide.",
          "translation": "Penyakit peredaran darah adalah penyebab utama kematian di seluruh dunia."
        },
        {
          "type": "Complex",
          "text": "Regular exercise can help reduce the risk of cardiovascular disease in individuals who are overweight.",
          "translation": "Latihan teratur dapat membantu mengurangi risiko penyakit peredaran darah pada individu yang kelebihan berat badan."
        },
        {
          "type": "Compound",
          "text": "Smoking is a major risk factor for cardiovascular disease and heart attacks, while a healthy diet and regular exercise can help prevent them.",
          "translation": "Merokok adalah faktor risiko utama penyakit peredaran darah dan serangan jantung, sedangkan diet seimbang dan latihan teratur dapat membantu mencegahnya."
        },
        {
          "type": "Compound-Complex",
          "text": "If you have a family history of cardiovascular disease, you should consult with your doctor about the best ways to prevent it, such as maintaining a healthy weight, exercising regularly, and following a balanced diet.",
          "translation": "Jika Anda memiliki riwayat keluarga penyakit peredaran darah, sebaiknya Anda berkonsultasi dengan dokter tentang cara terbaik untuk mencegahnya, seperti menjaga berat badan yang sehat, berolahraga secara teratur, dan mengikuti diet seimbang."
        }
      ],
      "synonymMeanings": [
        "penyakit jantung",
        "penyakit pembuluh darah",
        "penyakit peredaran darah koroner",
        "penyakit pernapasan"
      ]
    },
    {
      "id": "077d0ac6-1c9a-4e74-9163-3d017e598fc2",
      "word": "Diabetes",
      "synonyms": [
        "Blood sugar disorder",
        "hyperglycemia"
      ],
      "definition": "a medical condition in which the body does not produce enough insulin, leading to high blood sugar levels",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "penyakit diabetes",
      "phonetics": {
        "us": "/daɪəˈbiːtiːz/",
        "uk": "/ˈdaɪəbɪtiːz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She was diagnosed with diabetes.",
          "translation": "Dia didiagnosis menderita penyakit diabetes."
        },
        {
          "type": "Complex",
          "text": "Because she has diabetes, she has to monitor her blood sugar levels constantly.",
          "translation": "Karena dia menderita penyakit diabetes, dia harus terus-menerus memantau kadar gula darahnya."
        },
        {
          "type": "Compound",
          "text": "She has diabetes and her brother has it too.",
          "translation": "Dia menderita penyakit diabetes dan saudaranya juga menderitanya."
        },
        {
          "type": "Compound-Complex",
          "text": "While she has diabetes, her brother has it too, and because of that, they both have to be careful with their diet.",
          "translation": "Sementara dia menderita penyakit diabetes, saudaranya juga menderitanya, dan karena itu, mereka berdua harus berhati-hati dengan pola makan mereka."
        }
      ],
      "synonymMeanings": [
        "penyakit gula",
        "penyakit kencing manis"
      ]
    },
    {
      "id": "979f0398-3997-4b54-9277-61abc214ce5a",
      "word": "Hypertension",
      "synonyms": [
        "High BP",
        "elevated pressure"
      ],
      "definition": "a medical condition in which the blood pressure is higher than normal",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "hipertensi",
      "phonetics": {
        "us": "/ˌhaɪpərˈtɛnʃən/",
        "uk": "/ˌhʌɪpəˈtɛnʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The doctor warned me about hypertension.",
          "translation": "Dokter memperingatkan saya tentang hipertensi."
        },
        {
          "type": "Complex",
          "text": "Because I have a family history of hypertension, I need to monitor my blood pressure regularly.",
          "translation": "Karena saya memiliki riwayat keluarga dengan hipertensi, saya perlu memantau tekanan darah saya secara teratur."
        },
        {
          "type": "Compound",
          "text": "I exercise regularly and I eat healthy food, but I still have hypertension and high cholesterol.",
          "translation": "Saya berolahraga secara teratur dan saya makan makanan sehat, tetapi saya masih memiliki hipertensi dan kolesterol tinggi."
        },
        {
          "type": "Compound-Complex",
          "text": "While I was aware that obesity could lead to hypertension, I did not expect that I would develop kidney disease as a result of my condition, and now I have to undergo dialysis regularly.",
          "translation": "Sementara saya menyadari bahwa obesitas bisa menyebabkan hipertensi, saya tidak mengharapkan bahwa saya akan mengembangkan penyakit ginjal sebagai hasil dari kondisi saya, dan sekarang saya harus menjalani dialisis secara teratur."
        }
      ],
      "synonymMeanings": [
        "tekanan darah tinggi",
        "penyakit jantung",
        "penyakit kardiovaskular"
      ]
    },
    {
      "id": "91a2dd83-ce50-4861-bc18-5196d8d4ce9a",
      "word": "Allergy",
      "synonyms": [
        "Hypersensitivity",
        "allergic reaction"
      ],
      "definition": "An abnormal immune reaction to a particular substance which can cause a range of symptoms, from mild discomfort to life-threatening conditions.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Reaksi alergi atau reaksi hipersensitif",
      "phonetics": {
        "us": "/ˈælərˌdʒi/",
        "uk": "/ˈælədʒi/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing number of people suffering from allergies is a major public health concern.",
          "translation": "Jumlah orang yang menderita alergi meningkat dan menjadi masalah kesehatan masyarakat."
        },
        {
          "type": "Complex",
          "text": "While some people are born with allergies, others develop them later in life due to various environmental factors.",
          "translation": "Namun, beberapa orang dilahirkan dengan alergi, sementara yang lain mengembangkan kondisi tersebut karena berbagai faktor lingkungan."
        },
        {
          "type": "Compound",
          "text": "The symptoms of an allergic reaction can range from mild, such as a runny nose, to severe, like anaphylactic shock.",
          "translation": "Gejala reaksi alergi dapat beragam, mulai dari gejala ringan seperti hidung berair hingga gejala berat seperti kejutan anafilaksis."
        },
        {
          "type": "Compound-Complex",
          "text": "While some people may be able to manage their allergies with medication, others may need to take more drastic measures, such as avoiding certain foods or environments.",
          "translation": "Meskipun beberapa orang mungkin dapat mengelola alergi mereka dengan obat-obatan, yang lain mungkin perlu melakukan tindakan lebih drastis, seperti menghindari makanan atau lingkungan tertentu."
        }
      ],
      "synonymMeanings": [
        "Kerusakan, Reaksi Hipersensitif"
      ]
    },
    {
      "id": "63e7e06c-2e3a-4353-8e7b-5e3c88b8f03f",
      "word": "Mental health",
      "synonyms": [
        "Psychological wellness",
        "emotional"
      ],
      "definition": "A person's emotional, psychological, and social well-being.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kesejahteraan mental",
      "phonetics": {
        "us": "/mɛn.təl.hɛlθ/",
        "uk": "/mɛn.təl.hɛlθ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Maintaining good mental health is essential for a happy life.",
          "translation": "Mengembangkan kesejahteraan mental yang baik sangat penting untuk hidup bahagia."
        },
        {
          "type": "Complex",
          "text": "The increasing stress of modern life can have a negative impact on one's mental well-being, leading to depression and anxiety.",
          "translation": "Stres yang semakin meningkat dalam kehidupan modern dapat memiliki dampak negatif pada keadaan mental seseorang, sehingga menyebabkan kecemasan dan depresi."
        },
        {
          "type": "Compound",
          "text": "Good mental health is essential for a happy life, and it's also crucial for maintaining a healthy relationship with others.",
          "translation": "Kesejahteraan mental yang baik sangat penting untuk hidup bahagia, dan juga sangat penting untuk menjaga hubungan sehat dengan orang lain."
        },
        {
          "type": "Compound-Complex",
          "text": "While some people may experience mental health issues due to genetics or environmental factors, it's also important to recognize the impact of social media on our mental well-being, as excessive screen time can lead to feelings of loneliness and isolation.",
          "translation": "Meskipun beberapa orang mungkin mengalami masalah kesehatan mental karena faktor genetik atau lingkungan, juga penting untuk mengakui dampak media sosial terhadap kesejahteraan mental kita, karena waktu layar yang berlebihan dapat menyebabkan perasaan kesepian dan isolasi."
        }
      ],
      "synonymMeanings": [
        "Kesejahteraan emosi",
        "Kesehatan jiwa",
        "Mental"
      ]
    },
    {
      "id": "d6acc89f-7db9-4b21-b950-98311be419cf",
      "word": "Depression",
      "synonyms": [
        "Melancholy",
        "major depressive disorder"
      ],
      "definition": "A state of low mood and aversion to activity that is characterised by feelings of sadness, hopelessness, and a lack of interest or pleasure in external stimuli.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kesedihan mental",
      "phonetics": {
        "us": "/ˈdɛprɛʃən/",
        "uk": "/ˈdɛprɛʃn/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing rate of depression among young people is a major concern.",
          "translation": "Kesedihan mental yang semakin meningkat di kalangan remaja merupakan perhatian besar."
        },
        {
          "type": "Complex",
          "text": "The lack of exercise and poor diet are often cited as contributing factors to depression.",
          "translation": "Kurangnya olahraga dan pola makan yang buruk sering dikemukakan sebagai faktor yang mempengaruhi kemunculan kesedihan mental."
        },
        {
          "type": "Compound",
          "text": "The symptoms of depression are varied and can include feelings of sadness, loss of interest in activities, and changes in appetite or sleep patterns.",
          "translation": "Gejala kesedihan mental beragam dan dapat mencakup perasaan sedih, hilang minat dalam aktivitas, dan perubahan pola makan atau pola tidur."
        },
        {
          "type": "Compound-Complex",
          "text": "In addition to the physical symptoms of depression, individuals may also experience emotional and social problems, such as feelings of guilt and shame, difficulty forming and maintaining relationships, and social withdrawal.",
          "translation": "Selain gejala fisik kesedihan mental, individu juga mungkin mengalami masalah emosional dan sosial, seperti perasaan bersalah dan malu, kesulitan membentuk dan mempertahankan hubungan, serta penarikan diri sosial."
        }
      ],
      "synonymMeanings": [
        "Kesedihan mental",
        "Mental gangguan",
        "Kesurupan mental"
      ]
    },
    {
      "id": "5beb8de3-5ddd-4a03-a0af-fd30a541d8cf",
      "word": "Anxiety disorder",
      "synonyms": [
        "Nervous disorder",
        "panic disorder"
      ],
      "definition": "A mental health condition characterized by feelings of worry, nervousness, and fear that are persistent and overwhelming.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kondisi kesehatan mental yang disertai perasaan khawatir, gelisah, dan takut yang berkepanjangan dan menghantui.",
      "phonetics": {
        "us": "/ænˈsɪdəti dɪˈsɔrdər/",
        "uk": "/ænˈsɪdəti daɪˈsɔːdə/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The anxiety disorder has been a major obstacle in my academic career.",
          "translation": "Saya menghadapi banyak tantangan dalam karier akademik saya karena gangguan kecemasan ini."
        },
        {
          "type": "Complex",
          "text": "The anxiety disorder has been a major obstacle in my academic career, which has led to a significant decrease in my self-esteem and confidence.",
          "translation": "Saya menghadapi banyak tantangan dalam karier akademik saya karena gangguan kecemasan ini, sehingga mengakibatkan penurunan signifikan pada kepercayaan diri saya."
        },
        {
          "type": "Compound",
          "text": "I have been experiencing anxiety disorder symptoms for the past year, and it has affected my relationships with my family and friends.",
          "translation": "Saya telah mengalami gejala gangguan kecemasan selama setahun terakhir, dan hal ini telah mempengaruhi hubungan saya dengan keluarga dan teman-teman saya."
        },
        {
          "type": "Compound-Complex",
          "text": "I have been experiencing anxiety disorder symptoms for the past year, which has affected my relationships with my family and friends, and it has also led to a decrease in my productivity and academic performance.",
          "translation": "Saya telah mengalami gejala gangguan kecemasan selama setahun terakhir, yang telah mempengaruhi hubungan saya dengan keluarga dan teman-teman saya, dan hal ini juga telah menyebabkan penurunan produktivitas dan kinerja akademik saya."
        }
      ],
      "synonymMeanings": [
        "Kecemasan",
        "Gangguan kecemasan",
        "Depresi",
        "Kesedihan"
      ]
    },
    {
      "id": "b3ced70b-5015-4a56-86ab-aab88f351176",
      "word": "Therapy",
      "synonyms": [
        "Rehabilitation",
        "counseling"
      ],
      "definition": "Treatment intended to cure or help a particular condition, especially a mental or physical one",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Terapi",
      "phonetics": {
        "us": "/ˈθɛrəpi/",
        "uk": "/ˈθerəpi/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She underwent therapy to recover from her injury.",
          "translation": "Dia menjalani terapi untuk pulih dari cedera tersebut."
        },
        {
          "type": "Complex",
          "text": "Because she was experiencing anxiety, she decided to attend therapy sessions.",
          "translation": "Karena dia mengalami kecemasan, dia memutuskan untuk menghadiri sesi terapi."
        },
        {
          "type": "Compound",
          "text": "The doctor prescribed therapy and medication, and she started to feel better soon.",
          "translation": "Dokter meresepkan terapi dan obat, dan dia mulai merasa lebih baik segera."
        },
        {
          "type": "Compound-Complex",
          "text": "While she was attending therapy sessions, her friends were very supportive, and she soon realized that the therapy was helping her to manage her stress.",
          "translation": "Sementara dia menghadiri sesi terapi, teman-temannya sangat mendukung, dan dia segera menyadari bahwa terapi tersebut membantunya untuk mengelola stresnya."
        }
      ],
      "synonymMeanings": [
        "pengobatan",
        "perawatan",
        "penyembuhan",
        "rehabilitasi"
      ]
    },
    {
      "id": "ac63b3c1-ab56-4376-a784-bd242b364aaa",
      "word": "Vaccination",
      "synonyms": [
        "Immunization",
        "inoculation"
      ],
      "definition": "The act of introducing a vaccine to the body, especially by injection, to provide immunity against a particular infectious disease.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Pemberian vaksin",
      "phonetics": {
        "us": "/ˌvæksɪˈneɪʃən/",
        "uk": "/ˌvæksɪˈneɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Vaccination is an essential measure to prevent the spread of infectious diseases.",
          "translation": "Pemberian vaksin adalah langkah penting untuk mencegah penyebaran penyakit menular."
        },
        {
          "type": "Complex",
          "text": "The benefits of vaccination have been widely recognized by the medical community, but some people still hesitate to get vaccinated.",
          "translation": "Manfaat vaksin telah dikenal luas oleh komunitas kedokteran, tetapi beberapa orang masih ragu untuk divaksin."
        },
        {
          "type": "Compound",
          "text": "Vaccination programs have been implemented in many countries to control outbreaks of infectious diseases, but the success rate varies greatly.",
          "translation": "Program vaksin telah diimplementasikan di banyak negara untuk mengendalikan wabah penyakit menular, tetapi tingkat keberhasilannya sangat beragam."
        },
        {
          "type": "Compound-Complex",
          "text": "Although vaccination has been proven to be effective in preventing the spread of infectious diseases, its effectiveness can be compromised by various factors such as the quality of the vaccine and the level of public awareness.",
          "translation": "Meskipun vaksin telah terbukti efektif dalam mencegah penyebaran penyakit menular, keefektifannya dapat terganggu oleh berbagai faktor seperti kualitas vaksin dan tingkat kesadaran masyarakat."
        }
      ],
      "synonymMeanings": [
        "pemberian imunisasi",
        "pengobatan dengan vaksin"
      ]
    },
    {
      "id": "5837a8f6-23bf-4999-b231-001f35f8f1ca",
      "word": "Epidemic",
      "synonyms": [
        "Outbreak",
        "pandemic"
      ],
      "definition": "A widespread outbreak of disease, especially one caused by a highly infectious agent.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Wabah penyakit yang menyebar luas",
      "phonetics": {
        "us": "/ɪˈpɪdɛmɪk/",
        "uk": "/ɪˈpɪdɛmɪk/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The city is experiencing an epidemic of influenza.",
          "translation": "Kota ini sedang mengalami wabah influenza."
        },
        {
          "type": "Complex",
          "text": "Due to the severe weather conditions, the epidemic of dengue fever has reached an alarming rate.",
          "translation": "Karena kondisi cuaca yang ekstrem, wabah demam berdarah telah mencapai tingkat yang sangat membahayakan."
        },
        {
          "type": "Compound",
          "text": "The new vaccine has been developed to combat the ongoing epidemic of measles, and it is expected to be widely available soon.",
          "translation": "Vaksin baru telah dikembangkan untuk melawan wabah campak yang berlangsung, dan diharapkan akan tersedia luas segera."
        },
        {
          "type": "Compound-Complex",
          "text": "As a result of the inadequate healthcare system, the epidemic of tuberculosis has spread rapidly throughout the country, which has led to a significant increase in mortality rates.",
          "translation": "Sebagai akibat dari sistem kesehatan yang tidak memadai, wabah penyakit tuberkulosis telah menyebar dengan cepat di seluruh negeri, yang telah menyebabkan peningkatan signifikan tingkat kematian."
        }
      ],
      "synonymMeanings": [
        "Wabah penyakit",
        "Penyakit menular",
        "Pandemi"
      ]
    },
    {
      "id": "9ab221b1-7667-422b-a7a5-e790fc182482",
      "word": "Contagious",
      "synonyms": [
        "Infectious",
        "transmittable"
      ],
      "definition": "Spreading or catching easily from one person or thing to another.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Mudah menular",
      "phonetics": {
        "us": "/kɑnˈteɪdʒəs/ ",
        "uk": "/kɒnˈteɪdʒəs/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The highly contagious disease spread rapidly across the country.",
          "translation": "Penyakit yang mudah menular itu menyebar dengan cepat di seluruh negeri."
        },
        {
          "type": "Complex",
          "text": "Although the virus was highly contagious, the government was able to contain its spread.",
          "translation": "Meskipun virus itu mudah menular, pemerintah berhasil mengendalikan penyebarannya."
        },
        {
          "type": "Compound",
          "text": "The highly contagious disease and lack of healthcare facilities made the situation extremely difficult for the patients.",
          "translation": "Penyakit yang mudah menular dan kekurangan fasilitas kesehatan membuat situasi bagi pasien sangat sulit."
        },
        {
          "type": "Compound-Complex",
          "text": "Although the new medicine was highly effective in treating the disease, its highly contagious nature made it difficult to control its spread, and as a result, the government had to implement strict measures to contain it.",
          "translation": "Meskipun obat baru itu sangat efektif dalam mengobati penyakit, sifatnya yang mudah menular membuat sulit untuk mengendalikan penyebarannya, sehingga pemerintah harus mengambil tindakan ketat untuk mengendalikannya."
        }
      ],
      "synonymMeanings": [
        "Menular",
        "Mudah menyebar",
        "Berjangkit"
      ]
    },
    {
      "id": "15966760-fd68-4015-9260-d9d94f6fdddf",
      "word": "Rehabilitation",
      "synonyms": [
        "Recovery",
        "therapy"
      ],
      "definition": "The process of helping someone who has been ill or in prison to become healthy or normal again",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Rehabilitasi",
      "phonetics": {
        "us": "/ˌrɛhəbɪlɪˈteɪʃən/",
        "uk": "/ˌriːhəbɪlɪˈteɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The hospital offers rehabilitation programs for patients with physical disabilities.",
          "translation": "Rumah sakit tersebut menawarkan program rehabilitasi untuk pasien dengan disabilitas fisik."
        },
        {
          "type": "Complex",
          "text": "Because she had a stroke, she needs rehabilitation to regain her ability to speak.",
          "translation": "Karena dia mengalami stroke, dia memerlukan rehabilitasi untuk mendapatkan kembali kemampuan berbicaranya."
        },
        {
          "type": "Compound",
          "text": "The rehabilitation center helps patients, and it also trains doctors and nurses.",
          "translation": "Pusat rehabilitasi membantu pasien, dan juga melatih dokter dan perawat."
        },
        {
          "type": "Compound-Complex",
          "text": "While the new policy has been implemented, the rehabilitation program has been modified, and it now includes counseling for patients and their families, because it has been proven to be effective.",
          "translation": "Sementara kebijakan baru telah diimplementasikan, program rehabilitasi telah dimodifikasi, dan sekarang termasuk konseling untuk pasien dan keluarga mereka, karena telah terbukti efektif."
        }
      ],
      "synonymMeanings": [
        "Pemulihan",
        "Pengembalian",
        "Perbaikan",
        "Pemasyarakatan"
      ]
    },
    {
      "id": "4f745f2a-217c-4804-a770-46ed7ffc1836",
      "word": "Malnutrition",
      "synonyms": [
        "Undernourishment",
        "starvation"
      ],
      "definition": "A condition that occurs when the body does not get the nutrients it needs to function properly.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Keadaan kurang gizi",
      "phonetics": {
        "us": "/mælnʌtɪˈreɪʃən/",
        "uk": "/mælˈnʌtɪreɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Malnutrition is a major health problem in developing countries.",
          "translation": "Keadaan kurang gizi merupakan masalah kesehatan utama di negara-negara berkembang."
        },
        {
          "type": "Complex",
          "text": "The lack of access to nutritious food is a significant contributor to malnutrition in many parts of the world.",
          "translation": "Keterbatasan akses makanan bergizi merupakan kontributor signifikan terhadap keadaan kurang gizi di banyak bagian dunia."
        },
        {
          "type": "Compound",
          "text": "Malnutrition and poverty are closely linked, and addressing one issue requires addressing the other as well.",
          "translation": "Keadaan kurang gizi dan kemiskinan terkait erat, sehingga menangani satu masalah memerlukan menangani masalah lainnya juga."
        },
        {
          "type": "Compound-Complex",
          "text": "As a result of malnutrition, children are more likely to suffer from stunted growth and impaired cognitive development, which can have long-term consequences for their health and educational outcomes.",
          "translation": "Sebagai hasil dari keadaan kurang gizi, anak-anak lebih cenderung mengalami pertumbuhan terhambat dan perkembangan kognitif yang terganggu, yang dapat memiliki konsekuensi jangka panjang bagi kesehatan dan hasil pendidikannya."
        }
      ],
      "synonymMeanings": [
        "Kurang gizi",
        "Gizi buruk",
        "Kekurangan nutrisi",
        "Defisiensi nutrisi"
      ]
    },
    {
      "id": "1d741244-2995-46ad-b4e3-c20ec25488ad",
      "word": "Holistic medicine",
      "synonyms": [
        "Alternative medicine",
        "integrative health"
      ],
      "definition": "A system of medical treatment that focuses on the whole person - the physical, mental, and spiritual - rather than just treating symptoms.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Pengobatan holistik yang melibatkan aspek fisik, mental, dan spiritual seseorang.",
      "phonetics": {
        "us": "/hoʊˈlɪstɪk mɛdɪˈsiːn/",
        "uk": "/hoʊˈlɪstɪk mɛdɪˈsiːn/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Some people prefer holistic medicine to conventional treatment for chronic illnesses.",
          "translation": "Beberapa orang lebih memilih pengobatan holistik daripada pengobatan konvensional untuk penyakit kronis."
        },
        {
          "type": "Complex",
          "text": "The increasing popularity of holistic medicine has led to a significant shift in the way people think about health and wellness.",
          "translation": "Kenaikan popularitas pengobatan holistik telah menyebabkan perubahan signifikan tentang cara orang berpikir tentang kesehatan dan kesejahteraan."
        },
        {
          "type": "Compound",
          "text": "While conventional medicine focuses on treating symptoms, holistic medicine addresses the root cause of a problem, and conventional medicine is often more expensive.",
          "translation": "Meskipun pengobatan konvensional fokus pada mengobati gejala, pengobatan holistik menangani penyebab pokok masalah, dan pengobatan konvensional seringkali lebih mahal."
        },
        {
          "type": "Compound-Complex",
          "text": "The lack of scientific evidence supporting the effectiveness of holistic medicine is a major concern for many people, but proponents argue that it has been successful in treating various conditions, such as chronic pain and mental health issues.",
          "translation": "Keterbatasan bukti ilmiah yang mendukung kemampuan pengobatan holistik adalah kekhawatiran utama bagi banyak orang, tapi pendukungnya berargumen bahwa pengobatan holistik telah berhasil mengobati berbagai kondisi, seperti nyeri kronis dan masalah kesehatan mental."
        }
      ],
      "synonymMeanings": [
        "Pengobatan Integratif",
        "Pengobatan Alternatif"
      ]
    },
    {
      "id": "4d4c4cb6-8827-4b09-896e-cd071fe277a2",
      "word": "Herbal remedies",
      "synonyms": [
        "Natural medicine",
        "traditional healing"
      ],
      "definition": "Natural products used to treat or prevent illness, often derived from plants.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Obat-obatan alami",
      "phonetics": {
        "us": "/hərˈbæl rɪˈmɛdi/",
        "uk": "/hərˈbæl rɪˈmɛdi/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Herbal remedies have been used for centuries to treat various health conditions.",
          "translation": "Obat-obatan alami telah digunakan selama berabad-abad untuk mengobati berbagai kondisi kesehatan."
        },
        {
          "type": "Complex",
          "text": "While some people believe that herbal remedies are effective, others argue that their benefits are not backed by scientific evidence.",
          "translation": "Meskipun beberapa orang percaya bahwa obat-obatan alami efektif, orang lain berargumentasi bahwa manfaatnya tidak didukung bukti ilmiah."
        },
        {
          "type": "Compound",
          "text": "Herbal remedies can be found in various forms, including teas, capsules, and ointments, which are often sold in health food stores.",
          "translation": "Obat-obatan alami dapat ditemukan dalam berbagai bentuk, termasuk teh, kapsul, dan salep, yang seringkali dijual di toko makanan sehat."
        },
        {
          "type": "Compound-Complex",
          "text": "In addition to their potential health benefits, herbal remedies are often preferred because they are a more natural alternative to conventional medications, which can have numerous side effects.",
          "translation": "Selain potensi manfaat kesehatannya, obat-obatan alami sering dipilih karena merupakan alternatif alami yang lebih baik daripada obat konvensional, yang dapat memiliki efek sampingan yang banyak."
        }
      ],
      "synonymMeanings": [
        "jamu",
        "ramuan obat",
        "remede alami"
      ]
    },
    {
      "id": "53cc691c-d6f2-448b-a27d-7fca0c0eb3b5",
      "word": "Addiction",
      "synonyms": [
        "Dependency",
        "substance abuse"
      ],
      "definition": "The state of being physically or mentally dependent on something, especially a substance such as a drug or an activity such as gambling.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Ketergantungan",
      "phonetics": {
        "us": "/əˈdɪkʃən/",
        "uk": "/əˈdɪkʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The government has launched a campaign to raise awareness about the dangers of addiction to social media.",
          "translation": "Pemerintah telah meluncurkan kampanye untuk meningkatkan kesadaran tentang bahaya ketergantungan media sosial."
        },
        {
          "type": "Complex",
          "text": "Studies have shown that people who suffer from addiction to cigarettes are more likely to develop other health problems.",
          "translation": "Penelitian telah menunjukkan bahwa orang-orang yang menderita ketergantungan rokok lebih cenderung mengembangkan masalah kesehatan lainnya."
        },
        {
          "type": "Compound",
          "text": "Addiction to smartphones has become a major problem in modern society, and parents need to take action to prevent it among their children.",
          "translation": "Ketergantungan smartphone telah menjadi masalah besar di masyarakat modern, dan orang tua perlu mengambil tindakan untuk mencegahnya di kalangan anak-anak mereka."
        },
        {
          "type": "Compound-Complex",
          "text": "While some people claim that addiction to video games is a harmless habit, research has shown that excessive gaming can lead to mental health issues, especially among young people.",
          "translation": "Meskipun ada orang-orang yang mengklaim bahwa ketergantungan game video adalah kebiasaan yang tidak berbahaya, penelitian telah menunjukkan bahwa bermain game secara berlebihan dapat menyebabkan masalah kesehatan mental, terutama di kalangan remaja."
        }
      ],
      "synonymMeanings": [
        "Ketergantungan fisik",
        "Ketergantungan mental",
        "Narkotika",
        "Ketergantungan pada aktivitas"
      ]
    },
    {
      "id": "ccd6bfeb-b760-407b-977c-21f75f217219",
      "word": "Withdrawal symptoms",
      "synonyms": [
        "Detox effects",
        "cravings"
      ],
      "definition": "Physical and psychological reactions that occur when a person stops taking a substance to which they have become addicted.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Gejala perlawanan kesehatan yang timbul ketika seseorang berhenti mengonsumsi zat yang telah menyebabkan kecanduan.",
      "phonetics": {
        "us": "/ˌwɪdrɔːwəl ˈsɪmp.təmz/",
        "uk": "/ˌwɪdrəwəl ˈsɪmp.təmz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Many people experience withdrawal symptoms after quitting smoking.",
          "translation": "Banyak orang mengalami gejala perlawanan kesehatan setelah berhenti merokok."
        },
        {
          "type": "Complex",
          "text": "The severity of withdrawal symptoms can vary greatly from person to person, depending on factors such as the length of addiction.",
          "translation": "Kebanyakan gejala perlawanan kesehatan dapat berbeda-beda dari satu orang ke orang lainnya, tergantung pada berbagai faktor seperti lama kecanduan."
        },
        {
          "type": "Compound",
          "text": "Withdrawal symptoms include headaches, nausea, and irritability, as well as sleep disturbances and mood swings.",
          "translation": "Gejala perlawanan kesehatan termasuk sakit kepala, mual, dan ketegangan, serta gangguan tidur dan perubahan suasana hati."
        },
        {
          "type": "Compound-Complex",
          "text": "Although some people may experience mild withdrawal symptoms, others may experience severe symptoms that require medical attention, such as hallucinations and seizures.",
          "translation": "Meskipun beberapa orang mungkin mengalami gejala perlawanan kesehatan ringan, orang lain mungkin mengalami gejala perlawanan kesehatan yang parah yang memerlukan perhatian medis, seperti halusinasi dan kejang-kejang."
        }
      ],
      "synonymMeanings": [
        "gejala perlawanan",
        "reaksi perlawanan",
        "gejala kesehatan negatif",
        "gejala kecanduan"
      ]
    },
    {
      "id": "e210c373-1058-43d2-a798-3a0f53f82eb9",
      "word": "Genetic disorder",
      "synonyms": [
        "Inherited disease",
        "congenital disorder"
      ],
      "definition": "A condition caused by a fault in an individual's DNA that can lead to a range of physical or mental health problems.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kondisi yang disebabkan oleh kerusakan genetik dalam DNA individu yang dapat menyebabkan berbagai gangguan kesehatan fisik atau mental.",
      "phonetics": {
        "us": "/dʒɛnɛtɪk dɪsˈɔːrdər/",
        "uk": "/dʒɛnˈɛtɪk dɪsˈɔːrdər/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Genetic disorders can have a significant impact on a person's quality of life.",
          "translation": "Kondisi genetik dapat memiliki dampak yang signifikan terhadap kualitas hidup seseorang."
        },
        {
          "type": "Complex",
          "text": "Researchers have been working tirelessly to develop new treatments for genetic disorders, which can be challenging to diagnose and manage.",
          "translation": "Para peneliti telah bekerja keras untuk mengembangkan perawatan baru untuk kondisi genetik yang dapat sulit untuk didiagnosis dan diatasi."
        },
        {
          "type": "Compound",
          "text": "Genetic disorders and environmental factors can interact to cause a range of health problems, including cancer and neurological disorders.",
          "translation": "Kondisi genetik dan faktor lingkungan dapat berinteraksi untuk menyebabkan berbagai gangguan kesehatan, termasuk kanker dan penyakit sistem saraf."
        },
        {
          "type": "Compound-Complex",
          "text": "Furthermore, genetic disorders can be caused by a combination of genetic and environmental factors, making them even more difficult to diagnose and treat.",
          "translation": "Selain itu, kondisi genetik dapat disebabkan oleh kombinasi faktor genetik dan lingkungan, sehingga membuatnya lebih sulit untuk didiagnosis dan diatasi."
        }
      ],
      "synonymMeanings": [
        "Kondisi genetik",
        "Penyakit genetik",
        "Kerusakan genetik",
        "Kondisi lahir"
      ]
    },
    {
      "id": "89f9d11e-4157-49f9-ab7d-c42deab76cec",
      "word": "Immune system",
      "synonyms": [
        "Immunity",
        "defense system"
      ],
      "definition": "The system and processes by which the body defends itself against disease-causing microorganisms and other foreign substances.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Sistem kekebalan tubuh",
      "phonetics": {
        "us": "/ɪˈmjuːn sɪsˈteɪm/",
        "uk": "/ɪˈmjuːn sɪsˈteɪm/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The immune system plays a crucial role in protecting us against diseases.",
          "translation": "Sistem kekebalan tubuh memiliki peran penting dalam melindungi kita dari penyakit."
        },
        {
          "type": "Complex",
          "text": "If we do not take care of our immune system, we will be more susceptible to illnesses.",
          "translation": "Jika kita tidak menjaga sistem kekebalan tubuh kita, kita akan lebih rentan terhadap penyakit."
        },
        {
          "type": "Compound",
          "text": "The immune system is comprised of various cells and organs that work together to fight off infections, but it can be weakened by stress and poor diet.",
          "translation": "Sistem kekebalan tubuh terdiri dari berbagai sel dan organ yang bekerja sama untuk melawan infeksi, tetapi dapat melemah karena stres dan diet buruk."
        },
        {
          "type": "Compound-Complex",
          "text": "However, the effectiveness of the immune system can be compromised by factors such as genetics, lifestyle, and environmental factors, which can lead to a weakened immune response.",
          "translation": "Namun, efektivitas sistem kekebalan tubuh dapat terganggu oleh faktor-faktor seperti genetik, gaya hidup, dan faktor lingkungan, yang dapat menyebabkan respon kekebalan melemah."
        }
      ],
      "synonymMeanings": [
        "Sistem pertahanan tubuh",
        "Sistem perlindungan tubuh",
        "Sistem perlawanan tubuh"
      ]
    },
    {
      "id": "c8bba173-3473-447a-b878-aecbe0eea2e6",
      "word": "Respiratory illness",
      "synonyms": [
        "Lung disease",
        "breathing disorder"
      ],
      "definition": "a disease or condition that affects the lungs or airways, such as pneumonia or asthma",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "penyakit pernapasan",
      "phonetics": {
        "us": "/rɪˈspɪrətɔri/",
        "uk": "/rɪˈspɪrətri/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has a respiratory illness.",
          "translation": "Dia menderita penyakit pernapasan."
        },
        {
          "type": "Complex",
          "text": "Because she has a respiratory illness, she needs to use an inhaler.",
          "translation": "Karena dia menderita penyakit pernapasan, dia perlu menggunakan inhaler."
        },
        {
          "type": "Compound",
          "text": "She has a respiratory illness, and she also has a skin condition.",
          "translation": "Dia menderita penyakit pernapasan, dan dia juga memiliki kondisi kulit."
        },
        {
          "type": "Compound-Complex",
          "text": "Although she has a respiratory illness, she still goes to work, but she needs to take regular breaks to use her inhaler.",
          "translation": "Meskipun dia menderita penyakit pernapasan, dia masih pergi bekerja, tetapi dia perlu mengambil istirahat teratur untuk menggunakan inhalernya."
        }
      ],
      "synonymMeanings": [
        "penyakit paru-paru",
        "penyakit pernafasan",
        "gangguan pernapasan"
      ]
    },
    {
      "id": "80e27dcb-8975-4276-bc14-aa20fb6c8fa1",
      "word": "Chronic disease",
      "synonyms": [
        "Long-lasting illness",
        "persistent condition"
      ],
      "definition": "A long-term health condition that cannot be cured and may require ongoing treatment.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Penyakit kronis",
      "phonetics": {
        "us": "/krɑnɪk dɪˈziːz/",
        "uk": "/krɒnɪk daɪˈziːz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The prevalence of chronic diseases has increased significantly over the past decade.",
          "translation": "Kemunculan penyakit kronis telah meningkat secara signifikan dalam dekade terakhir."
        },
        {
          "type": "Complex",
          "text": "While the causes of chronic diseases are multifaceted, lifestyle plays a significant role in their development.",
          "translation": "Meskipun penyebab penyakit kronis sangat kompleks, gaya hidup berperan besar dalam perkembangannya."
        },
        {
          "type": "Compound",
          "text": "Chronic diseases and mental health disorders are often linked, making diagnosis challenging.",
          "translation": "Penyakit kronis dan gangguan jiwa sering terkait, sehingga diagnosis menjadi sulit."
        },
        {
          "type": "Compound-Complex",
          "text": "As a result, the healthcare system struggles to provide adequate care for individuals with chronic diseases, particularly those from low-income backgrounds.",
          "translation": "Dengan demikian, sistem kesehatan mengalami kesulitan memberikan perawatan yang memadai bagi individu dengan penyakit kronis, terutama bagi mereka dari latar belakang ekonomi rendah."
        }
      ],
      "synonymMeanings": [
        "Penyakit jangka panjang",
        "Penyakit kronik",
        "Penyakit berkepanjangan"
      ]
    },
    {
      "id": "fb262cd7-4530-4bcc-a1e0-44c912b392bf",
      "word": "Acute illness",
      "synonyms": [
        "Short-term disease",
        "rapid-onset illness"
      ],
      "definition": "A sudden and severe illness that requires immediate medical attention.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Penyakit akut",
      "phonetics": {
        "us": "/əˈkjuːt ɪlˈnɛs/.",
        "uk": "/əˈkjuːt ɪlˈnɛs/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The hospital has a special ward for patients suffering from acute illnesses.",
          "translation": "Rumah sakit tersebut memiliki ruang khusus untuk pasien yang menderita penyakit akut."
        },
        {
          "type": "Complex",
          "text": "Due to the high mortality rate of acute illnesses, the government has implemented strict health protocols.",
          "translation": "Karena tingginya tingkat kematian akibat penyakit akut, pemerintah telah menerapkan protokol kesehatan yang ketat."
        },
        {
          "type": "Compound",
          "text": "Acute illnesses can be caused by various factors, including poor diet and lack of exercise.",
          "translation": "Penyakit akut dapat disebabkan oleh berbagai faktor, termasuk pola makan yang tidak seimbang dan kurangnya olahraga."
        },
        {
          "type": "Compound-Complex",
          "text": "In addition to the physical consequences of acute illnesses, patients often experience emotional trauma, which can have long-lasting effects on their mental health.",
          "translation": "Selain konsekuensi fisik penyakit akut, pasien sering mengalami trauma emosional yang dapat memiliki efek jangka panjang pada kesehatan mental mereka."
        }
      ],
      "synonymMeanings": [
        "penyakit berat",
        "penyakit serius",
        "penyakit yang memerlukan perawatan segera"
      ]
    },
    {
      "id": "2b0df7df-a132-4d07-982a-f0512519295e",
      "word": "Occupational health",
      "synonyms": [
        "Workplace safety",
        "employee health"
      ],
      "definition": "The branch of medicine that deals with the maintenance and improvement of workers' health, especially in workplaces.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kesehatan dan keselamatan kerja",
      "phonetics": {
        "us": "/ɑbjʊˈpeɪʃənəl ˈhɛlθ/",
        "uk": "/ɒbjuːˈpeɪʃənəl ˈhɛlθ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The company has implemented various measures to improve occupational health and safety standards.",
          "translation": "Perusahaan telah melaksanakan berbagai langkah untuk meningkatkan standar kesehatan dan keselamatan kerja."
        },
        {
          "type": "Complex",
          "text": "While the government has established regulations to protect workers' health, many factories still fail to provide a safe working environment.",
          "translation": "Meskipun pemerintah telah menetapkan regulasi untuk melindungi kesehatan pekerja, banyak pabrik masih gagal memberikan lingkungan kerja yang aman."
        },
        {
          "type": "Compound",
          "text": "The hospital has a special department for occupational health, which provides various services to workers with work-related injuries or illnesses.",
          "translation": "Rumah sakit memiliki departemen khusus untuk kesehatan dan keselamatan kerja, yang menyediakan berbagai layanan bagi pekerja dengan cedera atau penyakit akibat pekerjaan."
        },
        {
          "type": "Compound-Complex",
          "text": "However, despite the increasing awareness of the importance of occupational health, many workers continue to suffer from work-related health problems due to inadequate working conditions and lack of proper training.",
          "translation": "Namun, meskipun kesadaran akan pentingnya kesehatan dan keselamatan kerja semakin meningkat, banyak pekerja masih menderita masalah kesehatan akibat pekerjaan karena lingkungan kerja yang tidak memadai dan kurangnya pelatihan yang tepat."
        }
      ],
      "synonymMeanings": [
        "keselamatan kerja",
        "kesehatan pekerja",
        "kesehatan dan keselamatan kerja"
      ]
    },
    {
      "id": "ba3065f2-826b-4303-905f-64374b863e36",
      "word": "Hygiene",
      "synonyms": [
        "Sanitation",
        "cleanliness"
      ],
      "definition": "The practice of keeping oneself and one's environment clean and free from disease-causing agents.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kesederhanaan hidup dan lingkungan",
      "phonetics": {
        "us": "/haɪˈdʒiːn/",
        "uk": "/haɪˈdʒiːn/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Maintaining good hygiene is essential in preventing the spread of diseases.",
          "translation": "Merawat kebersihan yang baik sangat penting untuk mencegah penyebaran penyakit."
        },
        {
          "type": "Complex",
          "text": "The lack of hygiene in public places can lead to the outbreak of waterborne diseases, which is a major concern for public health.",
          "translation": "Kurangnya kesederhanaan hidup di tempat umum dapat menyebabkan kemunculan penyakit akibat air, yang merupakan masalah besar bagi kesehatan masyarakat."
        },
        {
          "type": "Compound",
          "text": "Good hygiene practices include washing hands regularly and using clean water, while poor hygiene can lead to the spread of diseases.",
          "translation": "Praktek kebersihan yang baik meliputi mencuci tangan secara teratur dan menggunakan air bersih, sedangkan kebersihan yang buruk dapat menyebabkan penyebaran penyakit."
        },
        {
          "type": "Compound-Complex",
          "text": "The importance of hygiene in schools cannot be overstated, as it can prevent the spread of diseases among students, and this is particularly crucial in areas with limited access to clean water and sanitation facilities.",
          "translation": "Pentingnya kesederhanaan hidup di sekolah tidak bisa digambarkan dengan jelas, karena dapat mencegah penyebaran penyakit di kalangan siswa, dan hal ini sangat penting di daerah yang memiliki akses terhadap air bersih dan fasilitas sanitasi terbatas."
        }
      ],
      "synonymMeanings": [
        "Kesederhanaan hidup",
        "Kebersihan",
        "Kemurnian",
        "Kesucian"
      ]
    },
    {
      "id": "d8481229-b468-4195-85b4-885f21fa5532",
      "word": "Adolescence",
      "synonyms": [
        "Teenage years",
        "youth"
      ],
      "definition": "The period of life when a person is developing from a child to an adult, typically between the ages of 13 and 19.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Periode pembentukan remaja",
      "phonetics": {
        "us": "/ədˈɒlsəns",
        "uk": "/ædˈɒlsəns/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The challenges of adolescence can be difficult for many young people to overcome.",
          "translation": "Periode pembentukan remaja sering kali menjadi kesulitan bagi banyak remaja."
        },
        {
          "type": "Complex",
          "text": "As a result of peer pressure, many teenagers during adolescence engage in risk-taking behaviors.",
          "translation": "Karena tekanan dari teman-teman, banyak remaja selama periode pembentukan remaja melakukan perilaku berisiko."
        },
        {
          "type": "Compound",
          "text": "Adolescence is a period of significant physical, emotional, and social change for young people, but it is also a time of great opportunity.",
          "translation": "Periode pembentukan remaja adalah masa perubahan signifikan secara fisik, emosi, dan sosial bagi remaja, tetapi juga merupakan masa kesempatan yang besar."
        },
        {
          "type": "Compound-Complex",
          "text": "While some teenagers struggle to cope with the emotional demands of adolescence, others find the experience to be a transformative and empowering one.",
          "translation": "Meskipun beberapa remaja mengalami kesulitan dalam menghadapi tuntutan emosi selama periode pembentukan remaja, lainnya menemukan pengalaman tersebut sebagai pengalaman transformatif dan memotivasi."
        }
      ],
      "synonymMeanings": [
        "perempuan remaja",
        "remaja",
        "masa remaja"
      ]
    },
    {
      "id": "e44b3973-a444-4dda-be2b-7b13fc53f605",
      "word": "Puberty",
      "synonyms": [
        "Maturation",
        "biological development"
      ],
      "definition": "The stage of physical and emotional development during which a person becomes sexually mature.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Periode perkembangan fisik dan emosi ketika seseorang mencapai kematangan seksual.",
      "phonetics": {
        "us": "/ˈpʌbərti/",
        "uk": "/ˈpʌbərti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The onset of puberty can be a challenging time for many adolescents.",
          "translation": "Awal perkembangan remaja seringkali menimbulkan kesulitan bagi banyak remaja."
        },
        {
          "type": "Complex",
          "text": "Because of the physical changes that occur during puberty, many young people experience anxiety about their appearance.",
          "translation": "Karena perubahan fisik yang terjadi selama masa remaja, banyak remaja merasa khawatir tentang penampilan mereka."
        },
        {
          "type": "Compound",
          "text": "The physical and emotional changes that occur during puberty affect not only the individual but also their family.",
          "translation": "Perubahan fisik dan emosi yang terjadi selama masa remaja tidak hanya mempengaruhi individu itu sendiri, tetapi juga keluarganya."
        },
        {
          "type": "Compound-Complex",
          "text": "The onset of puberty can lead to emotional changes, which in turn can affect the individual's relationships with their family and friends.",
          "translation": "Awal perkembangan remaja dapat menyebabkan perubahan emosi, yang kemudian dapat mempengaruhi hubungan individu dengan keluarga dan teman-temannya."
        }
      ],
      "synonymMeanings": [
        "Masa remaja",
        "Kematangan seksual",
        "Periode perkembangan"
      ]
    },
    {
      "id": "60ac6d9c-d324-44bd-b5da-314312d85541",
      "word": "Cognitive development",
      "synonyms": [
        "Intellectual growth",
        "mental development"
      ],
      "definition": "The process by which the brain matures and becomes able to process and understand information.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Pengembangan kognitif",
      "phonetics": {
        "us": "/kɒɡ.ni.tɪv dɪ.vələp.mənt/",
        "uk": "/kɒɡ.nɪ.tɪv dɪˈvɛləpmənt/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Cognitive development in children is a crucial aspect of their overall growth and learning experience.",
          "translation": "Pengembangan kognitif anak-anak merupakan aspek penting dalam pertumbuhan dan pengalaman belajar mereka."
        },
        {
          "type": "Complex",
          "text": "While cognitive development in early childhood is rapid, it can be hindered by a lack of access to quality education and healthcare.",
          "translation": "Meskipun pengembangan kognitif pada masa kanak-kanak awal terjadi sangat cepat, namun dapat terhambat oleh kurangnya akses ke pendidikan dan kesehatan berkualitas."
        },
        {
          "type": "Compound",
          "text": "Cognitive development is influenced by various factors, including genetics, environment, and socio-economic status.",
          "translation": "Pengembangan kognitif dipengaruhi oleh berbagai faktor, di antaranya genetik, lingkungan, dan status sosio-ekonomi."
        },
        {
          "type": "Compound-Complex",
          "text": "However, despite the importance of cognitive development, many children around the world are still denied access to quality education and healthcare, which can have long-term consequences on their cognitive abilities and overall well-being.",
          "translation": "Namun, meskipun pentingnya pengembangan kognitif, masih banyak anak-anak di seluruh dunia yang tidak dapat memiliki akses ke pendidikan dan kesehatan berkualitas, yang dapat berdampak pada kemampuan kognitif dan kesejahteraan mereka dalam jangka panjang."
        }
      ],
      "synonymMeanings": [
        "Pengembangan otak",
        "Perkembangan kemampuan berpikir",
        "Pengembangan kemampuan intelektual"
      ]
    },
    {
      "id": "541eae5b-3b97-4774-a69b-a2d526cd7232",
      "word": "Emotional maturity",
      "synonyms": [
        "Psychological growth",
        "emotional"
      ],
      "definition": "The ability to control and understand one's own emotions, and to behave in a mature and responsible way, especially in difficult or challenging situations.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kematangan emosional",
      "phonetics": {
        "us": "/ɛm.ʊˈʃən.əl maˈtɜːrɪti/",
        "uk": "/ɛm.əʊ.ˈʃən.əl məˈtʊərɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Developing emotional maturity is essential for achieving success in life.",
          "translation": "Kematangan emosional yang berkembang sangat penting dalam mencapai kesuksesan dalam hidup."
        },
        {
          "type": "Complex",
          "text": "While many people struggle with emotional maturity, it is possible to develop this skill with practice and patience.",
          "translation": "Banyak orang yang mengalami kesulitan dalam mengembangkan kematangan emosional, namun hal ini dapat dikembangkan dengan latihan dan kesabaran."
        },
        {
          "type": "Compound",
          "text": "Emotional maturity is characterized by a range of skills, including self-awareness, effective communication, and conflict resolution.",
          "translation": "Kematangan emosional dapat ditunjukkan dengan berbagai kemampuan, seperti kesadaran diri, komunikasi efektif, dan penyelesaian konflik."
        },
        {
          "type": "Compound-Complex",
          "text": "For instance, people with emotional maturity can handle stressful situations with ease, whereas those who lack this trait often become anxious or depressed.",
          "translation": "Misalnya, orang dengan kematangan emosional dapat menangani situasi stres dengan mudah, sedangkan orang yang tidak memiliki sifat ini sering menjadi cemas atau depresi."
        }
      ],
      "synonymMeanings": [
        "Kematangan jiwa",
        "Kesiapsiagaan emosional",
        "Kemampuan emosional"
      ]
    },
    {
      "id": "de883684-6095-4ea1-883e-b3742882b07b",
      "word": "Social skills",
      "synonyms": [
        "Communication skills",
        "interpersonal"
      ],
      "definition": "The ability to communicate and interact with others effectively in a social setting.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Keterampilan sosial",
      "phonetics": {
        "us": "/səʊʃəl skɪlz/",
        "uk": "/soʊʃəl skɪlz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Developing social skills is crucial for success in the workplace.",
          "translation": "Membangun keterampilan sosial sangat penting untuk mencapai kesuksesan di tempat kerja."
        },
        {
          "type": "Complex",
          "text": "While good communication skills are vital for building strong relationships, social skills also play a significant role in conflict resolution.",
          "translation": "Meskipun kemampuan berkomunikasi yang baik sangat penting untuk membangun hubungan yang kuat, keterampilan sosial juga berperan penting dalam menyelesaikan konflik."
        },
        {
          "type": "Compound",
          "text": "Developing social skills is crucial for success in the workplace, and it can be achieved through practice and experience.",
          "translation": "Membangun keterampilan sosial sangat penting untuk mencapai kesuksesan di tempat kerja, dan dapat dicapai melalui latihan dan pengalaman."
        },
        {
          "type": "Compound-Complex",
          "text": "While good communication skills are vital for building strong relationships, social skills also play a significant role in conflict resolution, and it is essential to develop both skills to achieve success in the workplace.",
          "translation": "Meskipun kemampuan berkomunikasi yang baik sangat penting untuk membangun hubungan yang kuat, keterampilan sosial juga berperan penting dalam menyelesaikan konflik, dan sangat penting untuk mengembangkan kedua keterampilan tersebut untuk mencapai kesuksesan di tempat kerja."
        }
      ],
      "synonymMeanings": [
        "keterampilan interaksi",
        "kemampuan berinteraksi",
        "kemampuan sosial",
        "keterampilan komunikasi sosial"
      ]
    },
    {
      "id": "fd3fd0c2-8837-4bb8-893a-d6ab1e6129a4",
      "word": "Peer pressure",
      "synonyms": [
        "Social influence",
        "group pressure"
      ],
      "definition": "The influence or coercion exerted by a person's peer group to conform to their attitudes or behaviors.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Dorongan dari teman-teman untuk meniru sikap atau perilaku mereka.",
      "phonetics": {
        "us": "/pɪərˈprɛʃər/",
        "uk": "/pɪərˈprɛʃər/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Many young people struggle with peer pressure to engage in substance abuse.",
          "translation": "Banyak remaja menghadapi tekanan dari teman-teman untuk mencoba zat-zat terlarang."
        },
        {
          "type": "Complex",
          "text": "While some argue that peer pressure can be a force for good, others believe it often leads to negative outcomes.",
          "translation": "Meskipun ada yang berpendapat bahwa tekanan dari teman-teman dapat menjadi kekuatan yang baik, orang lain percaya bahwa sering kali mengarah pada hasil yang buruk."
        },
        {
          "type": "Compound",
          "text": "Peer pressure can lead to low self-esteem, and it can also encourage risk-taking behaviors.",
          "translation": "Tekanan dari teman-teman dapat menyebabkan rendahnya harga diri, serta mendorong perilaku yang berisiko."
        },
        {
          "type": "Compound-Complex",
          "text": "As a result of peer pressure, some individuals may feel compelled to participate in activities they would normally avoid, and this can lead to a range of negative consequences.",
          "translation": "Karena dorongan dari teman-teman, beberapa individu mungkin merasa terpaksa untuk terlibat dalam aktivitas yang biasanya mereka hindari, dan hal ini dapat mengarah pada berbagai konsekuensi negatif."
        }
      ],
      "synonymMeanings": [
        "tekanan sosial",
        "pengaruh dari teman-teman",
        "dorongan dari kelompok",
        "tekanan dari lingkungan"
      ]
    },
    {
      "id": "cde67b5f-a86b-4b7a-8391-354d061673bd",
      "word": "Independence",
      "synonyms": [
        "Self-sufficiency",
        "autonomy"
      ],
      "definition": "the state of being free from the control or influence of others",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Meaning not found.",
      "phonetics": {
        "us": "/.../",
        "uk": "/.../"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Usage of Independence is important."
        },
        {
          "type": "Complex",
          "text": "Because Independence matters, we should study it."
        },
        {
          "type": "Compound",
          "text": "The word is Independence, and it is useful."
        },
        {
          "type": "Compound-Complex",
          "text": "If we use Independence correctly, we succeed, so let's try."
        }
      ]
    },
    {
      "id": "14822fbe-1cf5-407b-9bc5-c622dc7fa8a3",
      "word": "Discipline",
      "synonyms": [
        "Self-discipline",
        "regulation"
      ],
      "definition": "A branch of knowledge, especially one that is studied in a university or college.",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Bidang ilmu",
      "phonetics": {
        "us": "/ˈdɪsɪplɪn/",
        "uk": "/ˈdɪsɪplɪn/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The new course is part of the department of discipline.",
          "translation": "Kursus baru itu merupakan bagian dari departemen ilmu."
        },
        {
          "type": "Complex",
          "text": "Students must study a range of disciplines to gain a broad understanding of the subject",
          "translation": "Mahasiswa harus mempelajari berbagai bidang ilmu untuk memperoleh pemahaman yang luas tentang subjek."
        },
        {
          "type": "Compound",
          "text": "Business studies and law are related disciplines, and both are taught at university.",
          "translation": "Ilmu bisnis dan hukum merupakan bidang-bidang ilmu yang berhubungan, dan keduanya diajarkan di universitas."
        },
        {
          "type": "Compound-Complex",
          "text": "By studying different disciplines, students can develop their critical thinking skills and learn how to apply theoretical knowledge to real-world problems.",
          "translation": "Dengan mempelajari berbagai bidang ilmu, mahasiswa dapat mengembangkan kemampuan berpikir kritis dan mengetahui cara mengaplikasikan pengetahuan teori pada masalah-masalah nyata."
        }
      ],
      "synonymMeanings": [
        "Bidang ilmu",
        "Disiplin ilmu",
        "Lingkungan ilmu",
        "Kawasan ilmu"
      ]
    },
    {
      "id": "968262c7-8408-4edc-9808-5fae5e45946c",
      "word": "Responsibility",
      "synonyms": [
        "Obligation",
        "accountability"
      ],
      "definition": "The state or fact of being accountable for something.",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Tanggung jawab",
      "phonetics": {
        "us": "/ˌrɛspəˈnæbɪlɪti/",
        "uk": "/ˌrɛspəˈnæbɪlɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Many students feel overwhelmed by the responsibility of balancing schoolwork and part-time jobs.",
          "translation": "Banyak siswa merasa terlalu berat oleh tanggung jawab untuk memadupadankan pekerjaan sekolah dan pekerjaan paruh waktu."
        },
        {
          "type": "Complex",
          "text": "The government has a responsibility to ensure the safety of its citizens, especially those living in areas prone to natural disasters.",
          "translation": "Pemerintah memiliki tanggung jawab untuk menjamin keselamatan warganya, terutama mereka yang tinggal di daerah yang rentan terhadap bencana alam."
        },
        {
          "type": "Compound",
          "text": "While it is the responsibility of parents to provide for their children, it is also the responsibility of the community to support them.",
          "translation": "Meskipun tanggung jawab orang tua untuk menyediakan kebutuhan anak-anak mereka, namun tanggung jawab komunitas juga untuk mendukung mereka."
        },
        {
          "type": "Compound-Complex",
          "text": "The company has a responsibility to its employees, not only to provide them with a safe working environment but also to offer them opportunities for professional growth and development.",
          "translation": "Perusahaan memiliki tanggung jawab kepada karyawannya, bukan hanya untuk menyediakan lingkungan kerja yang aman, tetapi juga untuk menawarkan mereka kesempatan untuk berkembang dan berkembang profesional."
        }
      ],
      "synonymMeanings": [
        " Kewajiban",
        "Keterlibatan",
        "Kewenangan",
        "Kemampuan"
      ]
    },
    {
      "id": "6fd095ab-0ffd-4a1e-b886-acae13df2570",
      "word": "Self-esteem",
      "synonyms": [
        "Self-respect",
        "self-worth"
      ],
      "definition": "The feeling of being proud of oneself and having confidence in one's abilities and worth.",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Kepustakan diri sendiri",
      "phonetics": {
        "us": "/sɛlfˈiːstəm/",
        "uk": "/sɛlfˈiːstəm/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Low self-esteem can lead to mental health problems.",
          "translation": "Kepustakan diri sendiri yang rendah dapat menyebabkan masalah kesehatan mental."
        },
        {
          "type": "Complex",
          "text": "If we foster a supportive environment, individuals will develop high self-esteem and achieve their goals.",
          "translation": "Jika kami menciptakan lingkungan yang mendukung, individu akan mengembangkan kepuasan diri sendiri yang tinggi dan mencapai tujuan mereka."
        },
        {
          "type": "Compound",
          "text": "Self-esteem is closely linked to happiness and success, and individuals with high self-esteem tend to be more confident and motivated.",
          "translation": "Kepustakan diri sendiri erat kaitannya dengan kebahagiaan dan kesuksesan, dan individu dengan kepuasan diri sendiri yang tinggi cenderung lebih percaya diri dan termotivasi."
        },
        {
          "type": "Compound-Complex",
          "text": "While self-esteem is an important aspect of personal development, it is also affected by external factors such as social media and peer pressure, which can negatively impact an individual's self-esteem.",
          "translation": "Meskipun kepuasan diri sendiri adalah aspek penting dalam pengembangan diri, namun juga dipengaruhi oleh faktor-faktor eksternal seperti media sosial dan tekanan teman, yang dapat mengganggu kepuasan diri sendiri seseorang dengan cara negatif."
        }
      ],
      "synonymMeanings": [
        "Kepada diri sendiri",
        "Percaya diri",
        "Kepuasan dalam diri"
      ]
    },
    {
      "id": "a12ca53a-5d6b-40ff-a82d-fca9a59004ee",
      "word": "Aerobic exercise",
      "synonyms": [
        "Cardio",
        "endurance training"
      ],
      "definition": "Exercise that requires oxygen to generate energy, typically involving movement of the body or limbs.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Latihan olahraga yang memerlukan oksigen untuk menghasilkan energi, biasanya melibatkan gerakan tubuh atau anggota badan.",
      "phonetics": {
        "us": "/ˌɛərəbɪk ˈɛksɝːsɪz/",
        "uk": "/ˌɛərəbɪk ˈɛksɜːsɪs/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Regular aerobic exercise can help to maintain a healthy weight.",
          "translation": "Latihan olahraga aerobik secara teratur dapat membantu menjaga berat badan sehat."
        },
        {
          "type": "Complex",
          "text": "While jogging is an excellent form of aerobic exercise, it may not be suitable for everyone, especially those with joint problems.",
          "translation": "Meskipun berlari merupakan bentuk olahraga aerobik yang sangat baik, namun mungkin tidak sesuai bagi semua orang, terutama mereka yang memiliki masalah sendi."
        },
        {
          "type": "Compound",
          "text": "Aerobic exercise, such as cycling and swimming, can be done at home or in a gym, and is an excellent way to improve cardiovascular health.",
          "translation": "Latihan olahraga aerobik, seperti bersepeda dan berenang, dapat dilakukan di rumah atau di gym, dan merupakan cara yang sangat baik untuk meningkatkan kesehatan jantung."
        },
        {
          "type": "Compound-Complex",
          "text": "In addition to improving cardiovascular health, aerobic exercise has also been shown to reduce stress levels and improve overall well-being, which is why it is often recommended by doctors and health professionals.",
          "translation": "Selain meningkatkan kesehatan jantung, latihan olahraga aerobik juga telah menunjukkan kemampuan untuk mengurangi tingkat stres dan meningkatkan kesejahteraan secara keseluruhan, sehingga sering direkomendasikan oleh dokter dan profesional kesehatan."
        }
      ],
      "synonymMeanings": [
        "olahraga kebugaran",
        "olahraga cardio",
        "olahraga kardiovaskular"
      ]
    },
    {
      "id": "a09463ae-720c-424a-ba69-841ab647e5d7",
      "word": "Anaerobic exercise",
      "synonyms": [
        "Strength training",
        "resistance exercise"
      ],
      "definition": "Physical exercise that does not require oxygen, such as weightlifting, sprinting, or high-intensity interval training.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Latihan fisik tanpa menggunakan oksigen, seperti angkat besi, lari sprint, atau latihan interval intensitas tinggi.",
      "phonetics": {
        "us": "/ˌænəˈrɒbɪk ɛksəˈraɪs/.",
        "uk": "/ˌænəˈrɒbɪk ɛksəˈraɪs/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Anaerobic exercise helps to improve muscle strength and endurance.",
          "translation": "Latihan fisik anaerobik membantu meningkatkan kekuatan dan kekuatan otot."
        },
        {
          "type": "Complex",
          "text": "While aerobic exercise is essential for cardiovascular health, anaerobic exercise is crucial for building muscle mass.",
          "translation": "Meskipun latihan fisik aerobik sangat penting untuk kesehatan jantung, latihan fisik anaerobik sangat penting untuk membangun massa otot."
        },
        {
          "type": "Compound",
          "text": "Anaerobic exercise such as weightlifting and sprinting can be very effective in improving muscle strength and endurance, but it requires proper training and technique.",
          "translation": "Latihan fisik anaerobik seperti angkat besi dan lari sprint dapat sangat efektif dalam meningkatkan kekuatan dan kekuatan otot, tetapi memerlukan pelatihan yang tepat dan teknik."
        },
        {
          "type": "Compound-Complex",
          "text": "Anaerobic exercise has several benefits, including improved muscle strength and endurance, increased metabolism, and enhanced athletic performance, but it also requires careful planning and execution to avoid injuries and overtraining.",
          "translation": "Latihan fisik anaerobik memiliki beberapa manfaat, termasuk kekuatan dan kekuatan otot yang ditingkatkan, metabolisme yang ditingkatkan, dan performa olahraga yang ditingkatkan, tetapi juga memerlukan perencanaan yang teliti dan pelaksanaan yang tepat untuk menghindari cedera dan pelatihan yang berlebihan."
        }
      ],
      "synonymMeanings": [
        "Intensitas tinggi",
        "Latihan interval",
        "Tanpa oksigen"
      ]
    },
    {
      "id": "7cf0309c-9994-42c2-81f9-70253ba00a64",
      "word": "Endurance",
      "synonyms": [
        "Stamina",
        "resilience"
      ],
      "definition": "The ability to withstand or continue for a long time, especially in difficult or unpleasant conditions.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kemampuan untuk bertahan atau terus berlangsung dalam waktu lama, terutama dalam kondisi sulit atau tidak menyenangkan.",
      "phonetics": {
        "us": "/ɛndərˈæns/",
        "uk": "/ɛndəˈræns/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The athlete's endurance was impressive as he completed the marathon in under four hours.",
          "translation": "Kemampuan atlet untuk bertahan menempuh maraton dalam waktu kurang dari empat jam memang sangat impresif."
        },
        {
          "type": "Complex",
          "text": "The company's ability to adapt to changing market conditions was a key factor in their success, which required a great deal of endurance over several years.",
          "translation": "Kemampuan perusahaan untuk beradaptasi dengan perubahan kondisi pasar merupakan faktor utama kesuksesan mereka, yang memerlukan kemampuan bertahan dalam waktu yang lama."
        },
        {
          "type": "Compound",
          "text": "The long journey was tiring, but the tourist's endurance was tested even further by the scorching heat and dusty roads.",
          "translation": "Perjalanan yang panjang itu sangat melelahkan, namun kemampuan bertahan wisatawan diuji bahkan lebih lama lagi oleh panas yang terik dan jalan berdebu."
        },
        {
          "type": "Compound-Complex",
          "text": "While the hikers' endurance was impressive, their decision to continue the climb despite the stormy weather was not the wisest choice.",
          "translation": "Meskipun kemampuan bertahan pendaki sangat menonjol, keputusan mereka untuk terus mendaki meskipun cuaca buruk bukanlah pilihan yang paling bijak."
        }
      ],
      "synonymMeanings": [
        "Kerja keras",
        "Kemampuan bertahan lama",
        "Kekuatan mental",
        "Kemampuan beradaptasi"
      ]
    },
    {
      "id": "2dde3bc4-70c7-43fe-b49a-fab25c8ac905",
      "word": "Flexibility",
      "synonyms": [
        "Suppleness",
        "mobility"
      ],
      "definition": "The ability to bend or adapt easily.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kemampuan menyesuaikan diri dengan mudah.",
      "phonetics": {
        "us": "/ˈflɛksɪbɪlɪti/",
        "uk": "/ˈflɛksɪbɪlɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Many companies value flexibility in their employees.",
          "translation": "Banyak perusahaan menghargai kemampuan menyesuaikan diri di kalangan karyawannya."
        },
        {
          "type": "Complex",
          "text": "The flexibility of the new employee allowed the team to adapt quickly to her work style.",
          "translation": "Kemampuan menyesuaikan diri dari karyawan baru memungkinkan tim untuk menyesuaikan diri dengan cepat gaya kerjanya."
        },
        {
          "type": "Compound",
          "text": "The company's flexibility and willingness to learn from its mistakes helped it to grow rapidly.",
          "translation": "Kemampuan menyesuaikan diri dan kesiapan perusahaan untuk belajar dari kesalahan-kesalahannya membantu perusahaan itu tumbuh dengan cepat."
        },
        {
          "type": "Compound-Complex",
          "text": "The flexibility of the new policy allowed the company to respond quickly to changes in the market, and it also enabled employees to work from home more often.",
          "translation": "Kemampuan menyesuaikan diri dari kebijakan baru memungkinkan perusahaan untuk bereaksi dengan cepat terhadap perubahan di pasar, dan juga memungkinkan karyawan untuk bekerja dari rumah lebih sering."
        }
      ],
      "synonymMeanings": [
        "Kemampuan menyesuaikan diri",
        "Kemampuan fleksibel",
        "Kemampuan adaptif"
      ]
    },
    {
      "id": "1382edb7-6773-4017-a5b5-fd670f93fb64",
      "word": "Strength training",
      "synonyms": [
        "Resistance training",
        "weightlifting"
      ],
      "definition": "The practice of exercising to improve muscular power, endurance, and strength.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Latihan kekuatan",
      "phonetics": {
        "us": "/strentʃtˈreɪnɪŋ/",
        "uk": "/strenθtˈreɪnɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Regular strength training is essential for maintaining good physical health.",
          "translation": "Latihan kekuatan secara teratur sangat penting untuk menjaga kesehatan fisik yang baik."
        },
        {
          "type": "Complex",
          "text": "The benefits of strength training, such as increased muscle mass and improved bone density, have been widely documented in medical research.",
          "translation": "Manfaat latihan kekuatan, seperti peningkatan massa otot dan kepadatan tulang yang lebih baik, telah dokumentasikan secara luas dalam penelitian medis."
        },
        {
          "type": "Compound",
          "text": "While running and swimming are excellent forms of cardiovascular exercise, strength training should not be neglected as it also plays a crucial role in overall fitness.",
          "translation": "Meskipun berlari dan berenang adalah bentuk latihan kardiovaskular yang sangat baik, latihan kekuatan tidak boleh diabaikan karena juga berperan penting dalam keseluruhan kebugaran."
        },
        {
          "type": "Compound-Complex",
          "text": "However, it's worth noting that overdoing it with strength training can lead to muscle fatigue and decreased performance, so it's essential to strike a balance between exercise and rest.",
          "translation": "Namun, perlu diingat bahwa melakukan latihan kekuatan secara berlebihan dapat menyebabkan kelelahan otot dan penurunan kinerja, sehingga sangat penting untuk mencapai keseimbangan antara olahraga dan istirahat."
        }
      ],
      "synonymMeanings": [
        "latihan otot",
        "program kekuatan",
        "aktivitas kekuatan",
        "latihan fisik"
      ]
    },
    {
      "id": "076d46b2-1b53-48ac-baf4-87cb51749c51",
      "word": "Cardiovascular fitness",
      "synonyms": [
        "Heart health",
        "stamina"
      ],
      "definition": "The state of being physically fit through regular exercise, especially aerobic exercise, to improve the functioning of the heart, lungs, and blood vessels.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kesehatan jantung dan pembuluh darah",
      "phonetics": {
        "us": "/ˌkɑrdiəˈvæskjʊlər fɪtnəs/",
        "uk": "/ˌkɑːrdiəˈvæskjʊlər fɪtˌnɛs/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Regular exercise is essential for maintaining cardiovascular fitness.",
          "translation": "Latihan teratur sangat penting untuk menjaga kesehatan jantung dan pembuluh darah."
        },
        {
          "type": "Complex",
          "text": "While many people believe that cardiovascular fitness can be improved through diet alone, research suggests that regular exercise is also crucial.",
          "translation": "Meskipun banyak orang percaya bahwa kesehatan jantung dan pembuluh darah dapat ditingkatkan melalui pola makan saja, penelitian menunjukkan bahwa latihan teratur juga sangat penting."
        },
        {
          "type": "Compound",
          "text": "Exercise and a balanced diet can both improve cardiovascular fitness, but they have different effects on the body.",
          "translation": "Latihan dan pola makan seimbang dapat berdua meningkatkan kesehatan jantung dan pembuluh darah, tetapi keduanya memiliki efek yang berbeda pada tubuh."
        },
        {
          "type": "Compound-Complex",
          "text": "While regular exercise can improve cardiovascular fitness in the short term, it is the long-term consistency of exercise that really matters for maintaining good health.",
          "translation": "Meskipun latihan teratur dapat meningkatkan kesehatan jantung dan pembuluh darah dalam jangka pendek, faktor yang paling penting untuk menjaga kesehatan yang baik adalah konsistensi latihan jangka panjang."
        }
      ],
      "synonymMeanings": [
        "kesehatan cardio",
        "kesehatan pernapasan",
        "keseimbangan jantung dan pembuluh darah"
      ]
    },
    {
      "id": "5e51646d-b8a5-4dce-9823-9c9077552f71",
      "word": "Muscle hypertrophy",
      "synonyms": [
        "Muscle growth",
        "bodybuilding"
      ],
      "definition": "The increase in size of muscle fibres, often resulting from resistance training.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Pengembangan otot",
      "phonetics": {
        "us": "/ˈmʌsəl ˌhɪpərˈtrɒfi/",
        "uk": "/ˈmʌsəl ˌhɪpərˈtrɒfɪ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Regular exercise can lead to muscle hypertrophy.",
          "translation": "Latihan teratur dapat menyebabkan pengembangan otot."
        },
        {
          "type": "Complex",
          "text": "Muscle hypertrophy is a common consequence of adopting a strict workout routine.",
          "translation": "Pengembangan otot adalah konsekuensi umum dari mengadopsi rutinitas kebugaran ketat."
        },
        {
          "type": "Compound",
          "text": "Resistance training and a balanced diet are essential for achieving muscle hypertrophy, as well as maintaining overall health.",
          "translation": "Latihan tahanan dan diet seimbang sangat penting untuk mencapai pengembangan otot, serta menjaga kesehatan secara keseluruhan."
        },
        {
          "type": "Compound-Complex",
          "text": "While some individuals may experience muscle hypertrophy without changing their lifestyle, regular exercise and a healthy diet can significantly improve muscle growth and overall fitness, which can lead to a range of physical and mental health benefits.",
          "translation": "Meskipun beberapa individu mungkin mengalami pengembangan otot tanpa mengubah gaya hidup mereka, latihan teratur dan diet sehat dapat secara signifikan meningkatkan pertumbuhan otot dan kondisi fisik secara keseluruhan, yang dapat menyebabkan berbagai manfaat kesehatan fisik dan mental."
        }
      ],
      "synonymMeanings": [
        "Pengembangan jaringan otot",
        "Pengembangan massa otot",
        "Pertumbuhan otot"
      ]
    },
    {
      "id": "1703a718-3efd-46f2-b04d-0d626d4d713f",
      "word": "Metabolism",
      "synonyms": [
        "Caloric burn",
        "energy expenditure"
      ],
      "definition": "The process by which the body converts food into energy.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Proses konversi makanan menjadi energi tubuh.",
      "phonetics": {
        "us": "/mɪtəˈbɑːlɪzəm/",
        "uk": "/mɛtəˈbɒlɪzəm/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Exercise can boost metabolism, leading to weight loss.",
          "translation": "Olahraga dapat meningkatkan metabolisme, sehingga mengakibatkan penurunan berat badan."
        },
        {
          "type": "Complex",
          "text": "While a balanced diet is essential for maintaining a healthy metabolism, some people may need to adopt a more rigorous exercise routine.",
          "translation": "Meskipun diet seimbang sangat penting untuk menjaga metabolisme sehat, beberapa orang mungkin perlu mengadopsi rutinitas olahraga lebih keras."
        },
        {
          "type": "Compound",
          "text": "Eating too much sugar can slow down metabolism, while a lack of sleep can further exacerbate the problem.",
          "translation": "Mengonsumsi terlalu banyak gula dapat memperlambat metabolisme, sementara kekurangan tidur dapat memperburuk masalah itu lebih lanjut."
        },
        {
          "type": "Compound-Complex",
          "text": "However, some research suggests that certain nutrients, such as vitamin D and omega-3 fatty acids, can actually help to increase metabolism and improve overall health, which may be beneficial for people with certain health conditions.",
          "translation": "Namun, beberapa penelitian menunjukkan bahwa beberapa nutrisi, seperti vitamin D dan asam lemak omega-3, dapat sebenarnya membantu meningkatkan metabolisme dan meningkatkan kesehatan secara keseluruhan, yang mungkin bermanfaat bagi orang-orang dengan beberapa kondisi kesehatan tertentu."
        }
      ],
      "synonymMeanings": [
        "pembakaran energi",
        "proses energi",
        "pengubahan makanan",
        "konversi energi"
      ]
    },
    {
      "id": "fdf06bdb-e5a0-4745-9dec-b28318ced7bd",
      "word": "High-Intensity Interval Training",
      "synonyms": [
        "Intense cardio",
        "interval training"
      ],
      "definition": "A type of exercise where short periods of high-intensity activity are followed by periods of rest or low-intensity activity.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Latihan Interval Kecepatan Tinggi",
      "phonetics": {
        "us": "/haɪ ˌɪntɪnsɪti 'ntɝ vl ˈintɝvəl trɛnɪŋ/",
        "uk": "/haɪ ˌɪntɪnsɪti 'ntɝ vl ˈɪntɛrvəl trɛnɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Regularly engaging in High-Intensity Interval Training can improve cardiovascular health.",
          "translation": "Melakukan Latihan Interval Kecepatan Tinggi secara teratur dapat meningkatkan kesehatan jantung."
        },
        {
          "type": "Complex",
          "text": "While High-Intensity Interval Training is effective for weight loss, it may not be suitable for everyone.",
          "translation": "Meskipun Latihan Interval Kecepatan Tinggi efektif untuk menurunkan berat badan, namun mungkin tidak cocok untuk semua orang."
        },
        {
          "type": "Compound",
          "text": "High-Intensity Interval Training and proper nutrition are both essential for achieving a healthy lifestyle.",
          "translation": "Latihan Interval Kecepatan Tinggi dan gizi yang tepat sama-sama penting untuk mencapai gaya hidup sehat."
        },
        {
          "type": "Compound-Complex",
          "text": "Individuals with certain medical conditions should consult their doctor before engaging in High-Intensity Interval Training, as it may exacerbate their condition.",
          "translation": "Orang-orang dengan kondisi medis tertentu sebaiknya berkonsultasi dengan dokter sebelum melakukan Latihan Interval Kecepatan Tinggi, karena hal ini mungkin memperburuk kondisinya."
        }
      ],
      "synonymMeanings": [
        "Latihan Kecepatan Tinggi",
        "Latihan Interval",
        "Peregangan Intensitas Tinggi"
      ]
    },
    {
      "id": "2dd7d8a0-e694-40b8-9d2f-922aec3bddc9",
      "word": "Body composition",
      "synonyms": [
        "Physical makeup",
        "body structure"
      ],
      "definition": "The proportion of different components in the body, such as fat, muscle, and water.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Komposisi tubuh, yaitu rasio komponen-komponen dalam tubuh, seperti lemak, otot, dan air.",
      "phonetics": {
        "us": "/ˌboʊdi ˈkɒmpəzɪʃən/",
        "uk": "/ˌboʊdi ˈkɒmpəʊzɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The doctor analyzed the body composition of the patient to determine the cause of their illness.",
          "translation": "Dokter menganalisis komposisi tubuh pasien untuk menentukan penyebab penyakit mereka."
        },
        {
          "type": "Complex",
          "text": "Researchers have found that regular exercise can significantly improve body composition, especially in terms of reducing body fat, by increasing muscle mass.",
          "translation": "Peneliti telah menemukan bahwa olahraga teratur dapat signifikan meningkatkan komposisi tubuh, terutama dalam hal mengurangi lemak tubuh dengan meningkatkan massa otot."
        },
        {
          "type": "Compound",
          "text": "Maintaining a healthy body composition is crucial for overall well-being, and regular physical activity is essential for achieving this goal.",
          "translation": "Mengembangkan komposisi tubuh sehat sangat penting untuk kesehatan secara keseluruhan, dan aktivitas fisik teratur merupakan hal yang penting untuk mencapai tujuan tersebut."
        },
        {
          "type": "Compound-Complex",
          "text": "The increasing prevalence of obesity worldwide is a major concern, as it is often associated with poor body composition, which can lead to various health problems, including diabetes and cardiovascular disease.",
          "translation": "Penyebaran obesitas yang semakin meningkat di seluruh dunia merupakan kekhawatiran besar, karena sering dikaitkan dengan komposisi tubuh yang buruk, yang dapat menyebabkan berbagai masalah kesehatan, termasuk diabetes dan penyakit jantung."
        }
      ],
      "synonymMeanings": [
        "Komposisi tubuh",
        "Proporsi tubuh",
        "Kandungan tubuh",
        "Komposisi tubuh manusia"
      ]
    },
    {
      "id": "5dd0f2c0-04ea-4691-854b-8cc2142fd1dc",
      "word": "Resistance bands",
      "synonyms": [
        "Elastic training tools",
        "tension bands"
      ],
      "definition": "A long, thin, flexible strip made of rubber or plastic that is used for exercising, especially for strengthening muscles.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Bingkisan tali elastis",
      "phonetics": {
        "us": "/rɪsɪstənsˈbændz/",
        "uk": "/rɪˈsɪstənsbændz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Resistance bands are a popular choice for home workouts.",
          "translation": "Bingkisan tali elastis adalah pilihan yang populer untuk latihan di rumah."
        },
        {
          "type": "Complex",
          "text": "The researcher argued that resistance bands were a more effective way to improve muscle strength compared to traditional weights.",
          "translation": "Peneliti tersebut berpendapat bahwa bingkisan tali elastis adalah cara yang lebih efektif untuk meningkatkan kekuatan otot dibandingkan dengan beban tradisional."
        },
        {
          "type": "Compound",
          "text": "Resistance bands and dumbbells are both used for strengthening muscles, but in different ways.",
          "translation": "Bingkisan tali elastis dan dumbbell sama-sama digunakan untuk menguatkan otot, tetapi dengan cara yang berbeda."
        },
        {
          "type": "Compound-Complex",
          "text": "Although resistance bands are a convenient option for exercising, they can also be used as a substitute for traditional weights when space is limited, but not as a replacement for a good diet.",
          "translation": "Meskipun bingkisan tali elastis adalah pilihan yang nyaman untuk berlatih, mereka juga dapat digunakan sebagai pengganti beban tradisional jika ruang terbatas, tetapi bukan sebagai pengganti pola makan yang seimbang."
        }
      ],
      "synonymMeanings": [
        "Bingkisan tali latihan",
        "Tali elastis kekuatan"
      ]
    },
    {
      "id": "6aa16ec2-e52b-448a-84e5-72b1510dc29a",
      "word": "Repetition",
      "synonyms": [
        "Exercise cycle",
        "movement count"
      ],
      "definition": "The act of doing or saying the same thing again and again, often as a way of emphasizing a point or to make something more memorable.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Ulangan atau pengulangan",
      "phonetics": {
        "us": "/riːpɪtɪʃən/",
        "uk": "/riːpɪtɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The teacher repeated the instructions several times to ensure the students understood.",
          "translation": "Guru mengulangi instruksi beberapa kali untuk memastikan siswa memahami."
        },
        {
          "type": "Complex",
          "text": "The researcher's findings were based on several studies that had all concluded the same thing, but she still felt the need to repeat the results to emphasize the significance.",
          "translation": "Temuan peneliti ini berdasarkan beberapa penelitian yang telah memutuskan hal yang sama, namun dia masih merasa perlu mengulangi hasilnya untuk menekankan pentingnya."
        },
        {
          "type": "Compound",
          "text": "The teacher repeated the question, and the student repeated the answer, but they both forgot to turn in their work on time.",
          "translation": "Guru mengulangi pertanyaan, dan siswa mengulangi jawabannya, namun mereka sama-sama lupa menyerahkan pekerjaan tepat waktu."
        },
        {
          "type": "Compound-Complex",
          "text": "Although the students had studied the material for several months, the teacher still felt the need to repeat certain key concepts to ensure they were understood, and she also encouraged them to ask questions if they were unsure.",
          "translation": "Meskipun siswa telah belajar materi selama beberapa bulan, guru masih merasa perlu mengulangi beberapa konsep kunci untuk memastikan mereka dipahami, dan dia juga mendorong mereka untuk bertanya jika mereka tidak yakin."
        }
      ],
      "synonymMeanings": [
        "Ulangan",
        "Pengulangan",
        "Ulang",
        "Rekaman"
      ]
    },
    {
      "id": "1916a63c-6dea-4080-9c8c-e349e5948baf",
      "word": "Set",
      "synonyms": [
        "Exercise round",
        "sequence"
      ],
      "definition": "A set of things that belong together or are related in some way.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Suatu pengumpulan hal yang terkait atau berhubungan.",
      "phonetics": {
        "us": "/sɛt/",
        "uk": "/sɛt/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The new employee was given a set of tools to complete the task.",
          "translation": "Direktur memberikan sekelompok alat kepada pekerja baru untuk menyelesaikan tugas."
        },
        {
          "type": "Complex",
          "text": "Although the company had set clear goals, the team struggled to meet them.",
          "translation": "Meskipun perusahaan telah menetapkan tujuan yang jelas, tim masih kesulitan mencapai mereka."
        },
        {
          "type": "Compound",
          "text": "The set of rules had been established years ago, but the company still struggled to comply with them.",
          "translation": "Pengaturan aturan telah ditetapkan beberapa tahun yang lalu, tetapi perusahaan masih kesulitan mematuhi mereka."
        },
        {
          "type": "Compound-Complex",
          "text": "The team had set a high standard for themselves, but due to the lack of resources, they struggled to maintain it, which had a negative impact on the company's overall performance.",
          "translation": "Tim telah menetapkan standar tinggi bagi diri mereka sendiri, tetapi karena kekurangan sumber daya, mereka kesulitan mempertahankannya, yang memiliki dampak negatif pada kinerja perusahaan secara keseluruhan."
        }
      ],
      "synonymMeanings": [
        "kelompok",
        "pengumpulan",
        "seri",
        "rangkaian"
      ]
    },
    {
      "id": "a22fe229-03e2-446a-9fa6-1c1539e0579f",
      "word": "Warm-up",
      "synonyms": [
        "Pre-workout routine",
        "stretching"
      ],
      "definition": "An activity that helps you prepare for a physical or mental challenge by gradually increasing your level of activity or difficulty.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Peregangan",
      "phonetics": {
        "us": "/wɔrm ʌp/",
        "uk": "/wɔːm ʌp/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The warm-up exercises before a marathon are essential to prevent injuries.",
          "translation": "Latihan peregangan sebelum lari marathon sangatlah penting untuk mencegah cedera."
        },
        {
          "type": "Complex",
          "text": "The researchers emphasized the importance of a proper warm-up before participating in any strenuous physical activity.",
          "translation": "Para peneliti menekankan pentingnya melakukan peregangan yang tepat sebelum berpartisipasi dalam aktivitas fisik yang berat."
        },
        {
          "type": "Compound",
          "text": "The coach advised his team to do a combination of stretching and cardio exercises as a warm-up before the game.",
          "translation": "Pelatih memberi saran kepada timnya untuk melakukan kombinasi latihan stretching dan kardiovaskular sebagai peregangan sebelum pertandingan."
        },
        {
          "type": "Compound-Complex",
          "text": "If you're not familiar with the sport, it's crucial to do a proper warm-up to avoid strains and injuries, which can be caused by a sudden increase in physical activity.",
          "translation": "Jika Anda tidak familiar dengan olahraga tersebut, sangatlah penting untuk melakukan peregangan yang tepat untuk menghindari serangan dan cedera, yang dapat disebabkan oleh peningkatan fisik yang tiba-tiba."
        }
      ],
      "synonymMeanings": [
        "Latihan peregangan",
        "Pengaktifan",
        "Peregangan fisik"
      ]
    },
    {
      "id": "45022215-6b6c-47e2-8d92-c306fc5e5491",
      "word": "Cool-down",
      "synonyms": [
        "Post-workout routine",
        "relaxation"
      ],
      "definition": "To gradually reduce or stop an activity, especially after doing something physically demanding, in order to prevent overheating or injury.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Melancong secara bertahap",
      "phonetics": {
        "us": "/kuːldaʊn/",
        "uk": "/ˈkuːldaʊn/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "After finishing my strenuous workout, I decided to cool down with some light stretching.",
          "translation": "Setelah menyelesaikan latihan fisik yang berat, aku memutuskan untuk melakukan peregangan ringan."
        },
        {
          "type": "Complex",
          "text": "While I was running, I tried to cool down by walking slowly, but I still felt exhausted.",
          "translation": "Saat aku berlari, aku mencoba untuk melancong dengan berjalan perlahan-lahan, tetapi aku masih merasa lelah."
        },
        {
          "type": "Compound",
          "text": "To cool down, I went for a swim and then took a warm bath, which helped me relax.",
          "translation": "Untuk melancong, aku pergi berenang dan kemudian mandi dengan air hangat, yang membantu aku merasa lebih santai."
        },
        {
          "type": "Compound-Complex",
          "text": "Although I had been feeling tired, I managed to cool down by taking regular breaks and staying hydrated throughout the hike.",
          "translation": "Meskipun aku merasa lelah, aku berhasil melancong dengan mengambil istirahat reguler dan tetap hidrasi selama berjalan hiking."
        }
      ],
      "synonymMeanings": [
        "beristirahatlah",
        "melanjutkan dengan santai",
        "mengecilkan intensitas"
      ]
    },
    {
      "id": "018045e9-fa8c-49a3-9693-343f117c685c",
      "word": "Plyometrics",
      "synonyms": [
        "Jump training",
        "explosive workouts"
      ],
      "definition": "A type of exercise that involves jumping and changing direction quickly, often used to improve explosive power and speed.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Latihan melibatkan melompat dan mengubah arah dengan cepat, biasanya digunakan untuk meningkatkan kekuatan impulsif dan kecepatan.",
      "phonetics": {
        "us": "/plaɪ.əˈmɛtrɪks/",
        "uk": "/plaɪ.əˈmɛtrɪks/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Plyometrics is an effective way to improve athletic performance.",
          "translation": "Plyometrics adalah cara efektif untuk meningkatkan prestasi olahraga."
        },
        {
          "type": "Complex",
          "text": "While plyometrics can be beneficial for athletes, it also requires proper training and supervision to avoid injuries.",
          "translation": "Meskipun plyometrics dapat bermanfaat bagi atlet, namun juga memerlukan pelatihan dan pengawasan yang tepat untuk menghindari cedera."
        },
        {
          "type": "Compound",
          "text": "Plyometrics and strength training are often combined to improve overall fitness and athleticism.",
          "translation": "Plyometrics dan pelatihan kekuatan sering digabungkan untuk meningkatkan keseluruhan kondisi fisik dan kemampuan atletis."
        },
        {
          "type": "Compound-Complex",
          "text": "In order to see significant improvements in athletic performance, an individual must consistently incorporate plyometrics into their training routine, while also engaging in regular strength training and proper nutrition.",
          "translation": "Untuk melihat peningkatan yang signifikan dalam prestasi olahraga, individu harus konsisten mengintegrasikan plyometrics ke dalam rutinitas pelatihan mereka, sambil juga berpartisipasi dalam pelatihan kekuatan secara teratur dan nutrisi yang tepat."
        }
      ],
      "synonymMeanings": [
        "latihan melompat",
        "latihan kekuatan impulsif",
        "latihan kelincahan",
        "latihan kecepatan"
      ]
    },
    {
      "id": "91695d61-0e71-46f8-ba03-2c3831092d2a",
      "word": "Agility",
      "synonyms": [
        "Quickness",
        "nimbleness"
      ],
      "definition": "The ability to move quickly and easily with a smooth, fluid motion.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kemampuan bergerak dengan cepat dan lincah",
      "phonetics": {
        "us": "/əˈdʒɪlti/",
        "uk": "/əˈdʒɪlti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The athlete's agility allowed her to dodge her opponent's attack.",
          "translation": "Kemampuan kecepatan dan kelincahan atlet memungkinkannya menghindari serangan lawan."
        },
        {
          "type": "Complex",
          "text": "The company's agility in responding to market changes has been crucial to its survival.",
          "translation": "Kemampuan perusahaan untuk beradaptasi dengan perubahan pasar sangat penting bagi kelangsungan hidupnya."
        },
        {
          "type": "Compound",
          "text": "The company's agility and creativity led to the development of innovative products.",
          "translation": "Kemampuan kecepatan dan kreativitas perusahaan menghasilkan produk inovatif."
        },
        {
          "type": "Compound-Complex",
          "text": "The company's agility in responding to market changes has led to increased customer satisfaction, which in turn has resulted in higher sales figures.",
          "translation": "Kemampuan perusahaan untuk beradaptasi dengan perubahan pasar telah meningkatkan kepuasan pelanggan, sehingga akhirnya meningkatkan nilai penjualan."
        }
      ],
      "synonymMeanings": [
        "Cepat bergerak",
        "Lincah",
        "Beradaptasi",
        "Kreatif"
      ]
    },
    {
      "id": "2d54b6a7-a37b-42b6-9612-81d802d956a3",
      "word": "Core strength",
      "synonyms": [
        "Midsection stability",
        "core fitness"
      ],
      "definition": "The central or most important part of something, especially its most powerful or essential element.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Inti kekuatan",
      "phonetics": {
        "us": "/kɔr ˈstrɛŋθ/",
        "uk": "/kɔr ˈstrɛŋθ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "A strong core is essential for good posture and overall health.",
          "translation": "Inti kekuatan yang kuat sangat penting bagi postur tubuh dan kesehatan secara keseluruhan."
        },
        {
          "type": "Complex",
          "text": "While some people may have naturally strong core muscles, regular exercise can also help improve core strength.",
          "translation": "Meskipun beberapa orang mungkin memiliki otot inti kekuatan alami yang kuat, latihan fisik rutin juga dapat membantu meningkatkan kekuatan inti."
        },
        {
          "type": "Compound",
          "text": "In addition to its physical benefits, core strength is also important for mental focus and concentration.",
          "translation": "Selain manfaat fisiknya, kekuatan inti juga penting untuk konsentrasi mental dan fokus."
        },
        {
          "type": "Compound-Complex",
          "text": "If you want to improve your core strength, you should start with simple exercises like planks and crunches, and then gradually move on to more challenging ones.",
          "translation": "Jika Anda ingin meningkatkan kekuatan inti, Anda harus memulai dengan latihan sederhana seperti plank dan crunch, dan kemudian secara bertahap beralih ke latihan yang lebih menantang."
        }
      ],
      "synonymMeanings": [
        "Inti kekuatan",
        "Kekuatan otot",
        "Kekuatan tubuh",
        "Kekuatan fisik"
      ]
    },
    {
      "id": "6c54ae3c-7c49-478a-91b3-86efb287f22a",
      "word": "Posture",
      "synonyms": [
        "Alignment",
        "stance"
      ],
      "definition": "The position and angle in which someone or something is standing or sitting.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kepala atau cara berdiri seseorang atau sesuatu.",
      "phonetics": {
        "us": "/ˈpɒstrʊər/",
        "uk": "/ˈpɒstrə/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Maintaining good posture is essential for our overall health.",
          "translation": "Menggunakan postur baik sangat penting untuk kesehatan kita secara keseluruhan."
        },
        {
          "type": "Complex",
          "text": "While exercising, it's crucial to maintain a good posture to avoid any injuries.",
          "translation": "Saat berolahraga, sangat penting untuk menjaga postur yang baik untuk menghindari cedera."
        },
        {
          "type": "Compound",
          "text": "We should all strive to maintain a healthy posture, whether we're sitting or standing.",
          "translation": "Kita semua harus berusaha menjaga postur yang sehat, baik duduk atau berdiri."
        },
        {
          "type": "Compound-Complex",
          "text": "In order to improve our physical fitness, we need to adopt a good posture and exercise regularly, which can be achieved by incorporating activities into our daily routine.",
          "translation": "Untuk meningkatkan kebugaran fisik kita, kita perlu menggunakan postur yang baik dan berolahraga secara teratur, yang dapat dicapai dengan mengintegrasikan aktivitas ke dalam rutinitas harian kita."
        }
      ],
      "synonymMeanings": [
        "sikap tubuh",
        "kepala",
        "tubuh",
        "posisi"
      ]
    },
    {
      "id": "db7c52a4-11ae-4bfd-a394-24da70516248",
      "word": "Recovery time",
      "synonyms": [
        "Rest period",
        "healing phase"
      ],
      "definition": "The time needed for something or someone to recover from an injury, illness, or other adverse situation.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Waktu pemulihan",
      "phonetics": {
        "us": "/riːkəvəriː taɪm/",
        "uk": "/riːkjʊvəriː taɪm/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The recovery time for severe burns can take several months.",
          "translation": "Waktu pemulihan untuk luka bakar parah membutuhkan beberapa bulan."
        },
        {
          "type": "Complex",
          "text": "If a patient has a history of heart problems, the recovery time after surgery may be longer.",
          "translation": "Jika pasien memiliki riwayat masalah jantung, waktu pemulihan setelah operasi mungkin lebih lama."
        },
        {
          "type": "Compound",
          "text": "The recovery time and the cost of treatment are two of the most important factors to consider when choosing a hospital.",
          "translation": "Waktu pemulihan dan biaya perawatan adalah dua hal yang paling penting untuk diperhatikan ketika memilih rumah sakit."
        },
        {
          "type": "Compound-Complex",
          "text": "The recovery time for athletes who suffer from concussions can be lengthy due to the complexity of the injury, but the right treatment can significantly reduce the recovery time.",
          "translation": "Waktu pemulihan bagi atlet yang mengalami cedera kepala dapat lama karena kompleksitas cedera, namun perawatan yang tepat dapat mengurangi waktu pemulihan secara signifikan."
        }
      ],
      "synonymMeanings": [
        "Pemulihan",
        "Peremajaan",
        "Pengobatan",
        "Pulihannya"
      ]
    },
    {
      "id": "ff064543-c1dd-4d9d-a3e1-520a5dd33e0a",
      "word": "Lactic acid",
      "synonyms": [
        "Metabolic byproduct",
        "fatigue cause"
      ],
      "definition": "A sour-tasting, milky liquid produced when muscle tissue breaks down, found in yogurt, milk, and other dairy products.",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Asam laktat",
      "phonetics": {
        "us": "/ˈlæktɪk ˈæsɪd/",
        "uk": "/ˈlæktɪk ˈæsɪd/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The lactic acid in yogurt helps maintain a healthy digestive system.",
          "translation": "Asam laktat dalam yoghurt membantu menjaga keseimbangan pencernaan yang sehat."
        },
        {
          "type": "Complex",
          "text": "Because lactic acid is produced during intense physical activity, athletes often consume dairy products to replenish their muscle stores.",
          "translation": "Karena asam laktat diproduksi selama aktivitas fisik yang intens, atlet sering mengonsumsi produk susu untuk mengganti cadangan otot mereka."
        },
        {
          "type": "Compound",
          "text": "The lactic acid in milk is responsible for its sour taste, while also providing essential nutrients.",
          "translation": "Asam laktat dalam susu bertanggung jawab atas rasanya yang asam, sementara juga menyediakan nutrisi esensial."
        },
        {
          "type": "Compound-Complex",
          "text": "However, some people may experience stomach discomfort after consuming lactic acid-rich foods, which can be attributed to individual differences in digestive enzymes and gut bacteria.",
          "translation": "Namun, beberapa orang mungkin mengalami ketidaknyamanan perut setelah mengonsumsi makanan yang kaya akan asam laktat, yang dapat disebabkan oleh perbedaan individu dalam enzim pencernaan dan bakteri usus."
        }
      ],
      "synonymMeanings": [
        "Asam organik",
        "Asam hidroklorik",
        "Asam lemak"
      ]
    },
    {
      "id": "5d8f5610-712c-4162-96d6-730e3f3e3f6a",
      "word": "Hydration",
      "synonyms": [
        "Fluid intake",
        "water consumption"
      ],
      "definition": "The process of taking in water to keep the body or a liquid healthy and functioning properly.",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Penggunaan air yang cukup",
      "phonetics": {
        "us": "/hʌɪˈdreɪʃən/",
        "uk": "/haɪˈdreɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Proper hydration is essential for physical performance.",
          "translation": "Penggunaan air yang cukup sangat penting untuk prestasi fisik."
        },
        {
          "type": "Complex",
          "text": "While many people believe that sports drinks are necessary for hydration, research suggests otherwise.",
          "translation": "Meskipun banyak orang percaya bahwa minuman olahraga diperlukan untuk penggunaan air, penelitian lainnya menunjukkan sebaliknya."
        },
        {
          "type": "Compound",
          "text": "Regular hydration and a balanced diet are crucial for maintaining good health.",
          "translation": "Penggunaan air yang teratur dan pola makan yang seimbang sangat penting untuk menjaga kesehatan yang baik."
        },
        {
          "type": "Compound-Complex",
          "text": "While some athletes may require additional hydration during intense training sessions, others may not need as much water if they are well-hydrated beforehand.",
          "translation": "Meskipun beberapa atlet mungkin memerlukan penggunaan air tambahan selama sesi latihan intensitas tinggi, lainnya mungkin tidak perlu banyak air jika mereka telah mengonsumsi air yang cukup sebelumnya."
        }
      ],
      "synonymMeanings": [
        "pemupukan air",
        "penggunaan cairan",
        "penjagaan kelembapan"
      ]
    },
    {
      "id": "40e670bf-5192-4200-9799-84e6bcfa08bf",
      "word": "Overtraining",
      "synonyms": [
        "Burnout",
        "physical strain"
      ],
      "definition": "Excessive exercise or physical activity, especially without adequate rest, leading to physical or mental fatigue.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Peregangan otot atau kelelahan fisik akibat latihan yang berlebihan tanpa istirahat yang cukup.",
      "phonetics": {
        "us": "/ˌoʊvərˈtreɪnɪŋ/",
        "uk": "/ˌoʊvərˈtreɪnɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Overtraining can lead to serious health problems.",
          "translation": "Peregangan otot dapat menyebabkan masalah kesehatan serius."
        },
        {
          "type": "Complex",
          "text": "While many athletes train hard, they often ignore the risks of overtraining and its consequences on their health.",
          "translation": "Meskipun banyak atlet melakukan latihan keras, mereka sering mengabaikan risiko peregangan otot serta dampaknya pada kesehatan mereka."
        },
        {
          "type": "Compound",
          "text": "Regular exercise is essential for a healthy lifestyle, but overtraining can be detrimental to one's well-being.",
          "translation": "Latihan teratur sangat penting untuk gaya hidup sehat, tetapi peregangan otot dapat merugikan kesejahteraan seseorang."
        },
        {
          "type": "Compound-Complex",
          "text": "Overtraining can cause muscle fatigue, which may lead to decreased performance and increased risk of injury, especially for athletes who do not take adequate rest and nutrition.",
          "translation": "Peregangan otot dapat menyebabkan kelelahan otot, yang dapat mengarah pada penurunan kinerja dan peningkatan risiko cedera, terutama bagi atlet yang tidak mengambil istirahat dan nutrisi yang cukup."
        }
      ],
      "synonymMeanings": [
        "Penggunaan fisik yang berlebihan",
        "Kelelahan fisik akibat latihan",
        "Latihan yang tidak seimbang"
      ]
    },
    {
      "id": "628c9fde-187e-475f-b793-fae197ce5143",
      "word": "Interval training",
      "synonyms": [
        "Sprint training",
        "circuit training"
      ],
      "definition": "A training method in which periods of high-intensity exercise are alternated with periods of low-intensity exercise.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Latihan interval",
      "phonetics": {
        "us": "/ɪntərˈvæl.tʃən treɪnɪŋ/",
        "uk": "/ɪntərˈvæl.tʃən treɪnɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Interval training has been shown to be an effective way to improve cardiovascular fitness.",
          "translation": "Penggunaan latihan interval telah terbukti efektif untuk meningkatkan kebugaran kardiovaskular."
        },
        {
          "type": "Complex",
          "text": "While it may be challenging to incorporate interval training into a busy schedule, it is well worth the effort.",
          "translation": "Meskipun mungkin sulit untuk memasukkan latihan interval ke dalam jadwal yang sibuk, tetapi perluasan usaha ini sangat berharga."
        },
        {
          "type": "Compound",
          "text": "Interval training combines the benefits of high-intensity exercise with the convenience of low-intensity exercise.",
          "translation": "Latihan interval menggabungkan manfaat olahraga intensitas tinggi dengan kemudahan olahraga intensitas rendah."
        },
        {
          "type": "Compound-Complex",
          "text": "As a result of the changing fitness landscape, many gyms now offer interval training classes that cater to different fitness levels.",
          "translation": "Dengan perubahan lanskap kebugaran ini, banyak pusat kebugaran sekarang menawarkan kelas latihan interval yang dapat menyesuaikan diri dengan berbagai tingkat kebugaran."
        }
      ],
      "synonymMeanings": [
        "latihan interval",
        "latihan bergantian",
        "latihan intensitas tinggi"
      ]
    },
    {
      "id": "071d6339-c7d9-463f-88b6-6b11c3621d60",
      "word": "Mind-muscle connection",
      "synonyms": [
        "Neuromuscular control",
        "conscious movement"
      ],
      "definition": "A close connection between the mind and muscles that enables an individual to understand and control their physical movements.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Hubungan otak dan otot yang erat",
      "phonetics": {
        "us": "/maɪndˈmʌsəl kɒnˈɛkʃən/",
        "uk": "/maɪndˈmʌsəl kɒnˈɛkʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Developing a strong mind-muscle connection is crucial for physical therapy.",
          "translation": "Membangun hubungan otak dan otot yang kuat sangat penting dalam terapi fisik."
        },
        {
          "type": "Complex",
          "text": "Although it takes time and effort to establish a good mind-muscle connection, it is essential for achieving optimal physical performance.",
          "translation": "Meskipun membutuhkan waktu dan usaha untuk membangun hubungan otak dan otot yang baik, hal ini sangat penting untuk mencapai performa fisik yang optimal."
        },
        {
          "type": "Compound",
          "text": "Regular exercise and training can help develop a strong mind-muscle connection, whereas a sedentary lifestyle can hinder progress.",
          "translation": "Latihan reguler dan pelatihan dapat membantu membangun hubungan otak dan otot yang kuat, sedangkan gaya hidup tidak aktif dapat menghambat kemajuan."
        },
        {
          "type": "Compound-Complex",
          "text": "Furthermore, developing a strong mind-muscle connection requires a combination of mental discipline and physical exercise, whereas a lack of focus and motivation can hinder progress and lead to disappointment.",
          "translation": "Selain itu, membangun hubungan otak dan otot yang kuat memerlukan kombinasi disiplin mental dan latihan fisik, sedangkan kekurangan fokus dan motivasi dapat menghambat kemajuan dan menyebabkan kekecewaan."
        }
      ],
      "synonymMeanings": [
        "hubungan otak dan tubuh",
        "pengendalian otot",
        "keterampilan motorik"
      ]
    }
  ],
  "createdAt": 1769720179456
}