{
  "id": "5dc6ce02-4cf9-4f6c-a338-e37ab3450f5f",
  "name": "HEALTH",
  "items": [
    {
      "id": "1224371e-8c61-4b88-830d-c4c2b9a44195",
      "word": "Well-being",
      "synonyms": [
        "Wellness",
        "good health"
      ],
      "definition": "The state of being happy, healthy, and comfortable.",
      "userGuesses": [
        "wellness",
        "good health"
      ],
      "status": "mastered",
      "meaning": "Kesejahteraan",
      "phonetics": {
        "us": "/ˈwɛlˌbiɪŋ/",
        "uk": "/ˈwɛlˌbiːɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She prioritizes her well-being by exercising regularly.",
          "translation": "Dia memprioritaskan kesejahteraannya dengan berolahraga secara teratur."
        },
        {
          "type": "Complex",
          "text": "Because she eats a balanced diet, her well-being has improved significantly.",
          "translation": "Karena dia makan makanan seimbang, kesejahteraannya telah meningkat secara signifikan."
        },
        {
          "type": "Compound",
          "text": "She exercises regularly and eats a healthy diet to maintain her well-being.",
          "translation": "Dia berolahraga secara teratur dan makan makanan sehat untuk menjaga kesejahteraannya."
        },
        {
          "type": "Compound-Complex",
          "text": "While she was on vacation, she prioritized her well-being by exercising regularly, and as a result, she felt more energized because she had also been eating a balanced diet.",
          "translation": "Ketika dia sedang berlibur, dia memprioritaskan kesejahteraannya dengan berolahraga secara teratur, dan sebagai hasilnya, dia merasa lebih berenergi karena dia juga telah makan makanan seimbang."
        }
      ],
      "synonymMeanings": [
        "Kesehatan",
        "Kebahagiaan",
        "Kenyamanan",
        "Keberuntungan"
      ]
    },
    {
      "id": "0c40f089-70af-4aa8-bd66-fb2a9b30e554",
      "word": "Immunity",
      "synonyms": [
        "Resistance",
        "defense"
      ],
      "definition": "The state of being protected against a particular disease or infection, or the state of being safe from a particular harm or problem",
      "userGuesses": [
        "resistance",
        "defense"
      ],
      "status": "mastered",
      "meaning": "Kekebalan",
      "phonetics": {
        "us": "/ɪˈmjuːnɪti/",
        "uk": "/ɪˈmjuːnɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The vaccine provides immunity against the disease.",
          "translation": "Vaksin tersebut memberikan kekebalan terhadap penyakit."
        },
        {
          "type": "Complex",
          "text": "Because she had been vaccinated, she developed immunity to the disease that was going around.",
          "translation": "Karena telah divaksinasi, dia mengembangkan kekebalan terhadap penyakit yang sedang menyebar."
        },
        {
          "type": "Compound",
          "text": "The doctor checked her immunity, and she was healthy, but her brother was sick.",
          "translation": "Dokter memeriksa kekebalannya, dan dia sehat, tapi saudaranya sakit."
        },
        {
          "type": "Compound-Complex",
          "text": "While the vaccine provides immunity against the disease, it is not a guarantee that the person will not get infected, because other factors can also influence the outcome.",
          "translation": "Sementara vaksin memberikan kekebalan terhadap penyakit, itu tidak menjamin bahwa orang tersebut tidak akan terinfeksi, karena faktor lain juga dapat mempengaruhi hasilnya."
        }
      ],
      "synonymMeanings": [
        "perlindungan",
        "keamanan",
        "pencegahan",
        "perlindungan dari penyakit"
      ]
    },
    {
      "id": "5492f24a-fa37-460b-bf85-6c0f9f3f5a30",
      "word": "Nutrition",
      "synonyms": [
        "Diet",
        "nourishment"
      ],
      "definition": "the study of food and how it affects the body, or the food that a person, animal, or plant needs to stay healthy",
      "userGuesses": [
        "nourishment",
        "diet"
      ],
      "status": "mastered",
      "meaning": "gizi",
      "phonetics": {
        "us": "/nuˈtrɪʃən/",
        "uk": "/njuːˈtrɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Eating a balanced diet is essential for good nutrition.",
          "translation": "Mengonsumsi makanan seimbang sangat penting untuk gizi yang baik."
        },
        {
          "type": "Complex",
          "text": "Because she was concerned about her health, she started to learn about nutrition and how it affects the body.",
          "translation": "Karena dia khawatir tentang kesehatannya, dia mulai mempelajari tentang gizi dan bagaimana itu mempengaruhi tubuh."
        },
        {
          "type": "Compound",
          "text": "I love reading about nutrition and I also enjoy cooking healthy meals.",
          "translation": "Saya suka membaca tentang gizi dan saya juga menikmati memasak makanan sehat."
        },
        {
          "type": "Compound-Complex",
          "text": "While I was studying nutrition, I realized that eating a balanced diet is not only important for our physical health, but also for our mental well-being, and I also learned that regular exercise can help improve our overall health.",
          "translation": "Saat saya belajar tentang gizi, saya menyadari bahwa mengonsumsi makanan seimbang tidak hanya penting untuk kesehatan fisik kita, tetapi juga untuk kesejahteraan mental kita, dan saya juga belajar bahwa olahraga teratur dapat membantu meningkatkan kesehatan kita secara keseluruhan."
        }
      ],
      "synonymMeanings": [
        "pemeliharaan",
        "pemberian makan",
        "kesehatan"
      ]
    },
    {
      "id": "39dfa10f-e952-4fa5-8ffd-b18aa8eeecb9",
      "word": "Obesity",
      "synonyms": [
        "Overweight",
        "excessive fat"
      ],
      "definition": "a condition in which someone is very fat and has a lot of body fat, which can be bad for their health",
      "userGuesses": [
        "excessive fat",
        "overweight"
      ],
      "status": "mastered",
      "meaning": "obesitas",
      "phonetics": {
        "us": "/ˈoʊbəsiː/",
        "uk": "/ˈəʊbɪsɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Obesity is a major health problem.",
          "translation": "Obesitas adalah masalah kesehatan yang besar."
        },
        {
          "type": "Complex",
          "text": "Because obesity is a major health problem, people should eat healthy food.",
          "translation": "Karena obesitas adalah masalah kesehatan yang besar, orang harus makan makanan sehat."
        },
        {
          "type": "Compound",
          "text": "Obesity is a major health problem, and it can lead to diabetes.",
          "translation": "Obesitas adalah masalah kesehatan yang besar, dan dapat menyebabkan diabetes."
        },
        {
          "type": "Compound-Complex",
          "text": "Although obesity is a major health problem, people who are overweight can still be healthy, but they should exercise regularly and eat healthy food.",
          "translation": "Meskipun obesitas adalah masalah kesehatan yang besar, orang yang kelebihan berat badan masih dapat sehat, tetapi mereka harus berolahraga secara teratur dan makan makanan sehat."
        }
      ],
      "synonymMeanings": [
        "kegemukan",
        "kelebihan berat badan",
        "keberatbadanan berlebih"
      ]
    },
    {
      "id": "b9ac9776-0325-424d-ac5e-15ec03664d82",
      "word": "Sedentary lifestyle",
      "synonyms": [
        "Inactive lifestyle",
        "desk-bound routine"
      ],
      "definition": "a way of living in which people spend a lot of time sitting or not being physically active",
      "userGuesses": [
        "inactive lifestyle",
        "desk-bound routine"
      ],
      "status": "mastered",
      "meaning": "gaya hidup yang banyak menghabiskan waktu dengan duduk atau tidak banyak beraktivitas fisik",
      "phonetics": {
        "us": "/sɪˈdɛn.tə.ri/",
        "uk": "/sɪˈdɛn.tə.ri/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has a sedentary lifestyle and needs to exercise more.",
          "translation": "Dia memiliki gaya hidup sedentary dan perlu berolahraga lebih banyak."
        },
        {
          "type": "Complex",
          "text": "Because she works at a desk all day, she has developed a sedentary lifestyle.",
          "translation": "Karena dia bekerja di meja sepanjang hari, dia telah mengembangkan gaya hidup sedentary."
        },
        {
          "type": "Compound",
          "text": "She has a sedentary lifestyle, and she also eats a lot of junk food.",
          "translation": "Dia memiliki gaya hidup sedentary, dan dia juga banyak makan makanan junk food."
        },
        {
          "type": "Compound-Complex",
          "text": "While she knows that a sedentary lifestyle is bad for her health, she has a sedentary lifestyle and also eats a lot of junk food because she works at a desk all day.",
          "translation": "Sementara dia tahu bahwa gaya hidup sedentary buruk untuk kesehatannya, dia memiliki gaya hidup sedentary dan juga banyak makan makanan junk food karena dia bekerja di meja sepanjang hari."
        }
      ],
      "synonymMeanings": [
        "tidak aktif",
        "malas",
        "kurang gerak",
        "lebih banyak duduk"
      ]
    },
    {
      "id": "cfabfa98-154c-450f-a9e3-30803f2e806b",
      "word": "Cardiovascular disease",
      "synonyms": [
        "Heart disease",
        "circulatory disorder"
      ],
      "definition": "any disease of the heart or the blood vessels, such as heart disease or stroke",
      "userGuesses": [
        "circulatory disorder"
      ],
      "status": "discovered",
      "meaning": "penyakit kardiovaskular",
      "phonetics": {
        "us": "/ˌkɑːrdioʊˈvæskjʊlər/",
        "uk": "/ˌkɑːdiəʊˈvæskjʊlə/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Cardiovascular disease is a major cause of death worldwide.",
          "translation": "Penyakit kardiovaskular adalah penyebab utama kematian di seluruh dunia."
        },
        {
          "type": "Complex",
          "text": "Because cardiovascular disease can be caused by a variety of factors, it is essential to identify the root cause of the problem.",
          "translation": "Karena penyakit kardiovaskular dapat disebabkan oleh berbagai faktor, maka sangat penting untuk mengidentifikasi penyebab utama masalah tersebut."
        },
        {
          "type": "Compound",
          "text": "Cardiovascular disease is a serious health issue, and regular exercise can help prevent it, but a healthy diet is also necessary.",
          "translation": "Penyakit kardiovaskular adalah masalah kesehatan yang serius, dan olahraga teratur dapat membantu mencegahnya, tetapi pola makan sehat juga diperlukan."
        },
        {
          "type": "Compound-Complex",
          "text": "While cardiovascular disease is a major cause of death worldwide, it can be prevented by a combination of regular exercise, a healthy diet, and not smoking, because these factors can help reduce the risk of heart disease.",
          "translation": "Sementara penyakit kardiovaskular adalah penyebab utama kematian di seluruh dunia, namun dapat dicegah dengan kombinasi olahraga teratur, pola makan sehat, dan tidak merokok, karena faktor-faktor tersebut dapat membantu mengurangi risiko penyakit jantung."
        }
      ],
      "synonymMeanings": [
        "penyakit jantung",
        "penyakit pembuluh darah",
        "gangguan kardiovaskular",
        "penyakit sirkulasi darah"
      ]
    },
    {
      "id": "077d0ac6-1c9a-4e74-9163-3d017e598fc2",
      "word": "Diabetes",
      "synonyms": [
        "Blood sugar disorder",
        "hyperglycemia"
      ],
      "definition": "a medical condition in which the body does not produce enough insulin, leading to high blood sugar levels",
      "userGuesses": [
        "hyperglycemia",
        "blood sugar disorder"
      ],
      "status": "mastered",
      "meaning": "penyakit diabetes",
      "phonetics": {
        "us": "/daɪəˈbiːtiːz/",
        "uk": "/ˈdʌɪəbiːtiːz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She was diagnosed with diabetes.",
          "translation": "Dia didiagnosis menderita penyakit diabetes."
        },
        {
          "type": "Complex",
          "text": "Because she has diabetes, she needs to control her diet.",
          "translation": "Karena dia menderita penyakit diabetes, dia perlu mengontrol pola makannya."
        },
        {
          "type": "Compound",
          "text": "She has diabetes and her brother has high blood pressure.",
          "translation": "Dia menderita penyakit diabetes dan saudaranya memiliki tekanan darah tinggi."
        },
        {
          "type": "Compound-Complex",
          "text": "While she has diabetes, her brother has high blood pressure, and because of this, they both need to take care of their health.",
          "translation": "Sementara dia menderita penyakit diabetes, saudaranya memiliki tekanan darah tinggi, dan karena itu, mereka berdua perlu menjaga kesehatan mereka."
        }
      ],
      "synonymMeanings": [
        "penyakit gula",
        "penyakit kencing manis"
      ]
    },
    {
      "id": "979f0398-3997-4b54-9277-61abc214ce5a",
      "word": "Hypertension",
      "synonyms": [
        "High BP",
        "elevated pressure"
      ],
      "definition": "a medical condition in which the blood pressure is higher than normal",
      "userGuesses": [
        "high bp",
        "elevated pressure"
      ],
      "status": "mastered",
      "meaning": "hipertensi",
      "phonetics": {
        "us": "/ˌhaɪpərˈtɛnʃən/",
        "uk": "/ˌhʌɪpəˈtɛnʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The doctor warned me about hypertension.",
          "translation": "Dokter memperingatkan saya tentang hipertensi."
        },
        {
          "type": "Complex",
          "text": "Because I have a family history of hypertension, I need to be careful about my diet.",
          "translation": "Karena saya memiliki riwayat keluarga hipertensi, saya perlu berhati-hati tentang pola makan saya."
        },
        {
          "type": "Compound",
          "text": "I exercise regularly and I eat healthy food, but I still have hypertension.",
          "translation": "Saya berolahraga secara teratur dan saya makan makanan sehat, tetapi saya masih memiliki hipertensi."
        },
        {
          "type": "Compound-Complex",
          "text": "While I have been trying to control my hypertension through diet and exercise, my doctor has also prescribed medication, and I have been taking it regularly, but I still need to monitor my blood pressure closely.",
          "translation": "Sementara saya telah berusaha untuk mengontrol hipertensi saya melalui diet dan olahraga, dokter saya juga telah meresepkan obat, dan saya telah mengambilnya secara teratur, tetapi saya masih perlu memantau tekanan darah saya dengan hati-hati."
        }
      ],
      "synonymMeanings": [
        "tekanan darah tinggi",
        "penyakit jantung",
        "gangguan kardiovaskular"
      ]
    },
    {
      "id": "91a2dd83-ce50-4861-bc18-5196d8d4ce9a",
      "word": "Allergy",
      "synonyms": [
        "Hypersensitivity",
        "allergic reaction"
      ],
      "definition": "a condition in which the body reacts badly to a particular food, substance, or other agent",
      "userGuesses": [
        "hypersensitivity",
        "allergic reaction"
      ],
      "status": "mastered",
      "meaning": "alergi",
      "phonetics": {
        "us": "/ˈælərdʒi/",
        "uk": "/ˈælədʒi/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has an allergy to peanuts.",
          "translation": "Dia memiliki alergi kacang tanah."
        },
        {
          "type": "Complex",
          "text": "Because she has a severe allergy, she always carries an EpiPen with her.",
          "translation": "Karena dia memiliki alergi parah, dia selalu membawa EpiPen dengannya."
        },
        {
          "type": "Compound",
          "text": "I have an allergy to shellfish, and I also get sick from eating dairy products.",
          "translation": "Saya memiliki alergi kerang, dan saya juga jatuh sakit dari mengonsumsi produk susu."
        },
        {
          "type": "Compound-Complex",
          "text": "While I have an allergy to gluten, my sister is not allergic, but she prefers to eat gluten-free food because she believes it is healthier, and she also avoids eating dairy products.",
          "translation": "Sementara saya memiliki alergi gluten, adik saya tidak alergi, tapi dia lebih suka makan makanan bebas gluten karena dia percaya itu lebih sehat, dan dia juga menghindari mengonsumsi produk susu."
        }
      ],
      "synonymMeanings": [
        "sensitivitas",
        "hipersensitivitas",
        "intoleransi",
        "kepekaan"
      ]
    },
    {
      "id": "63e7e06c-2e3a-4353-8e7b-5e3c88b8f03f",
      "word": "Mental health",
      "synonyms": [
        "Psychological wellness",
        "emotional"
      ],
      "definition": "A person's condition with regard to their psychological and emotional well-being.",
      "userGuesses": [
        "psychological wellness"
      ],
      "status": "discovered",
      "meaning": "Kesehatan mental",
      "phonetics": {
        "us": "/ˈmɛn.təl ˈhɛlθ/",
        "uk": "/ˈmɛn.təl ˈhɛlθ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Mental health is very important.",
          "translation": "Kesehatan mental sangat penting."
        },
        {
          "type": "Complex",
          "text": "Because mental health is important, we should prioritize it.",
          "translation": "Karena kesehatan mental penting, kita sebaiknya memprioritaskannya."
        },
        {
          "type": "Compound",
          "text": "Mental health is important and we should prioritize it every day.",
          "translation": "Kesehatan mental penting dan kita sebaiknya memprioritaskannya setiap hari."
        },
        {
          "type": "Compound-Complex",
          "text": "While mental health is important, we should also prioritize physical health because they are interconnected, and a healthy lifestyle can improve both.",
          "translation": "Sementara kesehatan mental penting, kita juga sebaiknya memprioritaskan kesehatan fisik karena keduanya saling terkait, dan gaya hidup sehat dapat memperbaiki keduanya."
        }
      ],
      "synonymMeanings": [
        "Keseimbangan jiwa",
        "Kesehatan jiwa",
        "Kondisi mental",
        "Kesejahteraan emosional"
      ]
    },
    {
      "id": "d6acc89f-7db9-4b21-b950-98311be419cf",
      "word": "Depression",
      "synonyms": [
        "Melancholy",
        "major depressive disorder"
      ],
      "definition": "a mental state characterized by low mood, feelings of sadness, and a lack of interest or pleasure in activities",
      "userGuesses": [
        "melancholy"
      ],
      "status": "discovered",
      "meaning": "depresi",
      "phonetics": {
        "us": "/dɪˈprɛʃən/",
        "uk": "/dɪˈprɛʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has been suffering from depression for years.",
          "translation": "Dia telah menderita depresi selama bertahun-tahun."
        },
        {
          "type": "Complex",
          "text": "Because she lost her job, she felt depressed and isolated.",
          "translation": "Karena dia kehilangan pekerjaannya, dia merasa depresi dan terisolasi."
        },
        {
          "type": "Compound",
          "text": "She felt depressed, and she also felt anxious about her future.",
          "translation": "Dia merasa depresi, dan dia juga merasa cemas tentang masa depannya."
        },
        {
          "type": "Compound-Complex",
          "text": "While she was going through a difficult time, she felt depressed because she had lost her job, and she also felt anxious about her future.",
          "translation": "Saat dia menghadapi masa sulit, dia merasa depresi karena dia kehilangan pekerjaannya, dan dia juga merasa cemas tentang masa depannya."
        }
      ],
      "synonymMeanings": [
        "kesedihan",
        "keputusasaan",
        "kelesuan",
        "ketidakberdayaan"
      ]
    },
    {
      "id": "5beb8de3-5ddd-4a03-a0af-fd30a541d8cf",
      "word": "Anxiety disorder",
      "synonyms": [
        "Nervous disorder",
        "panic disorder"
      ],
      "definition": "a mental health condition in which a person feels extremely worried or nervous, often about things that might happen in the future",
      "userGuesses": [
        "nervous disorder",
        "panic disorder"
      ],
      "status": "mastered",
      "meaning": "gangguan kecemasan",
      "phonetics": {
        "us": "/æŋˈzaɪəti ˈdɪsɔrdər/",
        "uk": "/æŋˈzaɪəti ˈdɪsɔːdə/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has been diagnosed with an anxiety disorder.",
          "translation": "Dia telah didiagnosa mengidap gangguan kecemasan."
        },
        {
          "type": "Complex",
          "text": "Because she has an anxiety disorder, she often feels overwhelmed by everyday tasks.",
          "translation": "Karena dia mengidap gangguan kecemasan, dia sering merasa terlalu banyak untuk tugas sehari-hari."
        },
        {
          "type": "Compound",
          "text": "She has an anxiety disorder and also struggles with depression.",
          "translation": "Dia mengidap gangguan kecemasan dan juga berjuang melawan depresi."
        },
        {
          "type": "Compound-Complex",
          "text": "While she has been dealing with an anxiety disorder, she also struggles with depression because her mother had the same condition.",
          "translation": "Sementara dia telah menghadapi gangguan kecemasan, dia juga berjuang melawan depresi karena ibunya memiliki kondisi yang sama."
        }
      ],
      "synonymMeanings": [
        "kecemasan",
        "ketakutan",
        "kekhawatiran",
        "gangguan mental"
      ]
    },
    {
      "id": "b3ced70b-5015-4a56-86ab-aab88f351176",
      "word": "Therapy",
      "synonyms": [
        "Rehabilitation",
        "counseling"
      ],
      "definition": "treatment for someone who is ill, either physically or mentally, intended to make them better or to help them deal with their condition",
      "userGuesses": [
        "rehabilitation"
      ],
      "status": "discovered",
      "meaning": "terapi",
      "phonetics": {
        "us": "/ˈθerəpi/",
        "uk": "/ˈθɛrəpi/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She is undergoing therapy to recover from her injury.",
          "translation": "Dia menjalani terapi untuk pulih dari cedera tersebut."
        },
        {
          "type": "Complex",
          "text": "Because she was experiencing anxiety, she started attending therapy sessions to learn how to manage her emotions.",
          "translation": "Karena dia mengalami kecemasan, dia mulai menghadiri sesi terapi untuk belajar mengelola emosinya."
        },
        {
          "type": "Compound",
          "text": "The doctor recommended therapy, and she also started exercising regularly to improve her overall health.",
          "translation": "Dokter menyarankan terapi, dan dia juga mulai berolahraga secara teratur untuk meningkatkan kesehatannya secara keseluruhan."
        },
        {
          "type": "Compound-Complex",
          "text": "While attending therapy sessions to overcome her fear of public speaking, she also joined a debate club, and as a result, her confidence improved significantly, which in turn helped her to perform better at work.",
          "translation": "Saat menghadiri sesi terapi untuk mengatasi rasa takutnya berbicara di depan umum, dia juga bergabung dengan klub debat, dan sebagai hasilnya, kepercayaan dirinya meningkat secara signifikan, yang pada gilirannya membantunya untuk berperforma lebih baik di tempat kerja."
        }
      ],
      "synonymMeanings": [
        "pengobatan",
        "perawatan",
        "penyembuhan",
        "konseling"
      ]
    },
    {
      "id": "ac63b3c1-ab56-4376-a784-bd242b364aaa",
      "word": "Vaccination",
      "synonyms": [
        "Immunization",
        "inoculation"
      ],
      "definition": "The act of giving someone a vaccine to prevent them from getting a particular disease",
      "userGuesses": [
        "immunization"
      ],
      "status": "discovered",
      "meaning": "Vaksinasi",
      "phonetics": {
        "us": "/ˌvæksɪˈneɪʃən/",
        "uk": "/ˌvaksɪˈneɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The doctor recommended vaccination against flu.",
          "translation": "Dokter merekomendasikan vaksinasi terhadap flu."
        },
        {
          "type": "Complex",
          "text": "Because vaccination is mandatory, all children must be vaccinated before starting school.",
          "translation": "Karena vaksinasi adalah wajib, semua anak harus divaksinasi sebelum memulai sekolah."
        },
        {
          "type": "Compound",
          "text": "The hospital offers vaccination and medical check-ups for free, and people can visit the clinic or go to the hospital.",
          "translation": "Rumah sakit menawarkan vaksinasi dan pemeriksaan medis secara gratis, dan orang dapat mengunjungi klinik atau pergi ke rumah sakit."
        },
        {
          "type": "Compound-Complex",
          "text": "While vaccination is an effective way to prevent the spread of diseases, it is also important to note that some people may have adverse reactions, and therefore, they should consult their doctors before getting vaccinated, or they may choose to visit a specialist.",
          "translation": "Sementara vaksinasi adalah cara yang efektif untuk mencegah penyebaran penyakit, juga penting untuk dicatat bahwa beberapa orang mungkin memiliki reaksi negatif, dan oleh karena itu, mereka harus berkonsultasi dengan dokter sebelum divaksinasi, atau mereka dapat memilih untuk mengunjungi seorang spesialis."
        }
      ],
      "synonymMeanings": [
        "Imunisasi",
        "Pemberian vaksin",
        "Pengobatan pencegahan",
        "Pencegahan penyakit"
      ]
    },
    {
      "id": "5837a8f6-23bf-4999-b231-001f35f8f1ca",
      "word": "Epidemic",
      "synonyms": [
        "Outbreak",
        "pandemic"
      ],
      "definition": "a disease that spreads quickly and affects many people at the same time",
      "userGuesses": [
        "outbreak"
      ],
      "status": "discovered",
      "meaning": "wabah penyakit",
      "phonetics": {
        "us": "/ˌɛpɪˈdɛmɪk/",
        "uk": "/ˌɛpɪˈdɛmɪk/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The flu epidemic spread rapidly across the country.",
          "translation": "Wabah flu menyebar dengan cepat di seluruh negeri."
        },
        {
          "type": "Complex",
          "text": "Because the city's water supply was contaminated, an epidemic of cholera broke out.",
          "translation": "Karena pasokan air kota terkontaminasi, wabah kolera pecah."
        },
        {
          "type": "Compound",
          "text": "The doctor worked tirelessly to combat the epidemic, and the nurse helped her with the patients.",
          "translation": "Dokter bekerja tanpa lelah untuk melawan wabah penyakit, dan perawat membantunya dengan pasien."
        },
        {
          "type": "Compound-Complex",
          "text": "While the government was trying to contain the epidemic, the lack of medical supplies made it difficult to treat the patients, and the situation became increasingly dire.",
          "translation": "Saat pemerintah berusaha untuk mengendalikan wabah penyakit, kurangnya persediaan medis membuatnya sulit untuk mengobati pasien, dan situasinya menjadi semakin genting."
        }
      ],
      "synonymMeanings": [
        "penyakit menular",
        "penyebaran penyakit",
        "wabah",
        "penyakit yang meluas"
      ]
    },
    {
      "id": "9ab221b1-7667-422b-a7a5-e790fc182482",
      "word": "Contagious",
      "synonyms": [
        "Infectious",
        "transmittable"
      ],
      "definition": "able to be spread by contact with someone or something that has the disease or feeling",
      "userGuesses": [
        "infectious",
        "transmittable"
      ],
      "status": "mastered",
      "meaning": "menular",
      "phonetics": {
        "us": "/kənˈteɪdʒəs/",
        "uk": "/kənˈteɪdʒəs/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The contagious laugh spread quickly through the room.",
          "translation": "Tawa menular itu menyebar dengan cepat di seluruh ruangan."
        },
        {
          "type": "Complex",
          "text": "Because the disease is contagious, we need to take precautions when visiting the patient.",
          "translation": "Karena penyakit itu menular, kita perlu mengambil tindakan pencegahan saat mengunjungi pasien."
        },
        {
          "type": "Compound",
          "text": "The contagious atmosphere in the stadium and the delicious food made the event unforgettable.",
          "translation": "Atmosfer menular di stadion dan makanan yang lezat membuat acara itu tak terlupakan."
        },
        {
          "type": "Compound-Complex",
          "text": "While the contagious energy of the crowd was exciting, the fact that the concert was outdoors and it was raining made the experience less enjoyable, but the lead singer's performance was still impressive.",
          "translation": "Sementara energi menular kerumunan itu menyenangkan, kenyataan bahwa konser itu di luar ruangan dan hujan membuat pengalaman itu kurang menyenangkan, tetapi penampilan penyanyi utama masih mengesankan."
        }
      ],
      "synonymMeanings": [
        "penyakit menular",
        "infeksius",
        "menyebar",
        "menginfeksi"
      ]
    },
    {
      "id": "15966760-fd68-4015-9260-d9d94f6fdddf",
      "word": "Rehabilitation",
      "synonyms": [
        "Recovery",
        "therapy"
      ],
      "definition": "the process of helping someone who has been ill or in prison to become healthy or normal again",
      "userGuesses": [
        "recovery",
        "therapy"
      ],
      "status": "mastered",
      "meaning": "rehabilitasi",
      "phonetics": {
        "us": "/ˌrɛhəbɪlɪˈteɪʃən/",
        "uk": "/ˌriːhəbɪlɪˈteɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The patient underwent rehabilitation after the surgery.",
          "translation": "Pasien menjalani rehabilitasi setelah operasi."
        },
        {
          "type": "Complex",
          "text": "Because she had been bedridden for months, she required rehabilitation to regain her strength.",
          "translation": "Karena dia telah terbaring di tempat tidur selama berbulan-bulan, dia memerlukan rehabilitasi untuk mengembalikan kekuatannya."
        },
        {
          "type": "Compound",
          "text": "The hospital offered rehabilitation and the patient recovered quickly, and she was able to return home soon.",
          "translation": "Rumah sakit menawarkan rehabilitasi dan pasien pulih dengan cepat, dan dia dapat kembali ke rumah segera."
        },
        {
          "type": "Compound-Complex",
          "text": "While the new employee was undergoing rehabilitation because he had been injured on the job, his colleague helped him with his tasks, and they were both able to meet the deadline, although it was challenging.",
          "translation": "Ketika karyawan baru menjalani rehabilitasi karena dia telah terluka saat bekerja, rekan kerjanya membantunya dengan tugas-tugasnya, dan mereka berdua dapat memenuhi deadline, meskipun itu menantang."
        }
      ],
      "synonymMeanings": [
        "pemulihan",
        "perbaikan",
        "penyembuhan",
        "pemuliharaan"
      ]
    },
    {
      "id": "4f745f2a-217c-4804-a770-46ed7ffc1836",
      "word": "Malnutrition",
      "synonyms": [
        "Undernourishment",
        "starvation"
      ],
      "definition": "a state of health caused by a lack of food or a lack of certain nutrients in the food that you eat",
      "userGuesses": [
        "undernourishment",
        "starvation"
      ],
      "status": "mastered",
      "meaning": "kekurangan gizi",
      "phonetics": {
        "us": "/ˌmælnʊˈtrɪʃən/",
        "uk": "/ˌmæl.nʊˈtrɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The child suffered from malnutrition due to a poor diet.",
          "translation": "Anak itu menderita kekurangan gizi karena pola makan yang buruk."
        },
        {
          "type": "Complex",
          "text": "Because the family was unable to afford nutritious food, the child developed malnutrition.",
          "translation": "Karena keluarga tidak mampu membeli makanan bergizi, anak itu mengalami kekurangan gizi."
        },
        {
          "type": "Compound",
          "text": "The region experienced famine and malnutrition, and many people suffered as a result.",
          "translation": "Daerah tersebut mengalami kelaparan dan kekurangan gizi, dan banyak orang menderita akibatnya."
        },
        {
          "type": "Compound-Complex",
          "text": "While the new government has implemented policies to reduce poverty, it has also struggled to address the issues of famine and malnutrition that have plagued the country for decades, because the problems are deeply rooted in the nation's history.",
          "translation": "Sementara pemerintah baru telah melaksanakan kebijakan untuk mengurangi kemiskinan, juga berjuang untuk mengatasi masalah kelaparan dan kekurangan gizi yang telah melanda negara selama beberapa dekade, karena masalah-masalah tersebut sangat berakar dalam sejarah bangsa."
        }
      ],
      "synonymMeanings": [
        "kekurangan gizi",
        "kelaparan",
        "kekurangan nutrisi",
        "kekurangan makanan"
      ]
    },
    {
      "id": "1d741244-2995-46ad-b4e3-c20ec25488ad",
      "word": "Holistic medicine",
      "synonyms": [
        "Alternative medicine",
        "integrative health"
      ],
      "definition": "a approach to medicine that considers the whole person, including their physical, mental, and emotional health, when treating a disease or illness",
      "userGuesses": [
        "alternative medicine"
      ],
      "status": "discovered",
      "meaning": "pengobatan holistik",
      "phonetics": {
        "us": "/hoʊˈlɪstɪk/",
        "uk": "/həʊˈlɪstɪk/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The doctor specialized in holistic medicine.",
          "translation": "Dokter tersebut berspesialisasi dalam pengobatan holistik."
        },
        {
          "type": "Complex",
          "text": "Because holistic medicine considers the whole person, it is often more effective than traditional treatments.",
          "translation": "Karena pengobatan holistik mempertimbangkan keseluruhan seseorang, seringkali lebih efektif daripada perawatan tradisional."
        },
        {
          "type": "Compound",
          "text": "The hospital offered holistic medicine and traditional therapy, so patients had a choice.",
          "translation": "Rumah sakit tersebut menawarkan pengobatan holistik dan terapi tradisional, sehingga pasien memiliki pilihan."
        },
        {
          "type": "Compound-Complex",
          "text": "While some doctors specialize in holistic medicine, others prefer traditional treatments, and because each approach has its own benefits, patients should consider their options carefully.",
          "translation": "Sementara beberapa dokter berspesialisasi dalam pengobatan holistik, yang lain lebih suka perawatan tradisional, dan karena setiap pendekatan memiliki kelebihan masing-masing, pasien sebaiknya mempertimbangkan pilihan mereka dengan hati-hati."
        }
      ],
      "synonymMeanings": [
        "pengobatan alternatif",
        "pengobatan komplementer",
        "kedokteran integral",
        "pengobatan menyeluruh"
      ]
    },
    {
      "id": "4d4c4cb6-8827-4b09-896e-cd071fe277a2",
      "word": "Herbal remedies",
      "synonyms": [
        "Natural medicine",
        "traditional healing"
      ],
      "definition": "Medicines or treatments made from plants, used to prevent or cure diseases or medical conditions.",
      "userGuesses": [
        "natural medicine"
      ],
      "status": "discovered",
      "meaning": "Obat-obatan atau pengobatan yang terbuat dari tanaman, digunakan untuk mencegah atau menyembuhkan penyakit atau kondisi medis.",
      "phonetics": {
        "us": "/ˈərbəl rɪˈmɛdiz/",
        "uk": "/ˈhɜːbəl rɪˈmiːdɪz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She uses herbal remedies to cure her headache.",
          "translation": "Dia menggunakan obat-obatan herbal untuk menyembuhkan sakit kepalanya."
        },
        {
          "type": "Complex",
          "text": "Because herbal remedies are natural, they are often preferred over chemical-based medicines.",
          "translation": "Karena obat-obatan herbal adalah alami, mereka sering lebih disukai daripada obat-obatan berbasis kimia."
        },
        {
          "type": "Compound",
          "text": "Herbal remedies are popular, and many people use them to cure their illnesses, but some are not effective.",
          "translation": "Obat-obatan herbal populer, dan banyak orang menggunakan mereka untuk menyembuhkan penyakit mereka, tetapi beberapa tidak efektif."
        },
        {
          "type": "Compound-Complex",
          "text": "While herbal remedies can be effective in treating some medical conditions, they can also interact with other medications, and therefore, patients should consult their doctors before using them, because some interactions can be harmful.",
          "translation": "Sementara obat-obatan herbal dapat efektif dalam mengobati beberapa kondisi medis, mereka juga dapat berinteraksi dengan obat-obatan lain, dan oleh karena itu, pasien harus berkonsultasi dengan dokter mereka sebelum menggunakan mereka, karena beberapa interaksi dapat berbahaya."
        }
      ],
      "synonymMeanings": [
        "Pengobatan Alami",
        "Obat Tradisional",
        "Ramuan Herbal",
        "Terapi Holistik"
      ]
    },
    {
      "id": "53cc691c-d6f2-448b-a27d-7fca0c0eb3b5",
      "word": "Addiction",
      "synonyms": [
        "Dependency",
        "substance abuse"
      ],
      "definition": "the state of being physically or mentally dependent on something, especially a drug",
      "userGuesses": [
        "dependency"
      ],
      "status": "discovered",
      "meaning": "kecanduan",
      "phonetics": {
        "us": "/əˈdɪkʃən/",
        "uk": "/əˈdɪkʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has an addiction to coffee.",
          "translation": "Dia memiliki kecanduan terhadap kopi."
        },
        {
          "type": "Complex",
          "text": "Because she started drinking at a young age, she developed an addiction to alcohol.",
          "translation": "Karena dia mulai minum pada usia muda, dia mengembangkan kecanduan terhadap alkohol."
        },
        {
          "type": "Compound",
          "text": "She has an addiction to coffee, and she also loves tea.",
          "translation": "Dia memiliki kecanduan terhadap kopi, dan dia juga menyukai teh."
        },
        {
          "type": "Compound-Complex",
          "text": "While she was studying, she developed an addiction to coffee, and as a result, she started to drink it every morning, but she also realized that she needed to reduce her intake because it was affecting her sleep.",
          "translation": "Saat dia belajar, dia mengembangkan kecanduan terhadap kopi, dan sebagai hasilnya, dia mulai minum setiap pagi, tetapi dia juga menyadari bahwa dia perlu mengurangi konsumsinya karena itu mempengaruhi tidurnya."
        }
      ],
      "synonymMeanings": [
        "kebiasaan buruk",
        "ketergantungan",
        "penyakit kecanduan"
      ]
    },
    {
      "id": "ccd6bfeb-b760-407b-977c-21f75f217219",
      "word": "Withdrawal symptoms",
      "synonyms": [
        "Detox effects",
        "cravings"
      ],
      "definition": "physical and mental problems that happen when someone stops taking a drug or drinking alcohol after using it or drinking it regularly",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "gejala putus obat atau alkohol",
      "phonetics": {
        "us": "/wɪðˈdrɔːl ˈsɪmp.təmz/",
        "uk": "/wɪθˈdrɔːl ˈsɪmptəmz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The patient experienced withdrawal symptoms after stopping the medication.",
          "translation": "Pasien mengalami gejala putus obat setelah berhenti minum obat."
        },
        {
          "type": "Complex",
          "text": "When she stopped drinking, she suffered from withdrawal symptoms because her body had become dependent on alcohol.",
          "translation": "Ketika dia berhenti minum, dia menderita gejala putus alkohol karena tubuhnya sudah tergantung pada alkohol."
        },
        {
          "type": "Compound",
          "text": "The doctor warned the patient about withdrawal symptoms, and the patient decided to quit smoking.",
          "translation": "Dokter memperingatkan pasien tentang gejala putus obat, dan pasien memutuskan untuk berhenti merokok."
        },
        {
          "type": "Compound-Complex",
          "text": "While the new drug helped many patients, it also caused severe withdrawal symptoms in some cases, which made the doctors question its effectiveness, and they decided to conduct further research.",
          "translation": "Sementara obat baru membantu banyak pasien, obat itu juga menyebabkan gejala putus obat yang parah dalam beberapa kasus, yang membuat dokter mempertanyakan efektivitasnya, dan mereka memutuskan untuk melakukan penelitian lebih lanjut."
        }
      ],
      "synonymMeanings": [
        "gejala sakaw",
        "gejala penarikan",
        "reaksi putus zat",
        "gejala abstinen"
      ]
    },
    {
      "id": "e210c373-1058-43d2-a798-3a0f53f82eb9",
      "word": "Genetic disorder",
      "synonyms": [
        "Inherited disease",
        "congenital disorder"
      ],
      "definition": "a condition that someone is born with because of a problem with their genes",
      "userGuesses": [
        "inherited disease"
      ],
      "status": "discovered",
      "meaning": "gangguan genetik",
      "phonetics": {
        "us": "/dɪˈsɔrdər/",
        "uk": "/dɪˈsɔːdə/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The baby was born with a genetic disorder.",
          "translation": "Bayi itu lahir dengan gangguan genetik."
        },
        {
          "type": "Complex",
          "text": "Because the family has a history of genetic disorders, they decided to have their children tested.",
          "translation": "Karena keluarga memiliki riwayat gangguan genetik, mereka memutuskan untuk melakukan tes pada anak-anak mereka."
        },
        {
          "type": "Compound",
          "text": "The doctor diagnosed the patient with a genetic disorder, and she needed surgery immediately.",
          "translation": "Dokter mendiagnosa pasien dengan gangguan genetik, dan dia memerlukan operasi segera."
        },
        {
          "type": "Compound-Complex",
          "text": "While the new medication can help alleviate symptoms of genetic disorders, it is not a cure, and patients need to take it regularly because the disease can progress quickly if left untreated.",
          "translation": "Sementara obat baru dapat membantu mengurangi gejala gangguan genetik, itu bukanlah obat, dan pasien perlu mengambilnya secara teratur karena penyakit dapat berkembang dengan cepat jika tidak diobati."
        }
      ],
      "synonymMeanings": [
        "kelainan bawaan",
        "penyakit keturunan",
        "gangguan keturunan",
        "kelainan genetik"
      ]
    },
    {
      "id": "89f9d11e-4157-49f9-ab7d-c42deab76cec",
      "word": "Immune system",
      "synonyms": [
        "Immunity",
        "defense system"
      ],
      "definition": "the system that protects the body from infection and disease",
      "userGuesses": [
        "immunity"
      ],
      "status": "discovered",
      "meaning": "sistem kekebalan tubuh",
      "phonetics": {
        "us": "/ɪˈmuːn ˈsɪstəm/",
        "uk": "/ɪˈmjuːn ˈsɪstəm/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The immune system helps fight off infections.",
          "translation": "Sistem kekebalan tubuh membantu melawan infeksi."
        },
        {
          "type": "Complex",
          "text": "Because she had a healthy diet, her immune system was able to fight off the illness.",
          "translation": "Karena dia memiliki pola makan yang sehat, sistem kekebalan tubuhnya dapat melawan penyakit tersebut."
        },
        {
          "type": "Compound",
          "text": "The immune system protects the body, and it also helps to heal injuries.",
          "translation": "Sistem kekebalan tubuh melindungi tubuh, dan juga membantu menyembuhkan luka."
        },
        {
          "type": "Compound-Complex",
          "text": "While the immune system protects the body from infection, it can sometimes overreact and cause problems, but a healthy lifestyle helps to balance it.",
          "translation": "Saat sistem kekebalan tubuh melindungi tubuh dari infeksi, terkadang dapat bereaksi berlebihan dan menyebabkan masalah, tetapi gaya hidup sehat membantu menyeimbangkannya."
        }
      ],
      "synonymMeanings": [
        "pertahanan tubuh",
        "sistem pertahanan alami",
        "kekebalan",
        "daya tahan tubuh"
      ]
    },
    {
      "id": "c8bba173-3473-447a-b878-aecbe0eea2e6",
      "word": "Respiratory illness",
      "synonyms": [
        "Lung disease",
        "breathing disorder"
      ],
      "definition": "a disease or condition that affects the lungs or airways, making it difficult to breathe",
      "userGuesses": [
        "lung disease",
        "breathing disorder"
      ],
      "status": "mastered",
      "meaning": "penyakit pernapasan",
      "phonetics": {
        "us": "/rɪˈspɪrətɔri/",
        "uk": "/rɪˈspɪrətri/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has a respiratory illness.",
          "translation": "Dia menderita penyakit pernapasan."
        },
        {
          "type": "Complex",
          "text": "Because she has a respiratory illness, she needs to use an inhaler.",
          "translation": "Karena dia menderita penyakit pernapasan, dia perlu menggunakan inhaler."
        },
        {
          "type": "Compound",
          "text": "She has a respiratory illness, and she also has a fever.",
          "translation": "Dia menderita penyakit pernapasan, dan dia juga demam."
        },
        {
          "type": "Compound-Complex",
          "text": "She has a respiratory illness, and because she has been smoking for years, she also has a persistent cough, but she is trying to quit.",
          "translation": "Dia menderita penyakit pernapasan, dan karena dia telah merokok selama bertahun-tahun, dia juga memiliki batuk yang persisten, tapi dia berusaha untuk berhenti."
        }
      ],
      "synonymMeanings": [
        "penyakit paru-paru",
        "gangguan pernapasan",
        "infeksi saluran pernapasan"
      ]
    },
    {
      "id": "80e27dcb-8975-4276-bc14-aa20fb6c8fa1",
      "word": "Chronic disease",
      "synonyms": [
        "Long-lasting illness",
        "persistent condition"
      ],
      "definition": "a disease or condition that lasts for a long time, often for the rest of a person's life",
      "userGuesses": [
        "long-lasting illness"
      ],
      "status": "discovered",
      "meaning": "penyakit kronis",
      "phonetics": {
        "us": "/ˈkrɑnɪk/",
        "uk": "/ˈkrɒnɪk/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Diabetes is a chronic disease.",
          "translation": "Diabetes adalah penyakit kronis."
        },
        {
          "type": "Complex",
          "text": "Because she has a chronic disease, she needs to take medication every day.",
          "translation": "Karena dia memiliki penyakit kronis, dia perlu mengonsumsi obat setiap hari."
        },
        {
          "type": "Compound",
          "text": "Chronic diseases are expensive to treat, and they can also cause a lot of pain.",
          "translation": "Penyakit kronis mahal biayanya, dan juga dapat menyebabkan banyak rasa sakit."
        },
        {
          "type": "Compound-Complex",
          "text": "While chronic diseases can be managed with medication, they are often caused by a combination of genetic and environmental factors, and they can have a significant impact on a person's quality of life.",
          "translation": "Sementara penyakit kronis dapat diatasi dengan obat, mereka sering disebabkan oleh kombinasi faktor genetik dan lingkungan, dan juga dapat memiliki dampak signifikan pada kualitas hidup seseorang."
        }
      ],
      "synonymMeanings": [
        "penyakit jangka panjang",
        "penyakit menetap",
        "penyakit berkepanjangan",
        "penyakit yang berlangsung lama"
      ]
    },
    {
      "id": "fb262cd7-4530-4bcc-a1e0-44c912b392bf",
      "word": "Acute illness",
      "synonyms": [
        "Short-term disease",
        "rapid-onset illness"
      ],
      "definition": "a disease or condition that has a sudden onset, severe symptoms, and a relatively short duration",
      "userGuesses": [
        "short-term disease"
      ],
      "status": "discovered",
      "meaning": "penyakit akut",
      "phonetics": {
        "us": "/əˈkyūt/",
        "uk": "/əˈkjuːt/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The patient was hospitalized due to an acute illness.",
          "translation": "Pasien dirawat di rumah sakit karena penyakit akut."
        },
        {
          "type": "Complex",
          "text": "Because the patient had a history of heart disease, the doctor suspected that the acute illness was related to it.",
          "translation": "Karena pasien memiliki riwayat penyakit jantung, dokter menduga bahwa penyakit akut tersebut terkait dengan hal itu."
        },
        {
          "type": "Compound",
          "text": "The doctor treated the patient for both the acute illness and the chronic condition, and the patient made a full recovery.",
          "translation": "Dokter mengobati pasien untuk penyakit akut dan kondisi kronis, dan pasien pulih sepenuhnya."
        },
        {
          "type": "Compound-Complex",
          "text": "While the doctor treated the patient for the acute illness, the nurse also monitored the patient's condition because the patient had a history of heart disease, and the doctor suspected that the acute illness was related to it.",
          "translation": "Saat dokter mengobati pasien untuk penyakit akut, perawat juga memantau kondisi pasien karena pasien memiliki riwayat penyakit jantung, dan dokter menduga bahwa penyakit akut tersebut terkait dengan hal itu."
        }
      ],
      "synonymMeanings": [
        "penyakit tiba-tiba",
        "penyakit serius",
        "penyakit berat",
        "penyakit parah"
      ]
    },
    {
      "id": "2b0df7df-a132-4d07-982a-f0512519295e",
      "word": "Occupational health",
      "synonyms": [
        "Workplace safety",
        "employee health"
      ],
      "definition": "The department of medicine concerned with the prevention and treatment of job-related illnesses and injuries",
      "userGuesses": [
        "workplace safety",
        "employee health"
      ],
      "status": "mastered",
      "meaning": "Kesehatan kerja",
      "phonetics": {
        "us": "/ˌɒkjuˈpeɪʃənl ˈhɛlθ/",
        "uk": "/ˌɒkjʊˈpeɪʃənl ˈhɛlθ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The company has a department of occupational health.",
          "translation": "Perusahaan tersebut memiliki departemen kesehatan kerja."
        },
        {
          "type": "Complex",
          "text": "Because the workers were exposed to toxic chemicals, the company had to invest in occupational health and safety programs.",
          "translation": "Karena para pekerja terpapar bahan kimia beracun, perusahaan harus berinvestasi dalam program kesehatan dan keselamatan kerja."
        },
        {
          "type": "Compound",
          "text": "The company provides occupational health services and also offers fitness programs for employees.",
          "translation": "Perusahaan menyediakan layanan kesehatan kerja dan juga menawarkan program kebugaran untuk karyawan."
        },
        {
          "type": "Compound-Complex",
          "text": "While the company provides occupational health services, it also offers fitness programs for employees, because a healthy workforce is more productive.",
          "translation": "Sementara perusahaan menyediakan layanan kesehatan kerja, mereka juga menawarkan program kebugaran untuk karyawan, karena tenaga kerja yang sehat lebih produktif."
        }
      ],
      "synonymMeanings": [
        "Kesehatan tempat kerja",
        "Kesehatan pekerja",
        "Kesehatan dan keselamatan kerja"
      ]
    },
    {
      "id": "ba3065f2-826b-4303-905f-64374b863e36",
      "word": "Hygiene",
      "synonyms": [
        "Sanitation",
        "cleanliness"
      ],
      "definition": "the state of being clean and free from dirt, bacteria, etc.",
      "userGuesses": [
        "cleanliness",
        "sanitation"
      ],
      "status": "mastered",
      "meaning": "kebersihan",
      "phonetics": {
        "us": "/ˈhaɪ.dʒiːn/",
        "uk": "/ˈhaɪ.dʒiːn/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Personal hygiene is very important.",
          "translation": "Kebersihan pribadi sangat penting."
        },
        {
          "type": "Complex",
          "text": "Because hygiene is essential for our health, we need to wash our hands frequently.",
          "translation": "Karena kebersihan sangat penting bagi kesehatan kita, kita perlu mencuci tangan secara teratur."
        },
        {
          "type": "Compound",
          "text": "Hygiene is important, and so is a healthy diet to maintain our overall well-being.",
          "translation": "Kebersihan penting, dan begitu juga dengan pola makan sehat untuk menjaga kesejahteraan kita secara keseluruhan."
        },
        {
          "type": "Compound-Complex",
          "text": "While hygiene is crucial for preventing illnesses, a balanced lifestyle that includes regular exercise and a healthy diet is also necessary, because it helps to boost our immune system.",
          "translation": "Sementara kebersihan sangat penting untuk mencegah penyakit, gaya hidup seimbang yang mencakup olahraga teratur dan pola makan sehat juga diperlukan, karena hal ini membantu meningkatkan sistem kekebalan tubuh kita."
        }
      ],
      "synonymMeanings": [
        "kebersihan",
        "kesucian",
        "kebijaksanaan"
      ]
    },
    {
      "id": "d8481229-b468-4195-85b4-885f21fa5532",
      "word": "Adolescence",
      "synonyms": [
        "Teenage years",
        "youth"
      ],
      "definition": "The period of life when a person is developing from a child into an adult, from about the age of 13 to 19.",
      "userGuesses": [
        "youth"
      ],
      "status": "discovered",
      "meaning": "Masa remaja",
      "phonetics": {
        "us": "/ˌædəˈlesns/",
        "uk": "/ˌædəˈlɛsəns/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She began to develop her own interests during adolescence.",
          "translation": "Dia mulai mengembangkan minatnya sendiri selama masa remaja."
        },
        {
          "type": "Complex",
          "text": "Because she had a difficult time in adolescence, she struggled to form close relationships as an adult.",
          "translation": "Karena dia mengalami masa sulit selama masa remaja, dia berjuang untuk membentuk hubungan dekat sebagai orang dewasa."
        },
        {
          "type": "Compound",
          "text": "Adolescence is a challenging time, and many teenagers struggle with identity issues, but most eventually find their place in the world, and some even become leaders.",
          "translation": "Masa remaja adalah waktu yang menantang, dan banyak remaja berjuang dengan masalah identitas, tapi kebanyakan akhirnya menemukan tempat mereka di dunia, dan beberapa bahkan menjadi pemimpin."
        },
        {
          "type": "Compound-Complex",
          "text": "While adolescence can be a tumultuous period, during which teenagers often experience mood swings and rebel against authority, it is also a time of great opportunity for growth and self-discovery, because they are learning to navigate complex social relationships and develop their own sense of purpose.",
          "translation": "Sementara masa remaja bisa menjadi periode yang berubah-ubah, di mana remaja sering mengalami perubahan mood dan memberontak melawan otoritas, itu juga merupakan waktu besar untuk pertumbuhan dan penemuan diri, karena mereka sedang belajar untuk mengarungi hubungan sosial yang kompleks dan mengembangkan tujuan mereka sendiri."
        }
      ],
      "synonymMeanings": [
        "Masa puber",
        "Masa transisi",
        "Masa perkembangan"
      ]
    },
    {
      "id": "e44b3973-a444-4dda-be2b-7b13fc53f605",
      "word": "Puberty",
      "synonyms": [
        "Maturation",
        "biological development"
      ],
      "definition": "the period of life when a young person develops physically and sexually into an adult",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "masa puber",
      "phonetics": {
        "us": "/ˈpʌbərti/",
        "uk": "/ˈpjuːbəti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Girls usually enter puberty earlier than boys.",
          "translation": "Gadis-gadis biasanya memasuki masa puber lebih awal daripada laki-laki."
        },
        {
          "type": "Complex",
          "text": "Because she was going through puberty, she experienced mood swings.",
          "translation": "Karena dia sedang mengalami masa puber, dia mengalami perubahan mood."
        },
        {
          "type": "Compound",
          "text": "Puberty is a challenging time, and adolescents often feel embarrassed and self-conscious, but they also start to develop new skills and interests.",
          "translation": "Masa puber adalah waktu yang menantang, dan remaja sering merasa malu dan tidak percaya diri, tetapi mereka juga mulai mengembangkan keterampilan dan minat baru."
        },
        {
          "type": "Compound-Complex",
          "text": "While puberty can be a difficult time for many teenagers, because they have to navigate significant physical and emotional changes, it is also a period of great opportunity for growth and self-discovery, as they begin to explore their own identities and form meaningful relationships with others.",
          "translation": "Sementara masa puber dapat menjadi waktu yang sulit bagi banyak remaja, karena mereka harus menghadapi perubahan fisik dan emosional yang signifikan, ini juga merupakan periode kesempatan besar untuk pertumbuhan dan penemuan diri, karena mereka mulai mengeksplorasi identitas mereka sendiri dan membentuk hubungan yang bermakna dengan orang lain."
        }
      ],
      "synonymMeanings": [
        "masa akil balig",
        "masa remaja",
        "peralihan dari anak-anak ke dewasa"
      ]
    },
    {
      "id": "60ac6d9c-d324-44bd-b5da-314312d85541",
      "word": "Cognitive development",
      "synonyms": [
        "Intellectual growth",
        "mental development"
      ],
      "definition": "The process by which the brain develops and matures, especially in children, and by which a person becomes able to think, learn, and understand more and more complex ideas and concepts.",
      "userGuesses": [
        "intellectual growth"
      ],
      "status": "discovered",
      "meaning": "Perkembangan kognitif",
      "phonetics": {
        "us": "/kɑɡˈnɪtɪv dɪˈvɛləpmənt/",
        "uk": "/kɒɡˈnɪtɪv dɪˈvɛləpmənt/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The child's cognitive development was remarkable.",
          "translation": "Perkembangan kognitif anak itu luar biasa."
        },
        {
          "type": "Complex",
          "text": "Because the child was exposed to a variety of stimuli, her cognitive development was enhanced.",
          "translation": "Karena anak itu terpapar pada berbagai rangsangan, perkembangan kognitifnya ditingkatkan."
        },
        {
          "type": "Compound",
          "text": "The child's cognitive development was rapid, and she began reading books, and she started solving puzzles.",
          "translation": "Perkembangan kognitif anak itu cepat, dan dia mulai membaca buku, dan dia mulai memecahkan teka-teki."
        },
        {
          "type": "Compound-Complex",
          "text": "While the child's cognitive development was remarkable because she was exposed to a variety of stimuli, she began reading books, and she started solving puzzles, which further enhanced her cognitive abilities.",
          "translation": "Sementara perkembangan kognitif anak itu luar biasa karena dia terpapar pada berbagai rangsangan, dia mulai membaca buku, dan dia mulai memecahkan teka-teki, yang lebih lanjut meningkatkan kemampuan kognitifnya."
        }
      ],
      "synonymMeanings": [
        "Perkembangan mental",
        "Pertumbuhan intelektual",
        "Perkembangan intelektual",
        "Pengembangan kemampuan berpikir"
      ]
    },
    {
      "id": "541eae5b-3b97-4774-a69b-a2d526cd7232",
      "word": "Emotional maturity",
      "synonyms": [
        "Psychological growth",
        "emotional"
      ],
      "definition": "the ability to control and understand your emotions, and to deal with situations in a sensible and adult way",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "kedewasaan emosional",
      "phonetics": {
        "us": "/ɪˈmoʊʃənl ˈmætʃərɪti/",
        "uk": "/ɪˈməʊʃənl ˈmætʃərɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has emotional maturity beyond her years.",
          "translation": "Dia memiliki kedewasaan emosional yang melampaui usianya."
        },
        {
          "type": "Complex",
          "text": "Because she has emotional maturity, she can handle difficult situations.",
          "translation": "Karena dia memiliki kedewasaan emosional, dia dapat menangani situasi sulit."
        },
        {
          "type": "Compound",
          "text": "She has emotional maturity, and she is also very intelligent.",
          "translation": "Dia memiliki kedewasaan emosional, dan dia juga sangat pintar."
        },
        {
          "type": "Compound-Complex",
          "text": "Although she is still young, she has emotional maturity, and she can handle difficult situations because she is confident.",
          "translation": "Meskipun dia masih muda, dia memiliki kedewasaan emosional, dan dia dapat menangani situasi sulit karena dia percaya diri."
        }
      ],
      "synonymMeanings": [
        "kedewasaan",
        "kematangan",
        "kestabilan emosional",
        "keseimbangan mental"
      ]
    },
    {
      "id": "de883684-6095-4ea1-883e-b3742882b07b",
      "word": "Social skills",
      "synonyms": [
        "Communication skills",
        "interpersonal"
      ],
      "definition": "the abilities that people have to interact and communicate with others effectively",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "keterampilan sosial",
      "phonetics": {
        "us": "/ˈsoʊʃəl ˈskɪlz/",
        "uk": "/ˈsəʊʃəl ˈskɪlz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has excellent social skills.",
          "translation": "Dia memiliki keterampilan sosial yang sangat baik."
        },
        {
          "type": "Complex",
          "text": "Because she has good social skills, she can easily make friends.",
          "translation": "Karena dia memiliki keterampilan sosial yang baik, dia dapat dengan mudah berteman."
        },
        {
          "type": "Compound",
          "text": "She has social skills and she is very intelligent.",
          "translation": "Dia memiliki keterampilan sosial dan dia sangat pintar."
        },
        {
          "type": "Compound-Complex",
          "text": "While she has social skills, she is also very intelligent, and because of that, she can easily make friends.",
          "translation": "Sementara dia memiliki keterampilan sosial, dia juga sangat pintar, dan karena itu, dia dapat dengan mudah berteman."
        }
      ],
      "synonymMeanings": [
        "keterampilan berinteraksi",
        "keterampilan bergaul",
        "kemampuan bersosialisasi",
        "keterampilan berkomunikasi"
      ]
    },
    {
      "id": "fd3fd0c2-8837-4bb8-893a-d6ab1e6129a4",
      "word": "Peer pressure",
      "synonyms": [
        "Social influence",
        "group pressure"
      ],
      "definition": "the strong influence of a group of people of the same age that can affect a person's behaviour",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "tekanan dari teman sebaya",
      "phonetics": {
        "us": "/ˈpɪr ˈprɛʃər/",
        "uk": "/ˈpɪə ˈprɛʃə/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She gave in to peer pressure and started smoking.",
          "translation": "Dia menyerah pada tekanan dari teman sebaya dan mulai merokok."
        },
        {
          "type": "Complex",
          "text": "Because she was influenced by peer pressure, she decided to join the club.",
          "translation": "Karena dia dipengaruhi oleh tekanan dari teman sebaya, dia memutuskan untuk bergabung dengan klub tersebut."
        },
        {
          "type": "Compound",
          "text": "Peer pressure made her feel anxious, and she didn't know what to do, but she still wanted to fit in.",
          "translation": "Tekanan dari teman sebaya membuatnya merasa cemas, dan dia tidak tahu apa yang harus dilakukan, tapi dia masih ingin bergabung."
        },
        {
          "type": "Compound-Complex",
          "text": "While peer pressure can be overwhelming, it is essential to remember that we have the power to make our own decisions, and we should not give in to something that we know is wrong, because if we do, we will regret it later.",
          "translation": "Sementara tekanan dari teman sebaya dapat sangat menghancurkan, penting untuk diingat bahwa kita memiliki kekuatan untuk membuat keputusan kita sendiri, dan kita tidak boleh menyerah pada sesuatu yang kita tahu salah, karena jika kita melakukannya, kita akan menyesalinya nanti."
        }
      ],
      "synonymMeanings": [
        "pengaruh teman",
        "desakan sebaya",
        "tekanan sosial",
        "pengaruh kelompok"
      ]
    },
    {
      "id": "cde67b5f-a86b-4b7a-8391-354d061673bd",
      "word": "Independence",
      "synonyms": [
        "Self-sufficiency",
        "autonomy"
      ],
      "definition": "the state of being free from the control or influence of others",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "kemerdekaan",
      "phonetics": {
        "us": "/ɪndɪˈpɛndəns/",
        "uk": "/ɪndɪˈpɛndəns/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She values her independence.",
          "translation": "Dia menghargai kemerdekaannya."
        },
        {
          "type": "Complex",
          "text": "Because she wanted to be independent, she learned how to manage her finances.",
          "translation": "Karena dia ingin mandiri, dia belajar mengelola keuangannya."
        },
        {
          "type": "Compound",
          "text": "She wanted independence, but she also needed support from her family.",
          "translation": "Dia menginginkan kemerdekaan, tetapi dia juga membutuhkan dukungan dari keluarganya."
        },
        {
          "type": "Compound-Complex",
          "text": "While she wanted independence and was determined to make it on her own, she also knew that sometimes she needed help, because her parents had taught her that it was okay to ask for support when necessary.",
          "translation": "Sementara dia menginginkan kemerdekaan dan bertekad untuk berhasil dengan usahanya sendiri, dia juga tahu bahwa terkadang dia membutuhkan bantuan, karena orang tuanya telah mengajarkannya bahwa tidak apa-apa untuk meminta bantuan ketika diperlukan."
        }
      ],
      "synonymMeanings": [
        "kebebasan",
        "otonomi",
        "kedaulatan",
        "mandiri"
      ]
    },
    {
      "id": "14822fbe-1cf5-407b-9bc5-c622dc7fa8a3",
      "word": "Discipline",
      "synonyms": [
        "Self-discipline",
        "regulation"
      ],
      "definition": "the practice of training people to obey rules or a code of behaviour, using punishment or other negative consequences for misbehaviour",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "disiplin",
      "phonetics": {
        "us": "/ˈdɪsəplɪn/",
        "uk": "/ˈdɪsɪplɪn/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has a strong discipline that helps her study every day.",
          "translation": "Dia memiliki disiplin yang kuat yang membantunya belajar setiap hari."
        },
        {
          "type": "Complex",
          "text": "Because she has a strong discipline, she can finish her homework on time.",
          "translation": "Karena dia memiliki disiplin yang kuat, dia dapat menyelesaikan pekerjaan rumahnya tepat waktu."
        },
        {
          "type": "Compound",
          "text": "I need discipline to study, and I also need a quiet place to focus.",
          "translation": "Saya membutuhkan disiplin untuk belajar, dan saya juga membutuhkan tempat yang tenang untuk fokus."
        },
        {
          "type": "Compound-Complex",
          "text": "While I was studying, I realized that having discipline is important, but it is also important to have a quiet place to focus, and I need both to succeed.",
          "translation": "Ketika saya sedang belajar, saya menyadari bahwa memiliki disiplin sangat penting, tetapi juga penting untuk memiliki tempat yang tenang untuk fokus, dan saya membutuhkan keduanya untuk sukses."
        }
      ],
      "synonymMeanings": [
        "pengendalian diri",
        "kedisiplinan",
        "pengawasan",
        "penindakan"
      ]
    },
    {
      "id": "968262c7-8408-4edc-9808-5fae5e45946c",
      "word": "Responsibility",
      "synonyms": [
        "Obligation",
        "accountability"
      ],
      "definition": "The state or fact of being responsible, or something for which you are responsible",
      "userGuesses": [
        "obligation"
      ],
      "status": "discovered",
      "meaning": "Tanggung jawab",
      "phonetics": {
        "us": "/rɪˌspɑnsəˈbɪlɪti/",
        "uk": "/rɪˌspɒnsɪˈbɪlɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She feels a sense of responsibility for her actions.",
          "translation": "Dia merasa memiliki rasa tanggung jawab atas tindakannya."
        },
        {
          "type": "Complex",
          "text": "Because she is the manager, she has the responsibility to make important decisions.",
          "translation": "Karena dia adalah manajer, dia memiliki tanggung jawab untuk membuat keputusan penting."
        },
        {
          "type": "Compound",
          "text": "I have a responsibility to my family, and I also have a responsibility to my job.",
          "translation": "Saya memiliki tanggung jawab kepada keluarga saya, dan saya juga memiliki tanggung jawab kepada pekerjaan saya."
        },
        {
          "type": "Compound-Complex",
          "text": "While I have a responsibility to my family, I also have a responsibility to my job, because my employer is counting on me to meet the deadlines.",
          "translation": "Sementara saya memiliki tanggung jawab kepada keluarga saya, saya juga memiliki tanggung jawab kepada pekerjaan saya, karena majikan saya mengandalkan saya untuk memenuhi tenggat waktu."
        }
      ],
      "synonymMeanings": [
        "Kewajiban",
        "Tanggung jawab hukum",
        "Akuntabilitas"
      ]
    },
    {
      "id": "6fd095ab-0ffd-4a1e-b886-acae13df2570",
      "word": "Self-esteem",
      "synonyms": [
        "Self-respect",
        "self-worth"
      ],
      "definition": "a person's belief and confidence in their own ability and value",
      "userGuesses": [
        "self-worth"
      ],
      "status": "discovered",
      "meaning": "harga diri",
      "phonetics": {
        "us": "/ˌself əˈstiːm/",
        "uk": "/ˌself ɛˈstiːm/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has low self-esteem.",
          "translation": "Dia memiliki harga diri yang rendah."
        },
        {
          "type": "Complex",
          "text": "Because she failed the exam, she has low self-esteem.",
          "translation": "Karena dia gagal ujian, dia memiliki harga diri yang rendah."
        },
        {
          "type": "Compound",
          "text": "She has low self-esteem, and she is very shy.",
          "translation": "Dia memiliki harga diri yang rendah, dan dia sangat pemalu."
        },
        {
          "type": "Compound-Complex",
          "text": "Although she has low self-esteem, she is trying to improve herself, and she is taking classes to become more confident.",
          "translation": "Meskipun dia memiliki harga diri yang rendah, dia berusaha untuk meningkatkan diri, dan dia mengambil kelas untuk menjadi lebih percaya diri."
        }
      ],
      "synonymMeanings": [
        "kebanggaan diri",
        "percaya diri",
        "kepercayaan diri",
        "harga diri sendiri"
      ]
    },
    {
      "id": "a12ca53a-5d6b-40ff-a82d-fca9a59004ee",
      "word": "Aerobic exercise",
      "synonyms": [
        "Cardio",
        "endurance training"
      ],
      "definition": "exercise, such as running or cycling, that makes your heart and lungs work harder and is good for your health",
      "userGuesses": [
        "cardio"
      ],
      "status": "discovered",
      "meaning": "olahraga aerobik",
      "phonetics": {
        "us": "/ˌɛr.oʊˈbɪk ˈɛksərˌsaɪz/",
        "uk": "/ˌɛərəʊˈbɪk ˈɛksəsaɪz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Aerobic exercise helps to reduce stress.",
          "translation": "Olahraga aerobik membantu mengurangi stres."
        },
        {
          "type": "Complex",
          "text": "Because aerobic exercise is good for the heart, it is often recommended by doctors.",
          "translation": "Karena olahraga aerobik baik untuk jantung, maka seringkali direkomendasikan oleh dokter."
        },
        {
          "type": "Compound",
          "text": "Aerobic exercise helps to reduce stress, and it also improves overall health.",
          "translation": "Olahraga aerobik membantu mengurangi stres, dan juga meningkatkan kesehatan secara keseluruhan."
        },
        {
          "type": "Compound-Complex",
          "text": "While aerobic exercise is good for the heart, it can be harmful if overdone, and people who engage in it regularly should also make sure to get enough rest, because otherwise they may experience fatigue.",
          "translation": "Sementara olahraga aerobik baik untuk jantung, itu dapat berbahaya jika berlebihan, dan orang-orang yang terlibat di dalamnya secara teratur juga harus memastikan untuk mendapatkan istirahat yang cukup, karena jika tidak mereka mungkin mengalami kelelahan."
        }
      ],
      "synonymMeanings": [
        "senam",
        "latihan kekuatan",
        "aktivitas fisik",
        "olahraga kardio"
      ]
    },
    {
      "id": "a09463ae-720c-424a-ba69-841ab647e5d7",
      "word": "Anaerobic exercise",
      "synonyms": [
        "Strength training",
        "resistance exercise"
      ],
      "definition": "a type of exercise, such as weightlifting or push-ups, that does not need oxygen to generate energy",
      "userGuesses": [
        "strength training"
      ],
      "status": "discovered",
      "meaning": "latihan anaerobik",
      "phonetics": {
        "us": "/ˌænəˈroʊbɪk/",
        "uk": "/ˌanəˈrəʊbɪk/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Anaerobic exercise is great for building muscle.",
          "translation": "Latihan anaerobik sangat baik untuk membangun otot."
        },
        {
          "type": "Complex",
          "text": "Because anaerobic exercise is high-intensity, it improves cardiovascular health.",
          "translation": "Karena latihan anaerobik memiliki intensitas tinggi, maka dapat memperbaiki kesehatan kardiovaskular."
        },
        {
          "type": "Compound",
          "text": "I do anaerobic exercise and cardio to stay fit, and I also eat a healthy diet.",
          "translation": "Saya melakukan latihan anaerobik dan kardio untuk tetap bugar, dan saya juga mengonsumsi makanan sehat."
        },
        {
          "type": "Compound-Complex",
          "text": "While anaerobic exercise is beneficial for muscle growth, it can be harmful if overdone, because it puts excessive strain on the muscles and joints, and I have learned this from my personal experience.",
          "translation": "Sementara latihan anaerobik bermanfaat untuk pertumbuhan otot, latihan ini dapat membahayakan jika berlebihan, karena memberikan tekanan berlebih pada otot dan sendi, dan saya telah mempelajari hal ini dari pengalaman pribadi saya."
        }
      ],
      "synonymMeanings": [
        "senam",
        "gaya hidup sehat",
        "olahraga tanpa oksigen"
      ]
    },
    {
      "id": "7cf0309c-9994-42c2-81f9-70253ba00a64",
      "word": "Endurance",
      "synonyms": [
        "Stamina",
        "resilience"
      ],
      "definition": "the ability to continue doing something over a long period of time, even when it is difficult or tiring",
      "userGuesses": [
        "resilience"
      ],
      "status": "discovered",
      "meaning": "ketahanan",
      "phonetics": {
        "us": "/ɛnˈdʊrəns/",
        "uk": "/ɛnˈdjʊərəns/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She has great endurance and can run a marathon.",
          "translation": "Dia memiliki ketahanan yang luar biasa dan dapat berlari maraton."
        },
        {
          "type": "Complex",
          "text": "Because she trained every day, she was able to increase her endurance.",
          "translation": "Karena dia berlatih setiap hari, dia dapat meningkatkan ketahanannya."
        },
        {
          "type": "Compound",
          "text": "She has endurance and speed, which makes her a great athlete, and she also has a strong will to win.",
          "translation": "Dia memiliki ketahanan dan kecepatan, yang membuatnya atlet hebat, dan dia juga memiliki keinginan kuat untuk menang."
        },
        {
          "type": "Compound-Complex",
          "text": "While she was training, she realized that having endurance was not just about physical strength, but also about mental toughness, and this realization helped her to push through the challenges, which made her a better athlete, and she was proud of her progress.",
          "translation": "Saat sedang berlatih, dia menyadari bahwa memiliki ketahanan bukan hanya tentang kekuatan fisik, tetapi juga tentang ketangguhan mental, dan pemahaman ini membantunya untuk melalui tantangan, yang membuatnya atlet yang lebih baik, dan dia bangga dengan kemajuannya."
        }
      ],
      "synonymMeanings": [
        "daya tahan",
        "ketabahan",
        "kesabaran",
        "kekuatan"
      ]
    },
    {
      "id": "2dde3bc4-70c7-43fe-b49a-fab25c8ac905",
      "word": "Flexibility",
      "synonyms": [
        "Suppleness",
        "mobility"
      ],
      "definition": "The ability to change or be changed easily according to the situation.",
      "userGuesses": [
        "mobility"
      ],
      "status": "discovered",
      "meaning": "Kelenturan",
      "phonetics": {
        "us": "/flɛksəˈbɪlɪti/",
        "uk": "/flɛksɪˈbɪlɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The new employee showed flexibility in her work schedule.",
          "translation": "Karyawan baru itu menunjukkan kelenturan dalam jadwal kerjanya."
        },
        {
          "type": "Complex",
          "text": "Because the company needs to adapt to the market, it requires flexibility from all employees.",
          "translation": "Karena perusahaan perlu menyesuaikan diri dengan pasar, maka diperlukan kelenturan dari semua karyawan."
        },
        {
          "type": "Compound",
          "text": "The company offers flexibility in work hours, and employees can also work from home.",
          "translation": "Perusahaan menawarkan kelenturan dalam jam kerja, dan karyawan juga bisa bekerja dari rumah."
        },
        {
          "type": "Compound-Complex",
          "text": "While the new policy allows for flexibility in meeting deadlines, it also requires employees to be more responsible, because they have to manage their time effectively to meet the targets.",
          "translation": "Sementara kebijakan baru memungkinkan kelenturan dalam memenuhi tenggat waktu, juga memerlukan karyawan untuk lebih bertanggung jawab, karena mereka harus mengelola waktu mereka dengan efektif untuk mencapai target."
        }
      ],
      "synonymMeanings": [
        "Kemampuan menyesuaikan diri",
        "Keluwesan",
        "Keterbukaan"
      ]
    },
    {
      "id": "1382edb7-6773-4017-a5b5-fd670f93fb64",
      "word": "Strength training",
      "synonyms": [
        "Resistance training",
        "weightlifting"
      ],
      "definition": "the activity of doing exercises in order to make your muscles stronger",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "latihan kekuatan",
      "phonetics": {
        "us": "/ˈstrɛŋθ ˈtreɪnɪŋ/",
        "uk": "/ˈstrɛnθ ˈtreɪnɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She does strength training every morning.",
          "translation": "Dia melakukan latihan kekuatan setiap pagi."
        },
        {
          "type": "Complex",
          "text": "Because she wanted to build muscle, she started doing strength training.",
          "translation": "Karena dia ingin membangun otot, dia mulai melakukan latihan kekuatan."
        },
        {
          "type": "Compound",
          "text": "Strength training is essential, and so is cardio exercise.",
          "translation": "Latihan kekuatan sangat penting, dan begitu juga olahraga kardio."
        },
        {
          "type": "Compound-Complex",
          "text": "While strength training is essential for building muscle, it is also important to remember that cardio exercise is necessary for overall health, and she does both.",
          "translation": "Sementara latihan kekuatan sangat penting untuk membangun otot, juga penting untuk diingat bahwa olahraga kardio diperlukan untuk kesehatan secara keseluruhan, dan dia melakukan keduanya."
        }
      ],
      "synonymMeanings": [
        "pelatihan kekuatan",
        "pembangunan otot",
        "pengembangan kekuatan",
        "latihan beban"
      ]
    },
    {
      "id": "076d46b2-1b53-48ac-baf4-87cb51749c51",
      "word": "Cardiovascular fitness",
      "synonyms": [
        "Heart health",
        "stamina"
      ],
      "definition": "The state of being physically fit and healthy, especially in relation to the heart and lungs.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Kesegaran kardiovaskular",
      "phonetics": {
        "us": "/ˌkɑrdioʊˈvæskjʊlər/",
        "uk": "/ˌkɑːdioʊˈvæskjʊlə/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Regular exercise improves cardiovascular fitness.",
          "translation": "Olahraga teratur meningkatkan kesegaran kardiovaskular."
        },
        {
          "type": "Complex",
          "text": "Because regular exercise is essential for cardiovascular fitness, I try to exercise every day.",
          "translation": "Karena olahraga teratur sangat penting untuk kesegaran kardiovaskular, aku berusaha berolahraga setiap hari."
        },
        {
          "type": "Compound",
          "text": "Cardiovascular fitness is important, and exercise is fun, so I work out every morning.",
          "translation": "Kesegaran kardiovaskular sangat penting, dan berolahraga itu menyenangkan, jadi aku berolahraga setiap pagi."
        },
        {
          "type": "Compound-Complex",
          "text": "While some people think that cardiovascular fitness is only for athletes, I believe that it is essential for everyone, because regular exercise can prevent heart disease, and it also helps to reduce stress.",
          "translation": "Sementara beberapa orang berpikir bahwa kesegaran kardiovaskular hanya untuk atlet, aku percaya bahwa itu sangat penting untuk semua orang, karena olahraga teratur dapat mencegah penyakit jantung, dan juga membantu mengurangi stres."
        }
      ],
      "synonymMeanings": [
        "kesegaran jasmani",
        "kesehatan jantung",
        "kesegaran fisik",
        "kebugaran"
      ]
    },
    {
      "id": "5e51646d-b8a5-4dce-9823-9c9077552f71",
      "word": "Muscle hypertrophy",
      "synonyms": [
        "Muscle growth",
        "bodybuilding"
      ],
      "definition": "the growth and increase in size of muscle cells, which can happen as a result of exercise, especially weight training",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "hipertrofi otot",
      "phonetics": {
        "us": "/hʌɪˈpɝːtrəfi/",
        "uk": "/haɪˈpɜːtrəfi/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Muscle hypertrophy occurs when muscle cells grow and increase in size.",
          "translation": "Hipertrofi otot terjadi ketika sel otot tumbuh dan meningkatkan ukurannya."
        },
        {
          "type": "Complex",
          "text": "Because muscle hypertrophy is a complex process, it requires a combination of proper nutrition, adequate rest, and consistent training.",
          "translation": "Karena hipertrofi otot adalah proses yang kompleks, maka diperlukan kombinasi gizi yang tepat, istirahat yang cukup, dan pelatihan yang konsisten."
        },
        {
          "type": "Compound",
          "text": "Muscle hypertrophy is a desirable outcome for many athletes, and it can be achieved through weight training and proper nutrition, or through the use of supplements and steroids.",
          "translation": "Hipertrofi otot adalah hasil yang diinginkan oleh banyak atlet, dan dapat dicapai melalui pelatihan beban dan gizi yang tepat, atau melalui penggunaan suplemen dan steroid."
        },
        {
          "type": "Compound-Complex",
          "text": "While muscle hypertrophy is a desirable outcome for many athletes, it can be difficult to achieve, because it requires a combination of proper nutrition, adequate rest, and consistent training, and also because it can be influenced by factors such as genetics and overall health.",
          "translation": "Sementara hipertrofi otot adalah hasil yang diinginkan oleh banyak atlet, namun dapat sulit untuk dicapai, karena memerlukan kombinasi gizi yang tepat, istirahat yang cukup, dan pelatihan yang konsisten, dan juga karena dapat dipengaruhi oleh faktor-faktor seperti genetik dan kesehatan secara keseluruhan."
        }
      ],
      "synonymMeanings": [
        "pembesaran otot",
        "pertumbuhan otot",
        "peningkatan massa otot"
      ]
    },
    {
      "id": "1703a718-3efd-46f2-b04d-0d626d4d713f",
      "word": "Metabolism",
      "synonyms": [
        "Caloric burn",
        "energy expenditure"
      ],
      "definition": "the process by which the body changes food into energy and the raw materials needed for growth and repair",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "metabolisme",
      "phonetics": {
        "us": "/məˈtæbəlɪzəm/",
        "uk": "/məˈtæbɒlɪzəm/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "A healthy diet can improve your metabolism.",
          "translation": "Polanya makan yang sehat dapat meningkatkan metabolisme Anda."
        },
        {
          "type": "Complex",
          "text": "Because she has a high metabolism, she can eat a lot without gaining weight.",
          "translation": "Karena dia memiliki metabolisme yang tinggi, dia dapat makan banyak tanpa gemuk."
        },
        {
          "type": "Compound",
          "text": "I exercise regularly and eat a healthy diet, but my metabolism is still slow.",
          "translation": "Saya berolahraga teratur dan makan pola makan yang sehat, tetapi metabolisme saya masih lambat."
        },
        {
          "type": "Compound-Complex",
          "text": "While a slow metabolism can make it difficult to lose weight, regular exercise and a healthy diet can still help, because they increase the rate at which the body burns calories.",
          "translation": "Meskipun metabolisme yang lambat dapat membuatnya sulit untuk menurunkan berat badan, olahraga teratur dan pola makan yang sehat masih dapat membantu, karena mereka meningkatkan laju di mana tubuh membakar kalori."
        }
      ],
      "synonymMeanings": [
        "pembakaran",
        "pembelahan",
        "pengubahan",
        "penyerapan"
      ]
    },
    {
      "id": "fdf06bdb-e5a0-4745-9dec-b28318ced7bd",
      "word": "High-Intensity Interval Training",
      "synonyms": [
        "Intense cardio",
        "interval training"
      ],
      "definition": "a type of exercise that involves short periods of very hard work, followed by short periods of rest",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Latihan Intervensi Interval Intensitas Tinggi",
      "phonetics": {
        "us": "/haɪ ɪnˈtɛnsɪti ˈɪnərvəl ˈtreɪnɪŋ/",
        "uk": "/haɪ ɪnˈtɛnsɪti ˈɪnərvəl ˈtreɪnɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "I do high-intensity interval training three times a week.",
          "translation": "Aku melakukan latihan intervensi interval intensitas tinggi tiga kali seminggu."
        },
        {
          "type": "Complex",
          "text": "Because high-intensity interval training is effective, I have decided to incorporate it into my workout routine.",
          "translation": "Karena latihan intervensi interval intensitas tinggi efektif, aku telah memutuskan untuk memasukkannya ke dalam rutinitas olahraga aku."
        },
        {
          "type": "Compound",
          "text": "I do high-intensity interval training and yoga to stay healthy, and I also eat a balanced diet.",
          "translation": "Aku melakukan latihan intervensi interval intensitas tinggi dan yoga untuk menjaga kesehatan, dan aku juga mengonsumsi makanan seimbang."
        },
        {
          "type": "Compound-Complex",
          "text": "While I have been doing high-intensity interval training for months, I have also been eating a balanced diet, and as a result, I feel more energetic, but my friend, who only does yoga, feels more relaxed.",
          "translation": "Sementara aku telah melakukan latihan intervensi interval intensitas tinggi selama berbulan-bulan, aku juga telah mengonsumsi makanan seimbang, dan sebagai hasilnya, aku merasa lebih berenergi, tetapi teman aku, yang hanya melakukan yoga, merasa lebih rileks."
        }
      ],
      "synonymMeanings": [
        "Latihan Kardio",
        "Latihan Pemulihan",
        "Latihan Fisik",
        "Latihan Kondisi"
      ]
    },
    {
      "id": "2dd7d8a0-e694-40b8-9d2f-922aec3bddc9",
      "word": "Body composition",
      "synonyms": [
        "Physical makeup",
        "body structure"
      ],
      "definition": "The amount of fat, bone, and muscle in the body, especially when compared to the total weight of the body.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Komposisi tubuh",
      "phonetics": {
        "us": "/ˈbɑːdi ˌkɒmpəˈzɪʃən/",
        "uk": "/ˈbɒdi ˌkɒmpəˈzɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Athletes often monitor their body composition.",
          "translation": "Atlet sering memantau komposisi tubuh mereka."
        },
        {
          "type": "Complex",
          "text": "Because body composition affects our health, we should eat a balanced diet.",
          "translation": "Karena komposisi tubuh memengaruhi kesehatan kita, kita sebaiknya mengonsumsi makanan yang seimbang."
        },
        {
          "type": "Compound",
          "text": "I exercise regularly and I watch what I eat, but my body composition has not changed much.",
          "translation": "Saya berolahraga secara teratur dan saya memperhatikan apa yang saya makan, tapi komposisi tubuh saya tidak banyak berubah."
        },
        {
          "type": "Compound-Complex",
          "text": "While it is true that genetics play a role in determining our body composition, regular exercise and a healthy diet can also make a significant difference, because they help us maintain a healthy weight.",
          "translation": "Sementara itu benar bahwa genetika memainkan peran dalam menentukan komposisi tubuh kita, olahraga teratur dan makanan yang sehat juga dapat membuat perbedaan yang signifikan, karena mereka membantu kita mempertahankan berat badan yang sehat."
        }
      ],
      "synonymMeanings": [
        "komposisi fisik",
        "proporsi tubuh",
        "susunan tubuh",
        "komponen tubuh"
      ]
    },
    {
      "id": "5dd0f2c0-04ea-4691-854b-8cc2142fd1dc",
      "word": "Resistance bands",
      "synonyms": [
        "Elastic training tools",
        "tension bands"
      ],
      "definition": "a long, thin, rubber strip used for exercise, which strengthens muscles by resisting movement",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "pita resistensi",
      "phonetics": {
        "us": "/rəˈzistəns ˈbændz/",
        "uk": "/rɪˈzɪstəns ˈbændz/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She uses resistance bands to stay fit.",
          "translation": "Dia menggunakan pita resistensi untuk menjaga kebugaran."
        },
        {
          "type": "Complex",
          "text": "Because resistance bands are portable, she can exercise anywhere.",
          "translation": "Karena pita resistensi portable, dia bisa berolahraga di mana saja."
        },
        {
          "type": "Compound",
          "text": "She uses resistance bands and does yoga to stay healthy, and she also eats a balanced diet.",
          "translation": "Dia menggunakan pita resistensi dan melakukan yoga untuk menjaga kesehatan, dan dia juga makan makanan seimbang."
        },
        {
          "type": "Compound-Complex",
          "text": "While she was on vacation, she used resistance bands to stay fit, because she knew that exercise is essential for her well-being, and she also wanted to enjoy her trip without worrying about her fitness.",
          "translation": "Ketika dia sedang liburan, dia menggunakan pita resistensi untuk menjaga kebugaran, karena dia tahu bahwa olahraga sangat penting untuk kesejahteraannya, dan dia juga ingin menikmati perjalanannya tanpa khawatir tentang kebugarannya."
        }
      ],
      "synonymMeanings": [
        "pita olahraga",
        "alat peregangan",
        "pita elastis",
        "peralatan kebugaran"
      ]
    },
    {
      "id": "6aa16ec2-e52b-448a-84e5-72b1510dc29a",
      "word": "Repetition",
      "synonyms": [
        "Exercise cycle",
        "movement count"
      ],
      "definition": "The act of doing or saying something again, especially because it has a particular effect or achieves a particular result.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Pengulangan",
      "phonetics": {
        "us": "/ˌrɛpɪˈtɪʃən/",
        "uk": "/ˌrepɪˈtɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The teacher warned the student about the repetition of his mistakes.",
          "translation": "Guru itu memperingatkan siswa tentang pengulangan kesalahannya."
        },
        {
          "type": "Complex",
          "text": "Because the company did not correct its mistakes, the repetition of errors led to its downfall.",
          "translation": "Karena perusahaan itu tidak memperbaiki kesalahannya, pengulangan kesalahan itu menyebabkan kehancurannya."
        },
        {
          "type": "Compound",
          "text": "The repetition of the exercise helped me build muscle, and I also lost weight.",
          "translation": "Pengulangan latihan itu membantu saya membangun otot, dan saya juga kehilangan berat badan."
        },
        {
          "type": "Compound-Complex",
          "text": "While I was practicing the piano, I realized that the repetition of certain melodies was necessary to master the piece, but it was also boring, and I needed to take breaks occasionally.",
          "translation": "Saat saya berlatih piano, saya menyadari bahwa pengulangan beberapa melodi tertentu diperlukan untuk menguasai bagian itu, tapi juga membosankan, dan saya perlu beristirahat sesekali."
        }
      ],
      "synonymMeanings": [
        "pengulangan",
        "peniruan",
        "mengulang",
        "mengulangi"
      ]
    },
    {
      "id": "1916a63c-6dea-4080-9c8c-e349e5948baf",
      "word": "Set",
      "synonyms": [
        "Exercise round",
        "sequence"
      ],
      "definition": "a group of things that belong together or have something in common",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "sekumpulan atau kelompok",
      "phonetics": {
        "us": "/sɛt/",
        "uk": "/sɛt/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The set of books includes a dictionary.",
          "translation": "Sekumpulan buku tersebut termasuk kamus."
        },
        {
          "type": "Complex",
          "text": "Because the new policy was implemented, the set of rules had to be changed.",
          "translation": "Karena kebijakan baru diterapkan, sekumpulan aturan harus diubah."
        },
        {
          "type": "Compound",
          "text": "I bought a set of knives, and I also bought a set of spoons.",
          "translation": "Saya membeli sekumpulan pisau, dan saya juga membeli sekumpulan sendok."
        },
        {
          "type": "Compound-Complex",
          "text": "While I was shopping, I bought a set of knives because they were on sale, and I also bought a set of spoons because I needed them.",
          "translation": "Ketika saya berbelanja, saya membeli sekumpulan pisau karena mereka sedang diskon, dan saya juga membeli sekumpulan sendok karena saya membutuhkannya."
        }
      ],
      "synonymMeanings": [
        "kelompok",
        "kumpulan",
        "sekumpulan",
        "himpunan"
      ]
    },
    {
      "id": "a22fe229-03e2-446a-9fa6-1c1539e0579f",
      "word": "Warm-up",
      "synonyms": [
        "Pre-workout routine",
        "stretching"
      ],
      "definition": "an activity that you do to prepare yourself for a physical or mental effort",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "pemanasan",
      "phonetics": {
        "us": "/ˈwɔrm ʌp/",
        "uk": "/ˈwɔːm ʌp/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The team did a warm-up before the game.",
          "translation": "Tim melakukan pemanasan sebelum pertandingan."
        },
        {
          "type": "Complex",
          "text": "Because the concert was about to start, the singer did a quick warm-up to loosen her vocal cords.",
          "translation": "Karena konser akan segera dimulai, penyanyi melakukan pemanasan cepat untuk melemaskan tali vokalnya."
        },
        {
          "type": "Compound",
          "text": "The coach made the players do a warm-up, and then they started to practice their skills.",
          "translation": "Pelatih membuat pemain melakukan pemanasan, lalu mereka mulai berlatih keterampilan mereka."
        },
        {
          "type": "Compound-Complex",
          "text": "While the other team was doing their warm-up, our team was already preparing their strategy, because they knew that the game was going to be tough.",
          "translation": "Saat tim lain melakukan pemanasan, tim kami sudah mempersiapkan strategi mereka, karena mereka tahu bahwa pertandingan akan sulit."
        }
      ],
      "synonymMeanings": [
        "persiapan",
        "pembukaan",
        "pengenalan",
        "penyajian"
      ]
    },
    {
      "id": "45022215-6b6c-47e2-8d92-c306fc5e5491",
      "word": "Cool-down",
      "synonyms": [
        "Post-workout routine",
        "relaxation"
      ],
      "definition": "a period of time for relaxing or doing something gentle after exercise or another energetic activity",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "pendinginan",
      "phonetics": {
        "us": "/ˈkuːl daʊn/",
        "uk": "/ˈkuːl daʊn/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "After running, I need to cool down.",
          "translation": "Setelah berlari, saya perlu pendinginan."
        },
        {
          "type": "Complex",
          "text": "Because I exercised too much, I have to cool down to avoid injury.",
          "translation": "Karena saya berolahraga terlalu banyak, saya harus pendinginan untuk menghindari cedera."
        },
        {
          "type": "Compound",
          "text": "I will cool down and then take a shower.",
          "translation": "Saya akan pendinginan dan kemudian mandi."
        },
        {
          "type": "Compound-Complex",
          "text": "While I was cooling down, I realized that I had forgotten my water bottle, so I had to go back to the locker room to get it.",
          "translation": "Saat saya sedang pendinginan, saya menyadari bahwa saya telah lupa botol air saya, jadi saya harus kembali ke ruang ganti untuk mengambilnya."
        }
      ],
      "synonymMeanings": [
        "istirahat",
        "relaksasi",
        "pengurangan intensitas",
        "pendinginan"
      ]
    },
    {
      "id": "018045e9-fa8c-49a3-9693-343f117c685c",
      "word": "Plyometrics",
      "synonyms": [
        "Jump training",
        "explosive workouts"
      ],
      "definition": "a way of training that involves jumping and other movements that stretch and then quickly shorten the muscles",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "pelatihan yang melibatkan lompatan dan gerakan lain yang memanjangkan dan kemudian memendekkan otot dengan cepat",
      "phonetics": {
        "us": "/ˌplaɪəˈmɛtrɪks/",
        "uk": "/ˌplʌɪəˈmɛtrɪks/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Plyometrics is a fun way to improve your fitness.",
          "translation": "Plyometrik adalah cara yang menyenangkan untuk meningkatkan kebugaran Anda."
        },
        {
          "type": "Complex",
          "text": "Because plyometrics is a high-intensity workout, it is essential to warm up before starting.",
          "translation": "Karena plyometrik adalah latihan intensitas tinggi, sangat penting untuk melakukan pemanasan sebelum memulai."
        },
        {
          "type": "Compound",
          "text": "Plyometrics is a great way to improve your vertical jump, and it is also a lot of fun.",
          "translation": "Plyometrik adalah cara yang baik untuk meningkatkan lompatan vertikal Anda, dan itu juga sangat menyenangkan."
        },
        {
          "type": "Compound-Complex",
          "text": "While plyometrics can be an effective way to improve your athletic performance, it is crucial to incorporate it into your training routine gradually, because it can be stressful for your muscles and joints.",
          "translation": "Sementara plyometrik dapat menjadi cara yang efektif untuk meningkatkan kinerja atletik Anda, sangat penting untuk memasukkannya ke dalam rutinitas pelatihan Anda secara bertahap, karena dapat menekan otot dan sendi Anda."
        }
      ],
      "synonymMeanings": [
        "latihan kekuatan",
        "pelatihan kecepatan",
        "latihan daya ledak"
      ]
    },
    {
      "id": "91695d61-0e71-46f8-ba03-2c3831092d2a",
      "word": "Agility",
      "synonyms": [
        "Quickness",
        "nimbleness"
      ],
      "definition": "The ability to move quickly and easily",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Meaning not found.",
      "phonetics": {
        "us": "/.../",
        "uk": "/.../"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Usage of Agility is important."
        },
        {
          "type": "Complex",
          "text": "Because Agility matters, we should study it."
        },
        {
          "type": "Compound",
          "text": "The word is Agility, and it is useful."
        },
        {
          "type": "Compound-Complex",
          "text": "If we use Agility correctly, we succeed, so let's try."
        }
      ]
    },
    {
      "id": "2d54b6a7-a37b-42b6-9612-81d802d956a3",
      "word": "Core strength",
      "synonyms": [
        "Midsection stability",
        "core fitness"
      ],
      "definition": "The strength that you have in the central part of your body, which helps you to keep your balance and gives you power when you move",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Kekuatan inti",
      "phonetics": {
        "us": "/kɔr ˈstrɛŋθ/",
        "uk": "/kɔː ˈstrɛŋθ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Having core strength is essential for good posture.",
          "translation": "Mempunyai kekuatan inti sangat penting untuk postur tubuh yang baik."
        },
        {
          "type": "Complex",
          "text": "Because she regularly practices yoga, she has developed the core strength that enables her to perform complex poses.",
          "translation": "Karena dia secara teratur berlatih yoga, dia telah mengembangkan kekuatan inti yang memungkinkannya untuk melakukan pose yang kompleks."
        },
        {
          "type": "Compound",
          "text": "Core strength is important, and regular exercise helps to improve it, so I try to work out every day.",
          "translation": "Kekuatan inti sangat penting, dan olahraga teratur membantu meningkatkannya, jadi saya mencoba berolahraga setiap hari."
        },
        {
          "type": "Compound-Complex",
          "text": "While having strong arms and legs is important, core strength is also crucial because it helps to stabilize the body, and regular exercise can improve it, which is why I try to work out every day.",
          "translation": "Sementara memiliki lengan dan kaki yang kuat sangat penting, kekuatan inti juga sangat penting karena membantu menstabilkan tubuh, dan olahraga teratur dapat meningkatkannya, yang merupakan alasan mengapa saya mencoba berolahraga setiap hari."
        }
      ],
      "synonymMeanings": [
        "Kekuatan otot perut",
        "Kekuatan pusat tubuh",
        "Keseimbangan tubuh"
      ]
    },
    {
      "id": "6c54ae3c-7c49-478a-91b3-86efb287f22a",
      "word": "Posture",
      "synonyms": [
        "Alignment",
        "stance"
      ],
      "definition": "The way in which a person holds their body",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Meaning not found.",
      "phonetics": {
        "us": "/.../",
        "uk": "/.../"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Usage of Posture is important."
        },
        {
          "type": "Complex",
          "text": "Because Posture matters, we should study it."
        },
        {
          "type": "Compound",
          "text": "The word is Posture, and it is useful."
        },
        {
          "type": "Compound-Complex",
          "text": "If we use Posture correctly, we succeed, so let's try."
        }
      ]
    },
    {
      "id": "db7c52a4-11ae-4bfd-a394-24da70516248",
      "word": "Recovery time",
      "synonyms": [
        "Rest period",
        "healing phase"
      ],
      "definition": "The period needed for muscles to heal after exercise",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "n/a",
      "phonetics": {
        "us": "n/a",
        "uk": "n/a"
      }
    },
    {
      "id": "ff064543-c1dd-4d9d-a3e1-520a5dd33e0a",
      "word": "Lactic acid",
      "synonyms": [
        "Metabolic byproduct",
        "fatigue cause"
      ],
      "definition": "A substance that builds up in muscles during intense exercise",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Meaning not found.",
      "phonetics": {
        "us": "/.../",
        "uk": "/.../"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Usage of Lactic acid is important."
        },
        {
          "type": "Complex",
          "text": "Because Lactic acid matters, we should study it."
        },
        {
          "type": "Compound",
          "text": "The word is Lactic acid, and it is useful."
        },
        {
          "type": "Compound-Complex",
          "text": "If we use Lactic acid correctly, we succeed, so let's try."
        }
      ]
    },
    {
      "id": "5d8f5610-712c-4162-96d6-730e3f3e3f6a",
      "word": "Hydration",
      "synonyms": [
        "Fluid intake",
        "water consumption"
      ],
      "definition": "The process of giving someone or something enough water or other liquid to keep them or it healthy and working properly",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "pemberian cairan",
      "phonetics": {
        "us": "/haɪˈdreɪʃən/",
        "uk": "/haɪˈdreɪʃən/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Drinking water is essential for hydration.",
          "translation": "Minum air sangat penting untuk pemberian cairan."
        },
        {
          "type": "Complex",
          "text": "Because she didn't drink enough water, her body lacked proper hydration, which made her feel weak.",
          "translation": "Karena dia tidak minum air yang cukup, tubuhnya kekurangan cairan, sehingga membuatnya merasa lemah."
        },
        {
          "type": "Compound",
          "text": "I drink water to stay hydrated, and I also eat fruits to get more fluids.",
          "translation": "Saya minum air untuk tetap terhidrasi, dan saya juga makan buah untuk mendapatkan lebih banyak cairan."
        },
        {
          "type": "Compound-Complex",
          "text": "While it's true that drinking water is essential for hydration, it's also important to note that eating foods with high water content can help, but only if you don't have certain medical conditions that require special hydration needs.",
          "translation": "Sementara itu benar bahwa minum air sangat penting untuk pemberian cairan, juga penting untuk dicatat bahwa makan makanan dengan kandungan air tinggi dapat membantu, tetapi hanya jika Anda tidak memiliki kondisi medis tertentu yang memerlukan kebutuhan hidrasi khusus."
        }
      ],
      "synonymMeanings": [
        "kelembaban",
        "pemberian cairan",
        "hidrasi",
        "kelembapan"
      ]
    },
    {
      "id": "40e670bf-5192-4200-9799-84e6bcfa08bf",
      "word": "Overtraining",
      "synonyms": [
        "Burnout",
        "physical strain"
      ],
      "definition": "Excessive exercise that leads to fatigue and decreased performance",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Meaning not found.",
      "phonetics": {
        "us": "/.../",
        "uk": "/.../"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Usage of Overtraining is important."
        },
        {
          "type": "Complex",
          "text": "Because Overtraining matters, we should study it."
        },
        {
          "type": "Compound",
          "text": "The word is Overtraining, and it is useful."
        },
        {
          "type": "Compound-Complex",
          "text": "If we use Overtraining correctly, we succeed, so let's try."
        }
      ]
    },
    {
      "id": "628c9fde-187e-475f-b793-fae197ce5143",
      "word": "Interval training",
      "synonyms": [
        "Sprint training",
        "circuit training"
      ],
      "definition": "a method of training in which you do short periods of energetic exercise followed by short periods of rest",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "latihan interval",
      "phonetics": {
        "us": "/ˈɪntərˌvɑl ˈtreɪnɪŋ/",
        "uk": "/ˈɪntəvəl ˈtreɪnɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "She does interval training to improve her endurance.",
          "translation": "Dia melakukan latihan interval untuk meningkatkan ketahanannya."
        },
        {
          "type": "Complex",
          "text": "Because interval training is effective, many athletes use it to improve their performance.",
          "translation": "Karena latihan interval efektif, banyak atlet menggunakan metode ini untuk meningkatkan kinerja mereka."
        },
        {
          "type": "Compound",
          "text": "Interval training is good for the heart, and it also improves muscle strength.",
          "translation": "Latihan interval baik untuk jantung, dan juga meningkatkan kekuatan otot."
        },
        {
          "type": "Compound-Complex",
          "text": "While interval training can be challenging, many athletes use it because it is effective, and it also improves cardiovascular health.",
          "translation": "Meskipun latihan interval bisa menantang, banyak atlet menggunakan metode ini karena efektif, dan juga meningkatkan kesehatan kardiovaskuler."
        }
      ],
      "synonymMeanings": [
        "latihan selang",
        "pelatihan berkala",
        "latihan bergantian",
        "pelatihan bergilir"
      ]
    },
    {
      "id": "071d6339-c7d9-463f-88b6-6b11c3621d60",
      "word": "Mind-muscle connection",
      "synonyms": [
        "Neuromuscular control",
        "conscious movement"
      ],
      "definition": "The ability to focus on muscle engagement during exercise",
      "userGuesses": [],
      "status": "hidden",
      "meaning": "Meaning not found.",
      "phonetics": {
        "us": "/.../",
        "uk": "/.../"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "Usage of Mind-muscle connection is important."
        },
        {
          "type": "Complex",
          "text": "Because Mind-muscle connection matters, we should study it."
        },
        {
          "type": "Compound",
          "text": "The word is Mind-muscle connection, and it is useful."
        },
        {
          "type": "Compound-Complex",
          "text": "If we use Mind-muscle connection correctly, we succeed, so let's try."
        }
      ]
    }
  ],
  "createdAt": 1769720179456
}