{
  "id": "ffe301bc-2f0c-419d-a9e8-4a06a9d210e6",
  "name": "ENVIRONMENT",
  "items": [
    {
      "id": "c98a0a62-459c-45eb-82c9-ffacae7014b1",
      "word": "Ecosystem",
      "synonyms": [
        "Habitat",
        "biome"
      ],
      "definition": "An ecosystem is a community of living and non-living things, such as plants, animals, and microorganisms, interacting with each other in a specific environment.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Sistem ekosistem",
      "phonetics": {
        "us": "/iˈkɒsɪstəm/",
        "uk": "/ɪˈkɒsɪstəm/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The destruction of natural ecosystems has severe consequences for the planet.",
          "translation": "Dampak negatif dari pembalagan sistem ekosistem alami sangat parah bagi Bumi."
        },
        {
          "type": "Complex",
          "text": "While the introduction of non-native species can have both positive and negative impacts on an ecosystem, it is generally considered a threat to biodiversity.",
          "translation": "Meskipun pengenalan spesies bukan asli dapat memiliki keduanya dampak positif dan negatif pada sistem ekosistem, namun secara umum dianggap sebagai ancaman terhadap keanekaragaman hayati."
        },
        {
          "type": "Compound",
          "text": "Ecosystems can be fragile and easily disrupted by human activities, such as pollution and deforestation.",
          "translation": "Sistem ekosistem dapat sangat rapuh dan mudah terganggu oleh kegiatan manusia, seperti pencemaran dan deforestasi."
        },
        {
          "type": "Compound-Complex",
          "text": "Furthermore, the loss of biodiversity in ecosystems can have a ripple effect on the entire food chain, leading to unforeseen consequences and potentially destabilizing entire ecosystems.",
          "translation": "Selain itu, kehilangan keanekaragaman hayati dalam sistem ekosistem dapat memiliki efek domino pada rantai makanan keseluruhan, menyebabkan konsekuensi yang tidak terduga dan potensial mengganggu sistem ekosistem secara keseluruhan."
        }
      ],
      "synonymMeanings": [
        "sistem alam",
        "komunitas lingkungan",
        "lingkungan hidup"
      ]
    },
    {
      "id": "363e996a-bd46-43d7-9bd4-550a537bc12c",
      "word": "Biodiversity",
      "synonyms": [
        "Species richness",
        "ecological diversity"
      ],
      "definition": "The variety of different plants, animals, and microorganisms that live in an ecosystem, and the genetic diversity within each species.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Keanekaragaman hayati",
      "phonetics": {
        "us": "/baɪəˈdɪvərʃɪti/",
        "uk": "/baɪəˈdɪvərˌsɪti/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The destruction of rainforests has led to a significant loss of biodiversity.",
          "translation": "Penghancuran hutan hujan telah menyebabkan kerugian besar akan keanekaragaman hayati."
        },
        {
          "type": "Complex",
          "text": "Although climate change is a major threat to biodiversity, conservation efforts have been made to protect endangered species.",
          "translation": "Meskipun perubahan iklim merupakan ancaman besar terhadap keanekaragaman hayati, upaya konservasi telah dilakukan untuk melindungi spesies yang terancam punah."
        },
        {
          "type": "Compound",
          "text": "Deforestation and pollution are two major causes of biodiversity loss, and it is essential to address these issues to prevent further damage.",
          "translation": "Penghancuran hutan dan polusi merupakan dua penyebab utama kehilangan keanekaragaman hayati, dan sangat penting untuk menangani masalah-masalah ini untuk mencegah kerusakan lebih lanjut."
        },
        {
          "type": "Compound-Complex",
          "text": "While the preservation of biodiversity is crucial for maintaining ecosystem balance, it is also important to acknowledge the impact of human activities on the environment.",
          "translation": "Meskipun pelestarian keanekaragaman hayati sangat penting untuk menjaga keseimbangan ekosistem, juga penting untuk mengakui dampak aktivitas manusia terhadap lingkungan."
        }
      ],
      "synonymMeanings": [
        "keanekaragaman spesies",
        "keragaman hayati",
        "kehilangan spesies",
        "perubahan spesies"
      ]
    },
    {
      "id": "903133e9-207a-4be8-ba5f-eaa81fe8218e",
      "word": "Climate change",
      "synonyms": [
        "Global warming",
        "environmental change"
      ],
      "definition": "A change in the Earth's climate, which is the average weather pattern in a particular region over a long period of time.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Perubahan iklim global",
      "phonetics": {
        "us": "/ˈklaɪmɪt ˈtʃeɪndʒ/",
        "uk": "/ˈklaɪmɪt ˈtʃeɪndʒ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing levels of carbon dioxide in the atmosphere are contributing to climate change.",
          "translation": "Kadar karbon dioksida di atmosfer meningkat dan menyebabkan perubahan iklim."
        },
        {
          "type": "Complex",
          "text": "Because of climate change, many countries are experiencing more frequent and severe natural disasters such as droughts and floods.",
          "translation": "Perubahan iklim menyebabkan banyak negara mengalami bencana alam lebih sering dan parah seperti kekeringan dan banjir."
        },
        {
          "type": "Compound",
          "text": "Climate change is a serious issue that requires immediate attention, and it is caused by human activities such as burning fossil fuels and deforestation.",
          "translation": "Perubahan iklim adalah masalah serius yang memerlukan perhatian mendesak, dan disebabkan oleh aktivitas manusia seperti pembakaran bahan bakar fosil dan deforestasi."
        },
        {
          "type": "Compound-Complex",
          "text": "Climate change is a complex issue that involves many factors, including rising global temperatures, melting polar ice caps, and changes in weather patterns, which are all interconnected and have significant impacts on ecosystems and human societies.",
          "translation": "Perubahan iklim adalah masalah kompleks yang melibatkan banyak faktor, termasuk kenaikan suhu global, melelehnya es kutub, dan perubahan pola cuaca, yang semuanya saling terkait dan punya dampak signifikan pada ekosistem dan masyarakat manusia."
        }
      ],
      "synonymMeanings": [
        "Perubahan cuaca",
        "Degradasi lingkungan",
        "Kerusakan iklim",
        "Pengaruh lingkungan"
      ]
    },
    {
      "id": "42690f32-bcb5-49c2-ab6a-ce921804a06b",
      "word": "Global warming",
      "synonyms": [
        "Temperature rise",
        "climate crisis"
      ],
      "definition": "The gradual increase in the overall temperature of the Earth's atmosphere, primarily caused by human activities that release greenhouse gases, such as carbon dioxide and methane.",
      "userGuesses": [],
      "status": "discovered",
      "meaning": "Peningasan global",
      "phonetics": {
        "us": "/ɡloʊbəlˈwɔːrmɪŋ/",
        "uk": "/ˈɡloʊbəlˈwɔːmɪŋ/"
      },
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing levels of carbon dioxide in the atmosphere are causing global warming.",
          "translation": "Peningasan global disebabkan oleh peningkatan kadar karbon dioksida di atmosfer."
        },
        {
          "type": "Complex",
          "text": "Climate change, which is a result of global warming, has severe consequences for our planet.",
          "translation": "Perubahan iklim, yang merupakan akibat dari peningasan global, memiliki konsekuensi yang serius bagi planet kita."
        },
        {
          "type": "Compound",
          "text": "The effects of global warming are being felt across the world, from melting glaciers to rising sea levels.",
          "translation": "Dampak peningasan global dirasakan di seluruh dunia, dari melelehnya gletser hingga kenaikan permukaan laut."
        },
        {
          "type": "Compound-Complex",
          "text": "While some countries are taking steps to reduce their carbon footprint, others are still contributing to global warming by relying heavily on fossil fuels.",
          "translation": "Meskipun beberapa negara telah mengambil langkah untuk mengurangi jejak karbon mereka, lainnya masih berkontribusi pada peningasan global dengan bergantung pada bahan bakar fosil."
        }
      ],
      "synonymMeanings": [
        "Panasan global",
        "Perubahan iklim",
        "Peningkatan suhu"
      ]
    },
    {
      "id": "38ce423c-16c1-46f1-8c6c-11377dfd0312",
      "word": "Deforestation",
      "synonyms": [
        "Logging",
        "forest",
        "degradation"
      ],
      "definition": "The act of cutting down and clearing a large area of trees, often as a result of human activities such as farming or urban development.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Deforestation has severe consequences for the environment, including loss of biodiversity and soil erosion.",
          "translation": "Hutan ditebang memiliki dampak serius bagi lingkungan, termasuk hilangnya keragaman hayati dan erosi tanah."
        },
        {
          "type": "Complex",
          "text": "While some argue that deforestation is necessary for economic growth, others claim that the long-term costs outweigh the benefits.",
          "translation": "Meskipun ada yang berpendapat bahwa hutan ditebang diperlukan untuk pertumbuhan ekonomi, namun ada juga yang mengklaim bahwa biaya jangka panjang melebihi keuntungan."
        },
        {
          "type": "Compound",
          "text": "Deforestation and climate change are two of the most pressing environmental issues facing the world today, causing widespread devastation and loss of ecosystems.",
          "translation": "Hutan ditebang dan perubahan iklim adalah dua masalah lingkungan yang paling mendesak dihadapi dunia saat ini, menyebabkan kerusakan luas dan hilangnya ekosistem."
        },
        {
          "type": "Compound-Complex",
          "text": "However, efforts to combat deforestation and promote sustainable forest management have been hindered by lack of funding and inadequate policies, which has led to a decline in forest cover and increased greenhouse gas emissions.",
          "translation": "Namun, upaya untuk melawan hutan ditebang dan mendorong manajemen hutan yang berkelanjutan telah terhalang oleh kurangnya dana dan kebijakan yang tidak memadai, yang telah menyebabkan penurunan luas hutan dan peningkatan emisi gas rumah kaca."
        }
      ],
      "phonetics": {
        "us": "/dɛfɔːrɛʃən/",
        "uk": "/dɛfɔːrɛsʃən/"
      },
      "meaning": "Hutan ditebang",
      "synonymMeanings": [
        "pembalakan liar",
        "kerusakan hutan",
        "perusakan hutan"
      ]
    },
    {
      "id": "1b14d3dd-4661-4d0d-8308-7ddaf4f32de9",
      "word": "Reforestation",
      "synonyms": [
        "Afforestation",
        "ecological",
        "restoration"
      ],
      "definition": "the act of planting trees in an area where they have been cut down",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Usage of Reforestation is important."
        },
        {
          "type": "Complex",
          "text": "Because Reforestation matters, we should study it."
        },
        {
          "type": "Compound",
          "text": "The word is Reforestation, and it is useful."
        },
        {
          "type": "Compound-Complex",
          "text": "If we use Reforestation correctly, we succeed, so let's try."
        }
      ],
      "phonetics": {
        "us": "/.../",
        "uk": "/.../"
      },
      "meaning": "Meaning not found."
    },
    {
      "id": "f6751a82-a77d-4a48-9865-c581ce49ded5",
      "word": "Afforestation",
      "synonyms": [
        "Tree planting",
        "reforestation"
      ],
      "definition": "The act of planting trees in an area where there were none before, especially to prevent soil erosion or to improve the environment.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Afforestation is a crucial step in combating climate change.",
          "translation": "Pembibitan hutan merupakan langkah penting dalam memerangi perubahan iklim."
        },
        {
          "type": "Complex",
          "text": "Although afforestation is a time-consuming process, the benefits it provides to the environment are undeniable.",
          "translation": "Meskipun proses pembibitan hutan memakan waktu lama, manfaat yang diberikannya pada lingkungan tidak dapat diragukan."
        },
        {
          "type": "Compound",
          "text": "Afforestation and reforestation are two distinct processes that are essential for preserving biodiversity.",
          "translation": "Pembibitan hutan dan pembibitan kembali hutan adalah dua proses yang berbeda, tetapi keduanya sangat penting untuk melestarikan keanekaragaman hayati."
        },
        {
          "type": "Compound-Complex",
          "text": "While afforestation is a vital component of sustainable development, its success depends on various factors, including the type of trees planted and the level of community involvement.",
          "translation": "Meskipun pembibitan hutan merupakan komponen penting dalam pengembangan berkelanjutan, kesuksesannya bergantung pada berbagai faktor, termasuk jenis pohon yang ditanam dan tingkat partisipasi masyarakat."
        }
      ],
      "phonetics": {
        "us": "/əfˈfɒstərɪʃən/",
        "uk": "/əfˈfɒstərɪzeɪʃən/"
      },
      "meaning": "Pembibitan hutan",
      "synonymMeanings": [
        "Reforestation",
        "Deforestation prevention",
        "Tree planting",
        "Environmental restoration"
      ]
    },
    {
      "id": "9c9b3ffd-6a02-4c6f-a70f-da86e46ce1d1",
      "word": "Sustainability",
      "synonyms": [
        "Eco-friendliness",
        "conservation"
      ],
      "definition": "The ability to be maintained at a certain level or standard without causing harm to the environment.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The new government is committed to promoting sustainability in all aspects of life.",
          "translation": "Pemerintahan baru tersebut berkomitmen untuk mempromosikan keberlanjutan dalam segala aspek kehidupan."
        },
        {
          "type": "Complex",
          "text": "Sustainability has become a major concern for many countries, which are struggling to maintain a balance between economic growth and environmental protection.",
          "translation": "Keberlanjutan telah menjadi masalah utama bagi banyak negara yang berjuang untuk menjaga keseimbangan antara pertumbuhan ekonomi dan perlindungan lingkungan."
        },
        {
          "type": "Compound",
          "text": "Sustainability is essential for the well-being of future generations, and it can be achieved through the implementation of sustainable practices.",
          "translation": "Keberlanjutan sangat penting untuk kesejahteraan generasi masa depan, dan dapat dicapai melalui implementasi praktek-praktek berkelanjutan."
        },
        {
          "type": "Compound-Complex",
          "text": "However, the pursuit of sustainability is often hindered by the lack of awareness among the general public, which can be addressed through education and public policy.",
          "translation": "Namun, pengusaha keberlanjutan seringkali terhalang oleh kurangnya kesadaran di kalangan masyarakat umum, yang dapat diatasi melalui pendidikan dan kebijakan publik."
        }
      ],
      "phonetics": {
        "us": "/ˌsʌsˈteɪnəbɪlɪti/",
        "uk": "/ˌsʌsˈteɪnəbɪlɪtɪ/"
      },
      "meaning": "Kemampuan untuk dipertahankan pada tingkat atau standar tertentu tanpa menyebabkan kerusakan lingkungan.",
      "synonymMeanings": [
        "Kemampuan berkelanjutan",
        "Kapasitas lingkungan",
        "Kelestarian",
        "Kekelanjutan"
      ]
    },
    {
      "id": "3aec6457-05db-464d-86b6-dcc61135aaf3",
      "word": "Renewable energy",
      "synonyms": [
        "Green energy",
        "sustainable power"
      ],
      "definition": "Energy that is constantly being renewed and cannot be used up.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Renewable energy is a vital component of a sustainable future.",
          "translation": "Energi yang dapat diperbarui adalah komponen vital masa depan yang berkelanjutan."
        },
        {
          "type": "Complex",
          "text": "The increasing demand for energy has led to the development of renewable energy sources.",
          "translation": "Tingginya permintaan energi telah menyebabkan perkembangan sumber-sumber energi yang dapat diperbarui."
        },
        {
          "type": "Compound",
          "text": "Renewable energy and sustainable development are closely linked, and one cannot exist without the other.",
          "translation": "Energi yang dapat diperbarui dan pengembangan berkelanjutan sangat terkait, dan tidak dapat hidup tanpanya."
        },
        {
          "type": "Compound-Complex",
          "text": "Not only do renewable energy sources reduce our reliance on fossil fuels, but they also provide numerous economic and environmental benefits.",
          "translation": "Bukan saja sumber energi yang dapat diperbarui mengurangi ketergantungan kita pada bahan bakar fosil, tetapi juga memberikan manfaat ekonomi dan lingkungan yang banyak."
        }
      ],
      "phonetics": {
        "us": "/rɛˈnuːəbəl ˈɛnədʒi/",
        "uk": "/rɛˈnuːəbəl ˈɛnədʒi/"
      },
      "meaning": "Energi yang dapat diperbarui secara terus-menerus dan tidak dapat dimanfaatkan habis.",
      "synonymMeanings": [
        "Energi berkelanjutan",
        "Energi terbarukan",
        "Energi hijau"
      ]
    },
    {
      "id": "9c45bf32-d927-4b4c-87bc-6b90b2373cb6",
      "word": "Non-renewable energy",
      "synonyms": [
        "Fossil fuels",
        "exhaustible",
        "energy"
      ],
      "definition": "Forms of energy that cannot be renewed or replenished once they have been used.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing demand for non-renewable energy is a major environmental concern.",
          "translation": "Tuntutan yang semakin meningkat atas energi tak terbarukan menimbulkan kekhawatiran lingkungan yang besar."
        },
        {
          "type": "Complex",
          "text": "While non-renewable energy sources, such as coal and oil, are still widely used today, they are expected to decline in the future.",
          "translation": "Meskipun sumber energi tak terbarukan seperti batu bara dan minyak masih digunakan secara luas saat ini, namun diharapkan akan mengalami penurunan di masa depan."
        },
        {
          "type": "Compound",
          "text": "Non-renewable energy is a limited resource, and climate change is one of the consequences of its intensive use.",
          "translation": "Energi tak terbarukan merupakan sumber daya yang terbatas, dan perubahan iklim merupakan salah satu dampak dari penggunaannya yang intensif."
        },
        {
          "type": "Compound-Complex",
          "text": "The depletion of non-renewable energy resources is a significant threat to the environment, and it is essential to invest in renewable energy sources to mitigate this threat.",
          "translation": "Pengurangan sumber daya energi tak terbarukan merupakan ancaman besar bagi lingkungan, dan sangat penting untuk berinvestasi dalam sumber energi terbarukan untuk mengurangi ancaman ini."
        }
      ],
      "phonetics": {
        "us": "/nɑn rɪˈnuːəbl ˈɛnədʒi/",
        "uk": "/nɒn rɪˈnuːəbəl ˈɛnədʒi/"
      },
      "meaning": "Energi tak terbarukan",
      "synonymMeanings": [
        "sumber energi tak dapat diperbarui",
        "energi fosil"
      ]
    },
    {
      "id": "b67f98ab-8a9c-4373-9d05-9b6adc300575",
      "word": "Greenhouse effect",
      "synonyms": [
        "Atmospheric warming",
        "climate impact"
      ],
      "definition": "The process by which certain gases in the Earth's atmosphere trap heat from the sun, leading to a rise in global temperatures.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing levels of carbon dioxide in the atmosphere contribute to the greenhouse effect.",
          "translation": "Peningkatan kadar karbon dioksida di atmosfer memperbesar efek rumah kaca."
        },
        {
          "type": "Complex",
          "text": "However, the government has initiated various programs to reduce the impact of the greenhouse effect on the environment.",
          "translation": "Namun, pemerintah telah meluncurkan berbagai program untuk mengurangi dampak efek rumah kaca terhadap lingkungan."
        },
        {
          "type": "Compound",
          "text": "The greenhouse effect is a natural phenomenon, but human activities have accelerated its impact.",
          "translation": "Efek rumah kaca adalah fenomena alami, namun kegiatan manusia telah mempercepat dampaknya."
        },
        {
          "type": "Compound-Complex",
          "text": "While the greenhouse effect is a significant contributor to global warming, it is essential to note that other factors also play a crucial role in this process.",
          "translation": "Meskipun efek rumah kaca merupakan kontributor signifikan pemanasan global, perlu diingat bahwa faktor lain juga berperan penting dalam proses ini."
        }
      ],
      "phonetics": {
        "us": "/ˈɡriːnhaʊs ɛfɛkt/",
        "uk": "/ˈɡriːnhaʊs ɛfɛkt/"
      },
      "meaning": "Efek rumah kaca",
      "synonymMeanings": [
        "Efek isolasi panas",
        "Pemanasan global",
        "Efek gas buang"
      ]
    },
    {
      "id": "ff24972f-9186-4683-8799-008d53da38cf",
      "word": "Carbon footprint",
      "synonyms": [
        "Environmental impact",
        "carbon emissions"
      ],
      "definition": "The amount of carbon dioxide and other greenhouse gases that are emitted into the atmosphere as a result of human activities.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing carbon footprint of our daily lives poses a significant threat to the environment.",
          "translation": "Jejak karbon kehidupan sehari-hari yang semakin meningkat menjadi ancaman besar bagi lingkungan."
        },
        {
          "type": "Complex",
          "text": "Although governments have made efforts to reduce their carbon footprint, the pace of change has been slow.",
          "translation": "Meskipun pemerintah telah berusaha mengurangi jejak karbon mereka, kecepatan perubahan masih lambat."
        },
        {
          "type": "Compound",
          "text": "The use of public transport and renewable energy can significantly reduce our carbon footprint, but it requires a change in our lifestyle.",
          "translation": "Penggunaan transportasi umum dan energi terbarukan dapat menurunkan jejak karbon kita secara signifikan, tetapi itu memerlukan perubahan gaya hidup kita."
        },
        {
          "type": "Compound-Complex",
          "text": "However, despite the availability of alternative modes of transportation, the increasing carbon footprint of our daily lives poses a significant threat to the environment, and it is essential that we take immediate action to reduce our carbon emissions.",
          "translation": "Namun, walaupun adanya alternatif moda transportasi, jejak karbon kehidupan sehari-hari yang semakin meningkat menjadi ancaman besar bagi lingkungan, dan penting bagi kita untuk mengambil tindakan segera untuk mengurangi emisi gas buang karbon kita."
        }
      ],
      "phonetics": {
        "us": "/ˈkɑrbən ˈfʊtprɪnt/",
        "uk": "/ˈkɑːrbən ˈfʊtprɪnt/"
      },
      "meaning": "Jejak karbon",
      "synonymMeanings": [
        "Impak lingkungan",
        "Emisi gas buang",
        "Penggunaan energi tidak terbarukan"
      ]
    },
    {
      "id": "d09ed5bc-bc19-48b6-89c9-ff2be62ac8a6",
      "word": "Carbon emissions",
      "synonyms": [
        "Greenhouse gas",
        "emissions",
        "pollutants"
      ],
      "definition": "The amount of carbon dioxide released into the atmosphere as a result of human activity.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing carbon emissions are causing severe climate change effects worldwide.",
          "translation": "Peningkatan emisi karbon memicu efek perubahan iklim yang parah di seluruh dunia."
        },
        {
          "type": "Complex",
          "text": "While some argue that carbon emissions are essential for economic growth, others believe that they are a major threat to the environment.",
          "translation": "Meskipun ada yang menyatakan bahwa emisi karbon sangat penting bagi pertumbuhan ekonomi, namun banyak pula yang percaya bahwa emisi karbon merupakan ancaman besar bagi lingkungan."
        },
        {
          "type": "Compound",
          "text": "The government has implemented policies to reduce carbon emissions and promote renewable energy sources, but they are not enough to meet the country's growing energy demands.",
          "translation": "Pemerintah telah menerapkan kebijakan untuk mengurangi emisi karbon dan mendorong pengembangan sumber energi terbarukan, namun belum cukup untuk memenuhi meningkatnya kebutuhan energi negara."
        },
        {
          "type": "Compound-Complex",
          "text": "Although the use of electric vehicles can help reduce carbon emissions, it is still a relatively expensive option for many people, and only those with high disposable incomes can afford to buy them.",
          "translation": "Meskipun penggunaan kendaraan listrik dapat membantu mengurangi emisi karbon, namun masih merupakan pilihan yang relatif mahal bagi banyak orang, dan hanya mereka yang memiliki penghasilan yang cukup tinggi yang dapat membelinya."
        }
      ],
      "phonetics": {
        "us": "/ˈkɑrbɑn ɪˈmɪʃənz/",
        "uk": "/ˈkɑːrbɑn ɪˈmɪʃənz/"
      },
      "meaning": "Emisi karbon",
      "synonymMeanings": [
        "Emisi gas rumah kaca",
        "Pengeluaran karbon dioksida",
        "Pencemaran udara",
        "Penggunaan bahan bakar fosil"
      ]
    },
    {
      "id": "a570a321-dd2c-4130-9b12-5e283a7e6065",
      "word": "Carbon neutrality",
      "synonyms": [
        "Net-zero emissions",
        "climate neutrality"
      ],
      "definition": "The state of not producing any greenhouse gas emissions, or offsetting emissions by investing in projects that reduce greenhouse gas emissions, such as wind farms or tree planting.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The government aims to achieve carbon neutrality by 2050.",
          "translation": "Pemerintah berupaya mencapai keanekaragaman karbon pada tahun 2050."
        },
        {
          "type": "Complex",
          "text": "While many countries are making efforts to reduce their carbon emissions, achieving carbon neutrality remains a significant challenge.",
          "translation": "Meskipun banyak negara telah berupaya mengurangi emisi karbon mereka, mencapai keanekaragaman karbon tetaplah merupakan tantangan besar."
        },
        {
          "type": "Compound",
          "text": "The benefits of achieving carbon neutrality include reduced greenhouse gas emissions and improved air quality.",
          "translation": "Manfaat dari mencapai keanekaragaman karbon meliputi pengurangan emisi gas rumah kaca dan meningkatnya kualitas udara."
        },
        {
          "type": "Compound-Complex",
          "text": "The transition to a carbon-neutral economy requires significant investments in renewable energy sources and sustainable infrastructure, while also addressing issues related to energy poverty and inequality.",
          "translation": "Transisi ke ekonomi berkeanekaragaman karbon memerlukan investasi besar-besaran dalam sumber energi terbarukan dan infrastruktur yang berkelanjutan, sambil juga menangani masalah terkait kemiskinan energi dan ketidaksetaraan."
        }
      ],
      "phonetics": {
        "us": "/kɑrbən nɪˈtroʊsɪti/",
        "uk": "/kɑrbən nɪˈtroʊsɪtɪ/"
      },
      "meaning": "Keanekaragaman karbon",
      "synonymMeanings": [
        "Keanekaragaman gas rumah kaca",
        "Mengurangi emisi karbon",
        "Menggunakan energi terbarukan"
      ]
    },
    {
      "id": "83c37a22-57e5-415d-892b-0b7d12a441ca",
      "word": "Pollution",
      "synonyms": [
        "Contamination",
        "degradation"
      ],
      "definition": "The presence of harmful substances or products in the environment, especially air and water.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Pollution is a major concern in many developing countries.",
          "translation": "Kerusakan lingkungan menjadi masalah besar di banyak negara berkembang."
        },
        {
          "type": "Complex",
          "text": "The increasing amount of pollution in our oceans is causing a decline in marine life.",
          "translation": "Kenaikan kadar polusi di laut kami menyebabkan penurunan jumlah kehidupan laut."
        },
        {
          "type": "Compound",
          "text": "Pollution and climate change are two of the main reasons for the loss of biodiversity.",
          "translation": "Kerusakan lingkungan dan perubahan iklim merupakan dua alasan utama hilangnya keanekaragaman hayati."
        },
        {
          "type": "Compound-Complex",
          "text": "If we do not take immediate action to reduce pollution, it will have serious consequences for our health and the environment.",
          "translation": "Jika kita tidak mengambil tindakan segera untuk mengurangi polusi, maka akan akan membawa konsekuensi serius bagi kesehatan dan lingkungan kami."
        }
      ],
      "phonetics": {
        "us": "/ˈpɑːlʊˌteɪʃən/",
        "uk": "/ˈpɒlʊteɪʃən/"
      },
      "meaning": "Kerusakan lingkungan karena adanya zat-zat berbahaya",
      "synonymMeanings": [
        "Kerusakan lingkungan",
        "Pencemaran",
        "Kontaminasi"
      ]
    },
    {
      "id": "a5f9ce6a-2962-429b-884c-a3f30aaa531b",
      "word": "Air pollution",
      "synonyms": [
        "Smog",
        "atmospheric",
        "contamination"
      ],
      "definition": "The presence of pollutants in the air, which can cause harm to the environment and human health.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Air pollution is a major environmental concern in many cities around the world.",
          "translation": "Kebocoran udara merupakan masalah lingkungan yang signifikan di banyak kota di seluruh dunia."
        },
        {
          "type": "Complex",
          "text": "While air pollution is a significant problem in urban areas, its impact on human health is often underestimated.",
          "translation": "Meskipun kebocoran udara merupakan masalah signifikan di daerah perkotaan, dampaknya terhadap kesehatan manusia sering kali diabaikan."
        },
        {
          "type": "Compound",
          "text": "Air pollution is caused by both human activities and natural factors, such as volcanic eruptions.",
          "translation": "Kebocoran udara disebabkan oleh aktivitas manusia dan faktor alam, seperti erupsi gunung berapi."
        },
        {
          "type": "Compound-Complex",
          "text": "While it is true that air pollution is a significant problem in many countries, the measures taken by governments to address this issue have been inadequate, resulting in significant health consequences for citizens.",
          "translation": "Meskipun benar bahwa kebocoran udara merupakan masalah signifikan di banyak negara, langkah-langkah yang diambil oleh pemerintah untuk mengatasi masalah ini tidak cukup, sehingga menyebabkan konsekuensi kesehatan yang signifikan bagi warga negara."
        }
      ],
      "phonetics": {
        "us": "/ˌɛr ˈpəʊlʊʃən/",
        "uk": "/ˌɛər ˈpɒlʊʃən/"
      },
      "meaning": "Kebocoran udara",
      "synonymMeanings": [
        "Pencemaran udara",
        "Kerusakan lingkungan",
        "Polusi atmosfer"
      ]
    },
    {
      "id": "e770c7d7-2b6c-4ed2-abd7-5141443a510b",
      "word": "Water pollution",
      "synonyms": [
        "Aquatic contamination",
        "toxic discharge"
      ],
      "definition": "The presence of harmful substances in water, making it unfit for drinking, recreation, or other uses.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Water pollution is a serious issue in many parts of the world.",
          "translation": "Kekotoran air merupakan masalah serius di banyak bagian dunia."
        },
        {
          "type": "Complex",
          "text": "Although the government has implemented stricter regulations, water pollution still remains a major concern.",
          "translation": "Meskipun pemerintah telah menerapkan regulasi yang lebih ketat, kekotoran air masih menjadi masalah utama."
        },
        {
          "type": "Compound",
          "text": "Water pollution affects not only the environment but also the health of humans and animals.",
          "translation": "Kekotoran air tidak hanya mempengaruhi lingkungan, tetapi juga kesehatan manusia dan hewan."
        },
        {
          "type": "Compound-Complex",
          "text": "However, the problem of water pollution can be solved if we work together to reduce our reliance on single-use plastics and implement sustainable waste management systems.",
          "translation": "Namun, masalah kekotoran air dapat diatasi jika kita bekerja sama untuk mengurangi ketergantungan pada plastik sekali pakai dan menerapkan sistem pengelolaan limbah yang berkelanjutan."
        }
      ],
      "phonetics": {
        "us": "/ˈwɔtər pɑːlʊˈteɪʃən/",
        "uk": "/ˈwɔtər pɒlʊˈteɪʃən/"
      },
      "meaning": "Kekotoran air",
      "synonymMeanings": [
        "Kerusakan air",
        "Pencemaran air laut",
        "Kekotoran perairan"
      ]
    },
    {
      "id": "64769fae-812d-463d-a7d2-c9d52d7fd7c7",
      "word": "Soil erosion",
      "synonyms": [
        "Land degradation",
        "deforestation impact"
      ],
      "definition": "The process of soil being worn away by natural forces such as wind or water.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The effects of soil erosion can be devastating to local ecosystems.",
          "translation": "Erosi tanah dapat sangat merusak ekosistem setempat."
        },
        {
          "type": "Complex",
          "text": "While soil erosion is a natural process, human activities can exacerbate the problem.",
          "translation": "Meskipun erosi tanah merupakan proses alami, kegiatan manusia dapat memperburuk masalah ini."
        },
        {
          "type": "Compound",
          "text": "Soil erosion and deforestation are two major threats to the environment.",
          "translation": "Erosi tanah dan deforestasi adalah dua ancaman besar terhadap lingkungan."
        },
        {
          "type": "Compound-Complex",
          "text": "In areas prone to soil erosion, the use of terracing can help to mitigate the effects, but only if implemented correctly.",
          "translation": "Di daerah yang rentan terhadap erosi tanah, penggunaan sistem lereng dapat membantu mengurangi dampaknya, asalkan diterapkan dengan benar."
        }
      ],
      "phonetics": {
        "us": "/ˈsoɪl ɪˈroʊʒən/",
        "uk": "/ˈsoʊl ɪˈroʊʒən/"
      },
      "meaning": "Erosi tanah",
      "synonymMeanings": [
        "Lapukan tanah",
        "Hancuran tanah"
      ]
    },
    {
      "id": "fe67614a-5f0e-44cd-8b27-494c9e4c8609",
      "word": "Desertification",
      "synonyms": [
        "Land degradation",
        "drought expansion"
      ],
      "definition": "The process of a region becoming increasingly arid and dry as a result of climate change, overgrazing, or other human activities.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Desertification is a major environmental concern in many parts of the world.",
          "translation": "Penggusuran hutan menjadi masalah lingkungan yang besar di berbagai wilayah di dunia."
        },
        {
          "type": "Complex",
          "text": "The increasing rate of desertification is largely due to human activities such as deforestation and overgrazing.",
          "translation": "Tingkat penggusuran hutan yang meningkat sebagian besar disebabkan oleh kegiatan manusia seperti penghutanan dan penggembalaan yang berlebihan."
        },
        {
          "type": "Compound",
          "text": "Desertification and climate change are two major challenges facing the world today, and urgent action is needed to address them.",
          "translation": "Penggusuran hutan dan perubahan iklim adalah dua tantangan besar yang dihadapi dunia saat ini, dan tindakan cepat diperlukan untuk mengatasi mereka."
        },
        {
          "type": "Compound-Complex",
          "text": "While desertification can have devastating consequences for local ecosystems, it also has a significant impact on global climate patterns, which can lead to more frequent and severe weather events.",
          "translation": "Meskipun penggusuran hutan dapat memiliki konsekuensi yang mematikan bagi ekosistem lokal, namun juga memiliki dampak yang signifikan pada pola iklim global, yang dapat menyebabkan peristiwa cuaca yang lebih sering dan parah."
        }
      ],
      "phonetics": {
        "us": "/dɪzərˌtɪˈfɪkəˈn/ ",
        "uk": "/dɪsəʳˌtɪˈfɪkəˈn/"
      },
      "meaning": "Penggusuran hutan dan pola penggunaan tanah yang tidak bertanggung jawab",
      "synonymMeanings": [
        "Penghutanan",
        "Penggembalaan yang berlebihan",
        "Pengrusakan lingkungan",
        "Penggusuran lahan"
      ]
    },
    {
      "id": "c064e831-5a69-490f-bdaa-50316cb9a199",
      "word": "Conservation",
      "synonyms": [
        "Preservation",
        "sustainability"
      ],
      "definition": "The act of saving or preserving something (such as the environment or a resource) from being wasted or destroyed.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The government has launched a conservation program to protect endangered species.",
          "translation": "Pemerintah telah meluncurkan program pengawetan untuk melindungi spesies yang terancam punah."
        },
        {
          "type": "Complex",
          "text": "The effects of climate change on the environment have led to an urgent need for conservation efforts.",
          "translation": "Dampak perubahan iklim terhadap lingkungan telah menyebabkan kebutuhan mendesak untuk meningkatkan upaya pengawetan."
        },
        {
          "type": "Compound",
          "text": "The city has implemented new laws to reduce pollution, as well as conservation efforts to protect its forests.",
          "translation": "Kota ini telah menerapkan hukum baru untuk mengurangi polusi, serta upaya pengawetan untuk melindungi hutan-hutannya."
        },
        {
          "type": "Compound-Complex",
          "text": "The lack of funding for conservation projects has hindered the efforts of local communities to protect their natural resources, but the government's recent initiatives have provided a glimmer of hope.",
          "translation": "Keterbatasan dana untuk proyek-proyek pengawetan telah menghambat usaha masyarakat lokal untuk melindungi sumber daya alam mereka, namun inisiatif pemerintah baru-baru ini telah menyediakan harapan yang sedikit."
        }
      ],
      "phonetics": {
        "us": "/kənˈsɜrvʌʃən/",
        "uk": "/kɒnˈsɜːvəʃən/"
      },
      "meaning": "Pengawetan",
      "synonymMeanings": [
        "Pengelolaan lingkungan",
        "Pengamanan sumber daya",
        "Hutan lindung"
      ]
    },
    {
      "id": "cddc6965-6bf1-4f12-8fa5-96b8b02bea0c",
      "word": "Overfishing",
      "synonyms": [
        "Marine depletion",
        "unsustainable fishing"
      ],
      "definition": "The act of catching too many fish from a particular area, leading to a reduction in fish populations and potentially threatening the sustainability of the fishery.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Overfishing is a major concern in many parts of the world.",
          "translation": "Perburuan ikan secara berlebihan merupakan masalah besar di banyak tempat di dunia."
        },
        {
          "type": "Complex",
          "text": "The lack of effective regulations has led to overfishing, resulting in the decline of many fish species.",
          "translation": "Keterbatasan regulasi yang efektif telah menyebabkan perburuan ikan secara berlebihan, sehingga menurunkan banyak spesies ikan."
        },
        {
          "type": "Compound",
          "text": "Overfishing and pollution are two major threats to the health of our oceans.",
          "translation": "Perburuan ikan secara berlebihan dan polusi adalah dua ancaman besar bagi kesehatan laut kita."
        },
        {
          "type": "Compound-Complex",
          "text": "While some countries have implemented measures to prevent overfishing, others still lack effective regulations, leading to further depletion of fish populations.",
          "translation": "Meskipun beberapa negara telah menerapkan langkah-langkah untuk mencegah perburuan ikan secara berlebihan, beberapa negara lain masih kurang regulasi yang efektif, sehingga menyebabkan penurunan populasi ikan yang lebih parah."
        }
      ],
      "phonetics": {
        "us": "/ˌoʊvərˈfɪʃɪŋ/",
        "uk": "/ˌoʊvərˈfɪʃɪŋ/"
      },
      "meaning": "Perburuan ikan secara berlebihan",
      "synonymMeanings": [
        "perburuan berlebihan",
        "penangkapan berlebihan",
        "eksploitasi kelebihan",
        "penyebab kelebihan"
      ]
    },
    {
      "id": "a6408784-9c93-40e9-a66f-fe1c272471f2",
      "word": "Endangered species",
      "synonyms": [
        "Threatened wildlife",
        "vulnerable species"
      ],
      "definition": "A species of animal or plant that is in danger of becoming extinct because of its low population or threats such as habitat destruction.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The rapid growth of the human population has led to the decline of endangered species worldwide.",
          "translation": "Pertumbuhan penduduk manusia yang cepat telah menyebabkan penurunan spesies terancam punah di seluruh dunia."
        },
        {
          "type": "Complex",
          "text": "While some people argue that conservation efforts are essential to protect endangered species, others believe that these efforts are often ineffective.",
          "translation": "Meskipun ada yang berpendapat bahwa upaya pelestarian sangat penting untuk melindungi spesies terancam punah, ada juga yang berpikir bahwa upaya tersebut sering kali tidak efektif."
        },
        {
          "type": "Compound",
          "text": "The destruction of habitats and the over-exploitation of natural resources have been major threats to endangered species, and governments must take action to prevent these problems.",
          "translation": "Destruction lingkungan hidup dan eksploitasi sumber daya alam yang berlebihan telah menjadi ancaman besar bagi spesies terancam punah, dan pemerintah harus mengambil tindakan untuk mencegah masalah tersebut."
        },
        {
          "type": "Compound-Complex",
          "text": "Not only have endangered species been affected by climate change, but also by human activities such as deforestation and pollution, which have led to a significant decline in their populations.",
          "translation": "Bukan hanya spesies terancam punah yang terpengaruh oleh perubahan iklim, tetapi juga oleh kegiatan manusia seperti deforestasi dan polusi, yang telah menyebabkan penurunan signifikan dalam populasi mereka."
        }
      ],
      "phonetics": {
        "us": "/ɛnˈdɑːndʒərdʒd spɪˈsiːz/",
        "uk": "/ɛndˈændʒərdʒd spɪˈsiːz/"
      },
      "meaning": "Spesies yang terancam punah",
      "synonymMeanings": [
        "Spesies langka",
        "Hewan yang terancam punah",
        "Tumbuhan yang terancam punah",
        "Spesies yang berada di ambang punah"
      ]
    },
    {
      "id": "fea6fb4f-138a-4228-b766-46635cbae2ef",
      "word": "Extinction",
      "synonyms": [
        "Species loss",
        "annihilation"
      ],
      "definition": "The state of being completely destroyed or eliminated, especially of a species of plant or animal.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The extinction of the dinosaurs has been a topic of interest for many scientists.",
          "translation": "Punahnya dinosaurus telah menjadi topik minat banyak ilmuwan."
        },
        {
          "type": "Complex",
          "text": "Climate change is likely to lead to the extinction of many marine species if it continues to worsen.",
          "translation": "Perubahan iklim kemungkinan besar akan menyebabkan punahnya banyak spesies laut jika tidak terkontrol."
        },
        {
          "type": "Compound",
          "text": "The extinction of many species is a result of human activities such as deforestation and pollution.",
          "translation": "Punahnya banyak spesies disebabkan oleh aktivitas manusia seperti deforestasi dan polusi."
        },
        {
          "type": "Compound-Complex",
          "text": "The extinction of species is a major concern for conservationists, as it can have severe consequences for the ecosystem and human well-being.",
          "translation": "Punahnya spesies adalah kekhawatiran utama bagi pelestari lingkungan, karena dapat menyebabkan konsekuensi serius bagi ekosistem dan kesejahteraan manusia."
        }
      ],
      "phonetics": {
        "us": "/ɛksˈtɪŋkʃən/",
        "uk": "/ɛkstɪŋkˈʃɒn/"
      },
      "meaning": "Punahnya suatu spesies atau organisme.",
      "synonymMeanings": [
        "Punahnya",
        "Peresapan",
        "Hilangnya"
      ]
    },
    {
      "id": "faa577eb-beb1-4835-976a-3b47a4d027cc",
      "word": "Habitat destruction",
      "synonyms": [
        "Environmental",
        "degradation",
        "deforestation"
      ],
      "definition": "The state of being destroyed or ruined, especially of natural environments or ecosystems.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The destruction of habitats has led to the extinction of many species.",
          "translation": "Penghancuran habitat telah menyebabkan kepunahan banyak spesies."
        },
        {
          "type": "Complex",
          "text": "The rapid growth of cities is a major contributor to habitat destruction, which has severe consequences for the environment.",
          "translation": "Pertumbuhan kota yang cepat adalah penyumbang utama penghancuran habitat, yang memiliki konsekuensi serius bagi lingkungan."
        },
        {
          "type": "Compound",
          "text": "Habitat destruction and pollution are two major environmental problems that need to be addressed.",
          "translation": "Penghancuran habitat dan pencemaran adalah dua masalah lingkungan utama yang perlu diatasi."
        },
        {
          "type": "Compound-Complex",
          "text": "The government's lack of action on habitat destruction has led to a significant decline in biodiversity, resulting in the loss of many ecosystem services, including clean water and air.",
          "translation": "Kurangnya tindakan pemerintah terhadap penghancuran habitat telah menyebabkan penurunan signifikan keanekaragaman hayati, yang mengakibatkan hilangnya banyak jasa ekosistem, termasuk air dan udara bersih."
        }
      ],
      "phonetics": {
        "us": "/hæbɪtət dɪstrʌkˈʃən/",
        "uk": "/hæbɪtət dɪstrʌkˈʃən/"
      },
      "meaning": "Penghancuran habitat",
      "synonymMeanings": [
        "Kerusakan lingkungan",
        "Pengrusakan alam",
        "Hancurnya ekosistem"
      ]
    },
    {
      "id": "8c063859-c513-402b-b494-3876ab01d0cf",
      "word": "Ozone layer depletion",
      "synonyms": [
        "Atmospheric damage",
        "UV",
        "exposure"
      ],
      "definition": "The destruction of the ozone layer in the Earth's atmosphere, which is caused by the release of pollutants such as chlorine and bromine.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The depletion of the ozone layer is a major environmental concern.",
          "translation": "Penghancuran lapisan ozon merupakan masalah lingkungan utama."
        },
        {
          "type": "Complex",
          "text": "If we do not take immediate action to reduce pollutants, the depletion of the ozone layer will continue to worsen.",
          "translation": "Jika kami tidak mengambil tindakan segera untuk mengurangi zat pencemar, penghancuran lapisan ozon akan terus memburuk."
        },
        {
          "type": "Compound",
          "text": "The depletion of the ozone layer is causing more frequent and intense UV radiation, which is affecting human health and ecosystems.",
          "translation": "Penghancuran lapisan ozon menyebabkan radiasi UV yang lebih sering dan intens, yang mempengaruhi kesehatan manusia dan lingkungan."
        },
        {
          "type": "Compound-Complex",
          "Text": "However, the depletion of the ozone layer is not the only environmental issue that we need to address, as climate change and pollution are also major concerns.",
          "translation": "Namun, penghancuran lapisan ozon bukanlah satu-satunya masalah lingkungan yang harus kami tangani, karena perubahan iklim dan polusi juga merupakan masalah utama."
        }
      ],
      "phonetics": {
        "us": "/oʊˈzaɪn laɪər dɪˈpliːʃən/",
        "uk": "/oʊˈzaɪn laɪər dɪˈpliːʃən/"
      },
      "meaning": "Penghancuran lapisan ozon atmosfer bumi yang disebabkan oleh pelepasan zat pencemar seperti klorin dan bromin.",
      "synonymMeanings": [
        "Penghancuran lapisan atmosfer",
        "Penghancuran lapisan protektif",
        "Kerusakan lapisan ozon"
      ]
    },
    {
      "id": "58ed499a-619f-4e74-bed2-30b2c67c46e5",
      "word": "Eco-friendly",
      "synonyms": [
        "Environmentally friendly",
        "sustainable"
      ],
      "definition": "Produced or designed to be environmentally friendly.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The company's eco-friendly practices have reduced pollution in the area.",
          "translation": "Praktik perusahaan ramah lingkungan telah mengurangi polusi di daerah tersebut."
        },
        {
          "type": "Complex",
          "text": "However, the cost of eco-friendly products is still relatively high, which may discourage consumers from buying them.",
          "translation": "Namun, biaya produk ramah lingkungan masih relatif tinggi, yang mungkin menghambat konsumen untuk membelinya."
        },
        {
          "type": "Compound",
          "text": "The government has introduced several policies to promote eco-friendly transportation, including incentives for electric car owners.",
          "translation": "Pemerintah telah mengenalkan beberapa kebijakan untuk mempromosikan transportasi ramah lingkungan, termasuk insentif bagi pemilik mobil listrik."
        },
        {
          "type": "Compound-Complex",
          "text": "While eco-friendly packaging has become increasingly popular, its effectiveness in reducing waste is still a topic of debate among environmentalists.",
          "translation": "Meskipun pengemasan ramah lingkungan telah menjadi semakin populer, ke efektifannya dalam mengurangi limbah masih menjadi topik perdebatan di kalangan lingkungan hidup."
        }
      ],
      "phonetics": {
        "us": "/ˌiːkoʊˈfrɛndli/",
        "uk": "/ˌiːkəʊˈfrendli/"
      },
      "meaning": "Ramah lingkungan",
      "synonymMeanings": [
        "Ramah lingkungan",
        "Lingkungan",
        "Hijau",
        "Peduli lingkungan"
      ]
    },
    {
      "id": "2bbd67e9-6a78-4116-9d7a-27e67cfba2ff",
      "word": "Biodegradable",
      "synonyms": [
        "Compostable",
        "organic"
      ],
      "definition": "Able to be broken down by living organisms and returned to the earth.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The use of biodegradable plastic bags can help reduce pollution.",
          "translation": "Penggunaan tas plastik yang dapat terurai dapat membantu mengurangi polusi."
        },
        {
          "type": "Complex",
          "text": "While biodegradable products are considered more environmentally friendly, they still require careful disposal.",
          "translation": "Meskipun produk yang dapat terurai dianggap lebih ramah lingkungan, mereka masih memerlukan penanganan sampah yang hati-hati."
        },
        {
          "type": "Compound",
          "text": "Biodegradable waste and recyclable materials should be disposed of separately.",
          "translation": "Sisa makanan yang dapat terurai dan bahan-bahan yang dapat didaur ulang harus dipisahkan dan dibuang dengan benar."
        },
        {
          "type": "Compound-Complex",
          "text": "If we use biodegradable products, we can reduce the amount of waste that ends up in landfills, but the production process often involves the use of non-eco-friendly materials.",
          "translation": "Jika kita menggunakan produk yang dapat terurai, kita dapat mengurangi jumlah sampah yang berakhir di tempat pembuangan akhir, namun proses produksi seringkali melibatkan penggunaan bahan-bahan yang tidak ramah lingkungan."
        }
      ],
      "phonetics": {
        "us": "/baɪəʊˌdiːˈɡrædʊbəl/",
        "uk": "/baɪoʊdɪˈɡrædʊbəl/"
      },
      "meaning": "Dapat terurai oleh organisme hidup dan kembali ke tanah",
      "synonymMeanings": [
        "Organik",
        "Dapat terurai secara alami",
        "Ramah lingkungan"
      ]
    },
    {
      "id": "e6193820-aca9-4cab-940c-bdef2c1105a6",
      "word": "Recycling",
      "synonyms": [
        "Waste management",
        "resource recovery"
      ],
      "definition": "The process of collecting and processing materials that would otherwise be thrown away so that they can be used again.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Recycling is essential for reducing waste and conserving natural resources.",
          "translation": "Pengumpulan kembali adalah penting untuk mengurangi limbah dan melestarikan sumber daya alam."
        },
        {
          "type": "Complex",
          "text": "While recycling can help reduce the amount of waste in landfills, it is not a substitute for reducing consumption.",
          "translation": "Meskipun pengumpulan kembali dapat membantu mengurangi jumlah limbah di tempat pembuangan, namun itu bukanlah pengganti untuk mengurangi konsumsi."
        },
        {
          "type": "Compound",
          "text": "Recycling and reusing materials can help the environment, and it is also a cost-effective way to conserve resources.",
          "translation": "Pengumpulan kembali dan penggunaan kembali bahan-bahan dapat membantu lingkungan, dan itu juga merupakan cara yang efektif untuk melestarikan sumber daya."
        },
        {
          "type": "Compound-Complex",
          "text": "If we do not reduce, reuse, and recycle, our planet will face severe environmental degradation, and this can lead to devastating consequences.",
          "translation": "Jika kita tidak mengurangi, menggunaan kembali, dan mengumpulkan kembali, planet kita akan menghadapi kerusakan lingkungan yang parah, dan ini dapat menyebabkan konsekuensi yang menghawatirkan."
        }
      ],
      "phonetics": {
        "us": "/ˈrɪsɪklɪŋ/",
        "uk": "/rɪˈsaɪkəlɪŋ/"
      },
      "meaning": "Pengumpulan dan pengolahan bahan-bahan yang akan dibuang untuk dapat digunakan kembali.",
      "synonymMeanings": [
        "penggunaan kembali",
        "pengolahan kembali",
        "pengumpulan ulang",
        "konservasi"
      ]
    },
    {
      "id": "cd8d97e2-8f5f-4035-9f37-52007366f677",
      "word": "Composting",
      "synonyms": [
        "Organic recycling",
        "soil",
        "enrichment"
      ],
      "definition": "The process of breaking down organic materials, such as food waste and garden waste, into a nutrient-rich fertilizer.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Composting is a sustainable way to reduce waste and create a natural fertilizer.",
          "translation": "Mengompos adalah cara yang ramah lingkungan untuk mengurangi limbah dan menciptakan pupuk alami."
        },
        {
          "type": "Complex",
          "text": "Because composting can help to reduce greenhouse gas emissions, it is essential for us to adopt this practice in our daily lives.",
          "translation": "Karena kompos dapat membantu mengurangi emisi gas rumah kaca, maka hal ini sangat penting bagi kita untuk menerapkan praktik ini dalam kehidupan sehari-hari."
        },
        {
          "type": "Compound",
          "text": "Composting reduces waste and creates a natural fertilizer, which can improve soil quality, and also helps to mitigate the effects of climate change.",
          "translation": "Mengompos mengurangi limbah dan menciptakan pupuk alami, yang dapat meningkatkan kualitas tanah, serta membantu mengurangi dampak perubahan iklim."
        },
        {
          "type": "Compound-Complex",
          "text": "However, despite its numerous benefits, many people still do not understand the importance of composting, and this lack of awareness is a major obstacle to its widespread adoption.",
          "translation": "Meskipun memiliki banyak keuntungan, namun banyak orang masih tidak mengerti pentingnya mengompos, dan kekurangan kesadaran ini adalah salah satu hambatan besar untuk menerapkan praktik ini secara luas."
        }
      ],
      "phonetics": {
        "us": "/ˈkɑm.pɑːstɪŋ/",
        "uk": "/ˈkɒmpɒstɪŋ/"
      },
      "meaning": "Proses penguraian bahan-bahan organik menjadi pupuk yang kaya nutrisi.",
      "synonymMeanings": [
        "Mengurai bahan-bahan organik",
        "Membuat pupuk organik",
        "Mengurangi limbah dengan cara alami"
      ]
    },
    {
      "id": "33850c07-cd2b-4fc7-be44-d2e914a19a1c",
      "word": "Sustainable agriculture",
      "synonyms": [
        "Eco-friendly farming",
        "regenerative agriculture"
      ],
      "definition": "Agricultural practices that produce food without harming the environment.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Sustainable agriculture has become a vital aspect of modern farming.",
          "translation": "Pertanian berkelanjutan telah menjadi aspek penting dalam pertanian modern."
        },
        {
          "type": "Complex",
          "text": "While sustainable agriculture has many benefits, it also requires significant investment in new technology.",
          "translation": "Meskipun pertanian berkelanjutan memiliki banyak keuntungan, namun juga memerlukan investasi signifikan dalam teknologi baru."
        },
        {
          "type": "Compound",
          "text": "Sustainable agriculture is not only an environmental issue, but also an economic and social one.",
          "translation": "Pertanian berkelanjutan bukan hanya masalah lingkungan, tetapi juga masalah ekonomi dan sosial."
        },
        {
          "type": "Compound-Complex",
          "text": "If we adopt sustainable agriculture practices, we can reduce our carbon footprint and increase food production, which will have a positive impact on the environment and the economy.",
          "translation": "Jika kita menerapkan praktik pertanian berkelanjutan, kita dapat mengurangi jejak karbon dan meningkatkan produksi pangan, yang akan memiliki dampak positif pada lingkungan dan ekonomi."
        }
      ],
      "phonetics": {
        "us": "/səˈstɪnəbəl ˌægrɪˈkʌltʃər/",
        "uk": "/səˈstɪnəbəl ˌægrɪˈkʌltʃər/"
      },
      "meaning": "Pertanian berkelanjutan",
      "synonymMeanings": [
        "Pertanian lestari",
        "Pertanian hijau",
        "Pertanian berkelanjutan sumber daya",
        "Pertanian ramah lingkungan"
      ]
    },
    {
      "id": "878e3121-6e5c-45a9-847c-26ec6e5495cd",
      "word": "Organic farming",
      "synonyms": [
        "Natural farming",
        "eco-agriculture"
      ],
      "definition": "The practice of growing and raising plants and animals without the use of synthetic fertilizers, pesticides, or genetically modified organisms.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Organic farming is essential for a sustainable food supply.",
          "translation": "Pertanian organik sangat penting untuk persediaan makanan yang berkelanjutan."
        },
        {
          "type": "Complex",
          "text": "The increasing popularity of organic farming has led to a decrease in the use of chemical pesticides.",
          "translation": "Kebanyakan pertanian organik yang meningkat telah menyebabkan penurunan penggunaan pestisida kimia."
        },
        {
          "type": "Compound",
          "text": "Organic farming and animal husbandry have many similarities, but also several differences.",
          "translation": "Pertanian organik dan peternakan ternak memiliki banyak kesamaan, tetapi juga beberapa perbedaan."
        },
        {
          "type": "Compound-Complex",
          "text": "Organic farming methods not only benefit the environment but also improve the quality of the crops, which in turn increases the income of farmers.",
          "translation": "Metode pertanian organik tidak hanya menguntungkan lingkungan, tetapi juga meningkatkan kualitas hasil panen, yang pada gilirannya meningkatkan pendapatan petani."
        }
      ],
      "phonetics": {
        "us": "/ɔrˈɡænɪkˈfɑːrmɪŋ/",
        "uk": "/ɔːrˈɡænɪkˈfɑːrmɪŋ/"
      },
      "meaning": "Pertanian organik",
      "synonymMeanings": [
        "pertanian alami",
        "pertanian hijau",
        "pertanian ramah lingkungan"
      ]
    },
    {
      "id": "0ba7cfea-70c7-41fb-8eeb-568d8f5db933",
      "word": "Eco-tourism",
      "synonyms": [
        "Sustainable tourism",
        "green travel"
      ],
      "definition": "A type of tourism that focuses on visiting and appreciating natural environments, such as national parks, forests, and wildlife reserves, while also contributing to their conservation.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Eco-tourism has become a significant source of income for many rural communities.",
          "translation": "Wisata alam menjadi sumber pendapatan penting bagi banyak komunitas pedesaan."
        },
        {
          "type": "Complex",
          "text": "The increasing popularity of eco-tourism has led to concerns about the impact on local wildlife and ecosystems.",
          "translation": "Kenaikan popularitas wisata alam telah menyebabkan kekhawatiran tentang dampaknya terhadap satwa liar dan ekosistem lokal."
        },
        {
          "type": "Compound",
          "text": "Eco-tourism and sustainable development are closely linked, as tourists are encouraged to contribute to local conservation efforts.",
          "translation": "Wisata alam dan pengembangan berkelanjutan terkait erat, karena wisatawan diasuh untuk berkontribusi pada upaya pelestarian lokal."
        },
        {
          "type": "Compound-Complex",
          "text": "In order to promote eco-tourism in our country, we need to develop infrastructure and improve our environmental policies, which will also benefit local communities and support sustainable development.",
          "translation": "Untuk mempromosikan wisata alam di negara kita, kita perlu mengembangkan infrastruktur dan meningkatkan kebijakan lingkungan, yang juga akan menguntungkan komunitas lokal dan mendukung pengembangan berkelanjutan."
        }
      ],
      "phonetics": {
        "us": "/ˌiːkoʊˈtɜːrɪzəm/",
        "uk": "/ˌiːkoʊˈtɜːrɪzəm/"
      },
      "meaning": "Wisata alam yang berorientasi pada pelestarian lingkungan.",
      "synonymMeanings": [
        "Pariwisata alam berkelanjutan",
        "Wisata lingkungan",
        "Pariwisata pelestarian"
      ]
    },
    {
      "id": "0b327a99-c941-4a03-95d2-6c2012186b8a",
      "word": "Wildlife preservation",
      "synonyms": [
        "Conservation",
        "species",
        "protection"
      ],
      "definition": "The practice of protecting and conserving wild animals and their habitats.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Wildlife preservation is essential for maintaining biodiversity.",
          "translation": "Konservasi satwa liar sangat penting untuk menjaga keanekaragaman hayati."
        },
        {
          "type": "Complex",
          "text": "The government has implemented various policies to ensure effective wildlife preservation, which has led to a significant increase in the population of endangered species.",
          "translation": "Pemerintah telah menerapkan berbagai kebijakan untuk memastikan konservasi satwa liar efektif, yang telah menyebabkan peningkatan populasi spesies yang terancam secara signifikan."
        },
        {
          "type": "Compound",
          "text": "Wildlife preservation and conservation of natural resources are closely linked.",
          "translation": "Konservasi satwa liar dan pelestarian sumber daya alam sangat terkait satu sama lain."
        },
        {
          "type": "Compound-Complex",
          "text": "The impact of human activities on wildlife preservation is a major concern, as it can lead to habitat destruction and the decline of endangered species, which in turn can have severe consequences for the ecosystem.",
          "translation": "Dampakgiatan manusia terhadap konservasi satwa liar merupakan kekhawatiran utama, karena dapat menyebabkan destruktif habitat dan penurunan spesies yang terancam, yang pada gilirannya dapat menyebabkan konsekuensi yang parah bagi sistem ekosistem."
        }
      ],
      "phonetics": {
        "us": "/ˌwaɪldˌlaɪf ˌprɛzərˈveɪʃən/",
        "uk": "/ˌwaɪldˌlaɪf ˌprɛzərveɪˈʃən/"
      },
      "meaning": "Konservasi satwa liar dan habitatnya.",
      "synonymMeanings": [
        "konservasi satwa liar",
        "pelestarian satwa liar",
        "perlindungan lingkungan"
      ]
    },
    {
      "id": "bfd95897-2d18-4f86-b198-69e30f4d21c9",
      "word": "Deforestation-free",
      "synonyms": [
        "Sustainable",
        "forest-friendly"
      ],
      "definition": "The practice or state of avoiding deforestation; the use of sustainable forest management to prevent the clearance of forests.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The company has committed to being deforestation-free in all its operations.",
          "translation": "Perusahaan tersebut telah menjanjikan untuk menjadi bebas deforestasi dalam semua operasinya."
        },
        {
          "type": "Complex",
          "text": "While some countries have made significant progress in reducing deforestation, many more need to be encouraged to adopt deforestation-free practices.",
          "translation": "Meskipun beberapa negara telah mencapai kemajuan signifikan dalam mengurangi deforestasi, masih banyak yang perlu dipacu untuk menerima praktek konservasi hutan yang berkelanjutan."
        },
        {
          "type": "Compound",
          "text": "The government has launched a campaign to promote sustainable forest management and prevent deforestation, while the opposition has criticized the plan for being deforestation-free.",
          "translation": "Pemerintah telah meluncurkan kampanye untuk mempromosikan pengelolaan hutan berkelanjutan dan mencegah deforestasi, sementara lawan politiknya mengecam rencana tersebut karena tidak menutupi deforestasi."
        },
        {
          "type": "Compound-Complex",
          "text": "However, the effectiveness of deforestation-free initiatives is often hampered by corruption, inadequate laws, and lack of public awareness, which must be addressed to ensure the long-term sustainability of forest ecosystems.",
          "translation": "Namun, efektivitas inisiatif bebas deforestasi seringkali terhambat oleh korupsi, ketiadaan hukum yang cukup, dan kurangnya kesadaran publik, yang harus diatasi untuk menjamin keberlanjutan ekosistem hutan dalam jangka panjang."
        }
      ],
      "phonetics": {
        "us": "/dɛfɒrɪsˈteɪʃənˌfriː/",
        "uk": "/dɛfɒrɪsˈteɪʃənˌfɹi/"
      },
      "meaning": "Konservasi hutan yang berkelanjutan",
      "synonymMeanings": [
        "konservasi hutan berkelanjutan",
        "pengelolaan hutan berkelanjutan",
        "tanpa deforestasi",
        "bebas deforestasi"
      ]
    },
    {
      "id": "71bc610f-714c-412c-b31d-5405ceca22cc",
      "word": "Eco-conscious",
      "synonyms": [
        "Environmentally aware",
        "green-minded"
      ],
      "definition": "Concerned about and actively working to reduce the negative impact of one's actions on the environment.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Many people are now eco-conscious and recycle their trash.",
          "translation": "Banyak orang saat ini peduli lingkungan dan mengumpulkan sampah yang dapat didaur ulang."
        },
        {
          "type": "Complex",
          "text": "The company's decision to invest in renewable energy is a clear example of its eco-conscious approach to business.",
          "translation": "Keputusan perusahaan untuk berinvestasi dalam energi terbarukan merupakan contoh jelas dari pendekatan perusahaan yang peduli lingkungan dalam menjalankan bisnis."
        },
        {
          "type": "Compound",
          "text": "The government is launching a new campaign to promote eco-consciousness among citizens, and the school is also implementing a recycling program.",
          "translation": "Pemerintah meluncurkan kampanye baru untuk mempromosikan kesadaran akan pentingnya peduli lingkungan di kalangan warga, dan sekolah juga melaksanakan program daur ulang."
        },
        {
          "type": "Compound-Complex",
          "text": "The city's eco-conscious policies have led to a significant reduction in air pollution, which has improved the quality of life for residents, but the city still faces challenges in implementing these policies effectively.",
          "translation": "Kebijakan pemerintah yang peduli lingkungan telah menyebabkan penurunan signifikan polusi udara, yang telah meningkatkan kualitas hidup warga, namun kota masih menghadapi tantangan dalam melaksanakan kebijakan tersebut secara efektif."
        }
      ],
      "phonetics": {
        "us": "/ˌiːkoʊˈkɑːnʃəs/",
        "uk": "/ˌiːkəʊˈkɒnʃəs/"
      },
      "meaning": "Peduli lingkungan dan berusaha mengurangi dampak negatif dari tindakan-tindakan kita.",
      "synonymMeanings": [
        "ramah lingkungan",
        "peduli lingkungan",
        "terkonser dengan lingkungan",
        "berhati-hati terhadap lingkungan"
      ]
    },
    {
      "id": "b92d1851-bf39-44a3-a7c0-62711bc6afc9",
      "word": "Green initiatives",
      "synonyms": [
        "Eco-programs",
        "conservation efforts"
      ],
      "definition": "Actions taken to reduce the negative impact of human activities on the environment.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The new government has implemented several green initiatives to reduce carbon emissions.",
          "translation": "Pemerintah baru ini telah melaksanakan beberapa inisiatif lingkungan untuk mengurangi emisi karbon."
        },
        {
          "type": "Complex",
          "text": "The increasing demand for sustainable energy has led to the development of new green initiatives in the industry.",
          "translation": "Tuntutan yang meningkat untuk energi terbarukan telah memicu perkembangan inisiatif lingkungan baru dalam industri."
        },
        {
          "type": "Compound",
          "text": "Green initiatives can be seen in many areas of our lives, from reducing waste to using public transport.",
          "translation": "Inisiatif lingkungan dapat dilihat dalam banyak aspek kehidupan kita, mulai dari mengurangi limbah hingga menggunakan transportasi umum."
        },
        {
          "type": "Compound-Complex",
          "text": "While some people argue that green initiatives are too expensive, others believe that the long-term benefits outweigh the costs.",
          "translation": "Meskipun beberapa orang berpendapat bahwa inisiatif lingkungan terlalu mahal, orang lain percaya bahwa manfaat jangka panjang melebihi biaya."
        }
      ],
      "phonetics": {
        "us": "/ˈɡriːn ɪnɪˈsɪətɪvz/",
        "uk": "/ˈɡriːn ɪnɪˈsɪtɪvz/"
      },
      "meaning": "Inisiatif lingkungan",
      "synonymMeanings": [
        "usaha lingkungan",
        "inisiatif hijau",
        "upaya ramah lingkungan",
        "program lingkungan"
      ]
    },
    {
      "id": "0402d020-05d2-44d0-ade2-082685504891",
      "word": "Alternative energy",
      "synonyms": [
        "Renewable energy",
        "green",
        "power"
      ],
      "definition": "Energy produced from sources other than fossil fuels, such as the sun, wind, and water.",
      "userGuesses": [],
      "status": "hidden",
      "examples": [
        {
          "type": "Simple",
          "text": "The use of alternative energy can greatly reduce our reliance on fossil fuels.",
          "translation": "Penggunaan energi alternatif dapat mengurangi ketergantungan kita pada bahan bakar fosil."
        },
        {
          "type": "Complex",
          "text": "While alternative energy sources are becoming increasingly popular, they still face significant challenges in terms of cost and efficiency.",
          "translation": "Meskipun sumber energi alternatif semakin populer, mereka masih menghadapi tantangan yang signifikan dalam hal biaya dan efisiensi."
        },
        {
          "type": "Compound",
          "text": "Alternative energy sources, such as solar and wind power, are becoming more viable options for reducing our carbon footprint.",
          "translation": "Sumber energi alternatif, seperti tenaga matahari dan angin, semakin menjadi pilihan yang lebih berdaya guna untuk mengurangi jejak karbon kita."
        },
        {
          "type": "Compound-Complex",
          "text": "In recent years, there has been a significant increase in the adoption of alternative energy sources, particularly in countries with abundant renewable resources, which has led to a decrease in greenhouse gas emissions.",
          "translation": "Dalam beberapa tahun terakhir, terjadi peningkatan signifikan dalam penerimaan sumber energi alternatif, terutama di negara-negara dengan sumber daya yang dapat diperbarui yang melimpah, yang telah menyebabkan penurunan emisi gas rumah kaca."
        }
      ],
      "phonetics": {
        "us": "/ɔːlˈtɜːrnɪt ˈɛnədʒi/",
        "uk": "/ɔːlˈtɜːrnət ˈɛnədʒi/"
      },
      "meaning": "Energi alternatif",
      "synonymMeanings": [
        "Energi terbarukan",
        "Energi hijau",
        "Energi bersih"
      ]
    },
    {
      "id": "a3565396-5f5f-43c6-834a-f98c99f49239",
      "word": "Energy efficiency",
      "synonyms": [
        "Conservation",
        "power-saving"
      ],
      "definition": "The practice of using less energy than is needed to achieve a particular goal, often by using more efficient equipment or systems.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "To reduce the impact of climate change, it is essential to prioritize energy efficiency.",
          "translation": "Untuk mengurangi dampak perubahan iklim, penting untuk memberikan prioritas pada penghematan energi."
        },
        {
          "type": "Complex",
          "text": "Implementing energy-efficient technologies in our homes can significantly reduce energy consumption, which, in turn, helps to mitigate the effects of global warming.",
          "translation": "Mengimplementasikan teknologi penghematan energi di rumah-rumah kita dapat secara signifikan mengurangi konsumsi energi, sehingga dapat membantu mengurangi dampak perubahan iklim global."
        },
        {
          "type": "Compound",
          "text": "In addition to installing solar panels, using energy-efficient appliances and turning off lights when not in use are also crucial steps in achieving energy efficiency.",
          "translation": "Selain menginstal panel surya, menggunakan perangkat penghematan energi dan mematikan lampu ketika tidak digunakan juga merupakan langkah penting dalam mencapai penghematan energi."
        },
        {
          "type": "Compound-Complex",
          "text": "Furthermore, governments and businesses can play a vital role in promoting energy efficiency by investing in research and development of new technologies and providing incentives for individuals and organizations to adopt sustainable practices.",
          "translation": "Selain itu, pemerintah dan perusahaan juga dapat berperan penting dalam mendorong penghematan energi dengan berinvestasi pada penelitian dan pengembangan teknologi baru dan memberikan insentif bagi individu dan organisasi untuk menerapkan praktik yang berkelanjutan."
        }
      ],
      "phonetics": {
        "us": "/ɛn.ɚ.dʒi ɛ.fɪˈsɪs.nɪs/",
        "uk": "/ɛn.ə.dʒi ɛ.fɪˈsɪs.nɪs/"
      },
      "meaning": "Penghematan energi",
      "synonymMeanings": [
        "Penghematan energi",
        "Kinerja energi yang efektif",
        "Manfaat energi yang optimal"
      ]
    },
    {
      "id": "f174466d-9ce7-4c98-946d-afd8e1ad1529",
      "word": "Environmental awareness",
      "synonyms": [
        "Eco-consciousness",
        "sustainability education"
      ],
      "definition": "The ability to recognize and respect the impact of human activity on the environment.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Raising environmental awareness is essential for a sustainable future.",
          "translation": "Meningkatkan kesadaran lingkungan sangat penting untuk masa depan yang berkelanjutan."
        },
        {
          "type": "Complex",
          "text": "The government has implemented various policies to increase environmental awareness among the public.",
          "translation": "Pemerintah telah melaksanakan berbagai kebijakan untuk meningkatkan kesadaran lingkungan di kalangan masyarakat."
        },
        {
          "type": "Compound",
          "text": "Environmental awareness campaigns have been organized by local communities, schools, and government agencies.",
          "translation": "Kampanye kesadaran lingkungan telah dijalankan oleh komunitas lokal, sekolah, dan lembaga pemerintah."
        },
        {
          "type": "Compound-Complex",
          "text": "However, despite the efforts of NGOs and government institutions, environmental awareness remains a significant challenge in many developing countries.",
          "translation": "Meskipun ada upaya dari organisasi non-pemerintah dan lembaga pemerintah, kesadaran lingkungan masih merupakan tantangan signifikan di banyak negara berkembang."
        }
      ],
      "phonetics": {
        "us": "/ˌɛn.viˈɹən.mɛntl əˈwɛr.nəs/",
        "uk": "/ˌɛn.vɪˈɹɒn.məntəl əˈwɛə.nəs/"
      },
      "meaning": "Kemampuan mengenali dan menghargai dampak aktivitas manusia terhadap lingkungan.",
      "synonymMeanings": [
        "Kemampuan mengenali lingkungan",
        "Kesadaran akan dampak lingkungan",
        "Keterampilan berpikir lingkungan",
        "Kemampuan menghargai lingkungan"
      ]
    },
    {
      "id": "0486feed-c7dc-4bcc-9e50-04cccb9e65d9",
      "word": "Silence",
      "synonyms": [
        "Quietness",
        "muteness"
      ],
      "definition": "The state or quality of being quiet or still, with no sound.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The silence in the library was oppressive.",
          "translation": "Suasana keheningan di perpustakaan sangat menekan."
        },
        {
          "type": "Complex",
          "text": "The sudden silence that followed the argument was a stark contrast to the earlier loud discussion.",
          "translation": "Keheningan tiba-tiba yang mengikuti perdebatan itu merupakan kontras yang tegas dengan percakapan keras yang terjadi sebelumnya."
        },
        {
          "type": "Compound",
          "text": "The silence was broken by the sound of the clock ticking, and the students began to murmur among themselves.",
          "translation": "Keheningan itu terputus oleh suara jam berdering, dan para siswa mulai berbisik-bisik di antara mereka."
        },
        {
          "type": "Compound-Complex",
          "text": "Although the silence in the room was palpable, the students still managed to engage in a heated discussion, but it was eventually broken by the sound of the teacher entering the room.",
          "translation": "Meskipun ketidakaktifan suara di ruangan sangat terasa, para siswa masih berhasil mengadakan diskusi yang sengit, namun akhirnya terputus oleh suara guru yang memasuki ruangan."
        }
      ],
      "phonetics": {
        "us": "/ˈsɪləns/",
        "uk": "/ˈsaɪləns/"
      },
      "meaning": "Ketidakaktifan suara.",
      "synonymMeanings": [
        "Ketidakaktifan suara",
        "Keheningan",
        "Keterpisahan suara",
        "Ketidakterdengaranan"
      ]
    },
    {
      "id": "ad4c44ed-7d7a-4c25-ab17-266eb271e283",
      "word": "Ecological balance",
      "synonyms": [
        "Environmental stability",
        "ecosystem harmony"
      ],
      "definition": "A state of equilibrium in which the interactions between living organisms and their environment are stable and sustainable.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The destruction of natural habitats threatens the ecological balance of our planet.",
          "translation": "Penghancuran habitat alam liar mengancam keseimbangan ekologi planet kita."
        },
        {
          "type": "Complex",
          "text": "While technological advancements have improved our quality of life, they have also disrupted the ecological balance of our ecosystems.",
          "translation": "Meskipun kemajuan teknologi telah meningkatkan kualitas hidup kita, namun juga mengganggu keseimbangan ekologi sistem ekosistem kita."
        },
        {
          "type": "Compound",
          "text": "The ecological balance of the ocean is crucial for maintaining the health of marine life and preventing pollution.",
          "translation": "Keseimbangan ekologi laut sangat penting untuk memelihara kesehatan kehidupan laut dan mencegah polusi."
        },
        {
          "type": "Compound-Complex",
          "text": "The increasing use of plastic has disrupted the ecological balance of our oceans, which in turn has led to the decline of marine life and the pollution of our coastlines.",
          "translation": "Penggunaan plastik yang meningkat mengganggu keseimbangan ekologi laut kita, sehingga menyebabkan penurunan kehidupan laut dan polusi di pantai-pantai kita."
        }
      ],
      "phonetics": {
        "us": "/ɛkəˈlɒdʒɪkl ˈbæləns/",
        "uk": "/ɛkəˈlɒdʒɪkl ˈbæləns/"
      },
      "meaning": "Keseimbangan ekologi",
      "synonymMeanings": [
        "keseimbangan lingkungan",
        "stabilitas ekosistem",
        "keserasian alam"
      ]
    },
    {
      "id": "74842e1a-bea3-40fe-9ed6-f394ba299201",
      "word": "Climate resilience",
      "synonyms": [
        "Environmental adaptability",
        "sustainability"
      ],
      "definition": "The ability of a community, ecosystem, or organization to withstand and recover from the impacts of climate change.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Developing countries need to build climate resilience to mitigate the effects of global warming.",
          "translation": "Negara-negara berkembang perlu membangun kemampuan tahan iklim untuk mengurangi dampak perubahan suhu global."
        },
        {
          "type": "Complex",
          "text": "The city's climate resilience strategies include investing in renewable energy and promoting sustainable agriculture practices.",
          "translation": "Strategi kemampuan tahan iklim kota tersebut mencakup investasi di bidang energi terbarukan dan promosi praktik pertanian berkelanjutan."
        },
        {
          "type": "Compound",
          "text": "Climate resilience is crucial for the survival of many ecosystems, and it requires a concerted effort from governments and local communities.",
          "translation": "Kemampuan tahan iklim sangat penting bagi kelangsungan hidup banyak ekosistem, dan membutuhkan upaya yang solid dari pemerintah dan komunitas lokal."
        },
        {
          "type": "Compound-Complex",
          "text": "While governments have implemented policies to enhance climate resilience, much work remains to be done to mitigate the impacts of climate change, especially in vulnerable communities.",
          "translation": "Meskipun pemerintah telah melaksanakan kebijakan untuk meningkatkan kemampuan tahan iklim, banyak pekerjaan yang masih harus dilakukan untuk mengurangi dampak perubahan iklim, terutama di komunitas yang rentan."
        }
      ],
      "phonetics": {
        "us": "/ˈklɪmɪt rɛzɪˈstəns/",
        "uk": "/ˈklɪmɪt rɛzɪˈstəns/"
      },
      "meaning": "Kemampuan suatu komunitas, ekosistem, atau organisasi untuk menahan dan pulih dari dampak perubahan iklim.",
      "synonymMeanings": [
        "Kemampuan adaptasi iklim",
        "Kemampuan tahan perubahan iklim",
        "Kemampuan resistensi iklim"
      ]
    },
    {
      "id": "d566c01d-426d-44be-b364-aaec8817df85",
      "word": "Ecological footprint",
      "synonyms": [
        "Environmental impact",
        "resource consumption"
      ],
      "definition": "The amount of land, water, or other resources required to produce the food, energy, and other products that a person or organization uses.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing ecological footprint of our city poses a significant threat to its sustainability.",
          "translation": "Jejak lingkungan hidup kota kami semakin meningkat dan mengancam keberlangsungan kota kami."
        },
        {
          "type": "Complex",
          "text": "Although the new policy aims to reduce the ecological footprint of industries, its effectiveness is still uncertain.",
          "translation": "Meskipun kebijakan baru itu bertujuan untuk mengurangi jejak lingkungan hidup industri, namun efektifitas kebijakan tersebut masih belum terjamin."
        },
        {
          "type": "Compound",
          "text": "The government has implemented several measures to reduce the ecological footprint of transportation, including promoting the use of electric vehicles and improving public transportation.",
          "translation": "Pemerintah telah menetapkan beberapa kebijakan untuk mengurangi jejak lingkungan hidup transportasi, termasuk mempromosikan penggunaan kendaraan listrik dan meningkatkan kualitas transportasi umum."
        },
        {
          "type": "Compound-Complex",
          "text": "However, despite these efforts, the ecological footprint of our country remains one of the highest in the world, mainly due to the rapid growth of the population and the increasing demand for consumer goods.",
          "translation": "Namun, meskipun upaya-upaya tersebut, jejak lingkungan hidup negara kami masih salah satu yang tertinggi di dunia, terutama karena pertumbuhan populasi yang cepat dan meningkatnya kebutuhan masyarakat akan barang-barang konsumsi."
        }
      ],
      "phonetics": {
        "us": "/ɪˈkɒlədʒɪkəl ˈfɔːptoʊt/",
        "uk": "/ɪˈkɒlədʒɪkəl ˈfɔːptoʊt/"
      },
      "meaning": "Jejak lingkungan hidup",
      "synonymMeanings": [
        "Dampak lingkungan",
        "Pengaruh ekologi",
        "Kerentanan lingkungan",
        "Kapasitas lingkungan"
      ]
    },
    {
      "id": "44dd19c4-b4df-4b03-afad-7f02a233d98e",
      "word": "Fossil fuel dependency",
      "synonyms": [
        "Non-renewable reliance",
        "carbon dependence"
      ],
      "definition": "A dependence on or reliance on fossil fuels, such as coal, oil, and gas, for energy.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The country's economic growth is heavily reliant on fossil fuel dependency.",
          "translation": "Pertumbuhan ekonomi negara sangat bergantung pada ketergantungan bahan bakar fosil."
        },
        {
          "type": "Complex",
          "text": "While the benefits of fossil fuel dependency are undeniable, its negative impacts on the environment are a major concern.",
          "translation": "Meskipun manfaat ketergantungan pada bahan bakar fosil tidak dapat disangkal, dampak negatifnya terhadap lingkungan adalah kekhawatiran utama."
        },
        {
          "type": "Compound",
          "text": "Fossil fuel dependency is not only a major contributor to climate change but also a significant source of air pollution.",
          "translation": "Ketergantungan pada bahan bakar fosil tidak hanya merupakan kontributor utama perubahan iklim, tetapi juga sumber utama polusi udara."
        },
        {
          "type": "Compound-Complex",
          "text": "As a result of the increasing global demand for energy, many countries are struggling to reduce their fossil fuel dependency, which in turn affects the environment and public health.",
          "translation": "Dengan meningkatnya permintaan global akan energi, banyak negara harus berjuang untuk mengurangi ketergantungan pada bahan bakar fosil, sehingga mempengaruhi lingkungan dan kesehatan masyarakat."
        }
      ],
      "phonetics": {
        "us": "/ˈfoʊsəlˈfuːl ˈdɛpəndənsi/",
        "uk": "/ˈfoʊsəlˈfuːl ˈdɛpəndənsi/"
      },
      "meaning": "Ketergantungan pada bahan bakar fosil",
      "synonymMeanings": [
        "ketergantungan pada energi fosil",
        "penggunaan bahan bakar fosil",
        "kebergantungan pada bahan bakar"
      ]
    },
    {
      "id": "168fea23-206c-4725-9707-91aa168021d5",
      "word": "Overconsumption",
      "synonyms": [
        "Resource depletion",
        "exploitation"
      ],
      "definition": "The act of using more resources or goods than is necessary or sustainable.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The world is suffering from overconsumption of fossil fuels.",
          "translation": "Dunia saat ini menderita karena konsumsi bahan bakar fosil yang berlebihan."
        },
        {
          "type": "Complex",
          "text": "Overconsumption of resources has led to severe environmental degradation.",
          "translation": "Penggunaan yang berlebihan sumber daya telah menyebabkan kerusakan lingkungan yang parah."
        },
        {
          "type": "Compound",
          "text": "The government has implemented policies to reduce overconsumption of water and electricity.",
          "translation": "Pemerintah telah mengimplementasikan kebijakan untuk mengurangi penggunaan air dan listrik yang berlebihan."
        },
        {
          "type": "Compound-Complex",
          "text": "While overconsumption of food has become a major issue worldwide, the use of organic farming methods can help mitigate its effects.",
          "translation": "Walaupun penggunaan bahan makanan yang berlebihan telah menjadi masalah besar di seluruh dunia, penggunaan metode pertanian organik dapat membantu mengurangi dampaknya."
        }
      ],
      "phonetics": {
        "us": "/əvərkɑnˈsʌmptʃən/",
        "uk": "/əvər.kɒnˈsʌmptʃən/"
      },
      "meaning": "Penggunaan yang berlebihan",
      "synonymMeanings": [
        "Penggunaan berlebihan",
        "Konsumsi yang tidak terkendali",
        "Penggunaan yang tidak rasional",
        "Eksploitasi sumber daya"
      ]
    },
    {
      "id": "47e74a2e-4af4-401c-b3d5-3b95feb3eb98",
      "word": "Toxic waste",
      "synonyms": [
        "Hazardous waste",
        "pollutants"
      ],
      "definition": "Waste that is poisonous and can harm people's health and the environment.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The government must take responsibility for the disposal of toxic waste.",
          "translation": "Pemerintah harus bertanggung jawab atas pengelolaan bahan beracun."
        },
        {
          "type": "Complex",
          "text": "Due to the lack of proper facilities, the company is struggling to handle the toxic waste generated by its factories.",
          "translation": "Karena kekurangan fasilitas yang memadai, perusahaan sedang berusaha mengatasi limbah beracun yang dihasilkan oleh pabriknya."
        },
        {
          "type": "Compound",
          "text": "The toxic waste from the factory is not only polluting the air but also contaminating the soil and water.",
          "translation": "Limbah beracun dari pabrik tersebut tidak hanya mengotori udara, tetapi juga mengkontaminasi tanah dan air."
        },
        {
          "type": "Compound-Complex",
          "text": "The government's decision to establish a new waste management facility has been welcomed by the local community, but some environmental groups are concerned that it may not be enough to handle the increasing amount of toxic waste generated by the nearby industrial estates.",
          "translation": "Keputusan pemerintah untuk mendirikan fasilitas pengelolaan limbah baru telah diterima oleh masyarakat setempat, tetapi beberapa kelompok lingkungan hidup khawatir bahwa itu mungkin tidak cukup untuk menangani jumlah limbah beracun yang semakin meningkat yang dihasilkan oleh kawasan industri terdekat."
        }
      ],
      "phonetics": {
        "us": "/ˈtɒksɪk weɪst/",
        "uk": "/ˈtɒksɪk weɪst/"
      },
      "meaning": "Bahan beracun",
      "synonymMeanings": [
        "bahan kimia berbahaya",
        "limbah berbahaya",
        "sampah beracun",
        "tumpukan racun"
      ]
    },
    {
      "id": "0b79aee1-136f-4046-b672-08cd8a91f672",
      "word": "Plastic pollution",
      "synonyms": [
        "Environmental contamination",
        "non-biodegradable waste"
      ],
      "definition": "The presence of plastic waste in the environment, especially in oceans and waterways, causing harm to wildlife and ecosystems.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing levels of plastic pollution in our oceans threaten the survival of many marine species.",
          "translation": "Pencemaran plastik di laut kita semakin meningkat dan mengancam keberadaan spesies laut."
        },
        {
          "type": "Complex",
          "text": "While some people argue that plastic bags are convenient, others believe that the negative impact of plastic pollution on the environment outweighs these benefits.",
          "translation": "Meskipun beberapa orang berpendapat bahwa tas plastik sangat nyaman, yang lainnya percaya bahwa dampak negatif pencemaran plastik terhadap lingkungan lebih besar daripada manfaatnya."
        },
        {
          "type": "Compound",
          "text": "Plastic pollution in the ocean has devastating effects on marine life and coastal ecosystems, but also harms human health through the consumption of contaminated seafood.",
          "translation": "Pencemaran plastik di laut memiliki efek mematikan pada kehidupan laut dan ekosistem pesisir, serta mengancam kesehatan manusia melalui konsumsi ikan yang terkontaminasi."
        },
        {
          "type": "Compound-Complex",
          "text": "Furthermore, the impact of plastic pollution on the environment is exacerbated by the lack of effective waste management systems in many developing countries, which leads to a significant increase in plastic waste in our oceans.",
          "translation": "Lebih lanjut, dampak pencemaran plastik terhadap lingkungan semakin parah karena kurangnya sistem pengelolaan sampah yang efektif di banyak negara berkembang, sehingga meningkatkan jumlah sampah plastik di laut kita secara signifikan."
        }
      ],
      "phonetics": {
        "us": "/ˈplæstɪk pəˈloʊʃən/",
        "uk": "/ˈplæstɪk pəˈloʊʃən/"
      },
      "meaning": "Pencemaran plastik",
      "synonymMeanings": [
        "kebocoran plastik",
        "pembuangan plastik"
      ]
    },
    {
      "id": "349faf97-2e2c-45e0-ba67-ed24bf154cfc",
      "word": "Sustainable development",
      "synonyms": [
        "Eco-friendly progress",
        "responsible growth"
      ],
      "definition": "The process of improving the quality of life while preserving natural resources for future generations.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The government should prioritize sustainable development to ensure a better future.",
          "translation": "Pemerintah seharusnya memberikan prioritas pada pengembangan yang berkelanjutan untuk menjamin masa depan yang lebih baik."
        },
        {
          "type": "Complex",
          "text": "While some argue that sustainable development is a myth, others believe it is the only way to save our planet from environmental disasters.",
          "translation": "Meskipun beberapa orang mengklaim bahwa pengembangan yang berkelanjutan adalah mitos, orang lain percaya bahwa itu adalah satu-satunya jalan untuk menyelamatkan planet kami dari bencana lingkungan."
        },
        {
          "type": "Compound",
          "text": "Sustainable development is crucial for the survival of human civilization and the protection of our natural resources.",
          "translation": "Pengembangan yang berkelanjutan sangat penting untuk bertahan hidup peradaban manusia dan melindungi sumber daya alam kami."
        },
        {
          "type": "Compound-Complex",
          "text": "However, sustainable development is not possible without the cooperation of governments, businesses, and individuals, and it requires a significant reduction in our carbon footprint.",
          "translation": "Namun, pengembangan yang berkelanjutan tidak mungkin tanpa kerja sama pemerintah, perusahaan, dan individu, dan memerlukan pengurangan signifikan jejak karbon kami."
        }
      ],
      "phonetics": {
        "us": "/sʌstənəbəl dɛvələpmənt/",
        "uk": "/sʌstənəbəl dɛvələpmənt/"
      },
      "meaning": "Pengembangan yang berkelanjutan",
      "synonymMeanings": [
        "Pengembangan berkelanjutan",
        "Pengembangan lingkungan",
        "Pengembangan berwawasan",
        "Kembangan berdaya guna"
      ]
    },
    {
      "id": "ef382c22-e4b2-48a2-8c36-6e706266875d",
      "word": "Green architecture",
      "synonyms": [
        "Sustainable design",
        "eco-friendly construction"
      ],
      "definition": "The design and construction of buildings and other structures that have a minimal impact on the environment and often use sustainable materials and renewable energy sources.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Green architecture is becoming increasingly popular in urban areas.",
          "translation": "Arsitektur hijau semakin populer di daerah perkotaan."
        },
        {
          "type": "Complex",
          "text": "The use of green architecture in new buildings can significantly reduce energy consumption and greenhouse gas emissions.",
          "translation": "Penggunaan arsitektur hijau dalam bangunan baru dapat signifikan mengurangi konsumsi energi dan emisi gas rumah kaca."
        },
        {
          "type": "Compound",
          "text": "Green architecture and sustainable practices go hand in hand, making our cities more environmentally friendly.",
          "translation": "Arsitektur hijau dan praktik ramah lingkungan beriringan, membuat kota kita lebih ramah lingkungan."
        },
        {
          "type": "Compound-Complex",
          "text": "The implementation of green architecture in urban planning can have a positive impact on the environment, but it also requires careful consideration of economic and social factors.",
          "translation": "Pelaksanaan arsitektur hijau dalam perencanaan kota dapat memiliki dampak positif pada lingkungan, tetapi juga memerlukan pertimbangan hati-hati terhadap faktor ekonomi dan sosial."
        }
      ],
      "phonetics": {
        "us": "/ˈɡriːn ɑːrkɪˈtɛktʃər/",
        "uk": "/ˈɡriːn ɑːrkɪˈtɛktʃər/"
      },
      "meaning": "Arsitektur hijau",
      "synonymMeanings": [
        "Arsitektur lingkungan",
        "Arsitektur berkelanjutan",
        "Arsitektur ramah lingkungan"
      ]
    },
    {
      "id": "a63b77a4-e6e1-46c4-b316-db3ed26f325c",
      "word": "Environmental degradation",
      "synonyms": [
        "Ecological damage",
        "habitat destruction"
      ],
      "definition": "The process of damaging the environment, especially through pollution or the destruction of natural habitats.",
      "userGuesses": [],
      "status": "hidden",
      "examples": [
        {
          "type": "Simple",
          "text": "Environmental degradation is a major concern for many developing countries.",
          "translation": "Pengrusakan lingkungan merupakan kekhawatiran besar bagi banyak negara berkembang."
        },
        {
          "type": "Complex",
          "text": "The increasing population has led to rapid environmental degradation in some parts of the world.",
          "translation": "Kenaikan populasi telah menyebabkan pengrusakan lingkungan yang cepat dalam beberapa bagian dunia."
        },
        {
          "type": "Compound",
          "text": "The pollution of the air and water is causing severe environmental degradation, which is affecting the health of millions of people.",
          "translation": "Polusi udara dan air menyebabkan pengrusakan lingkungan yang parah, yang mempengaruhi kesehatan jutaan orang."
        },
        {
          "type": "Compound-Complex",
          "text": "Although some efforts have been made to reduce environmental degradation, the problem still persists, and it is essential to find sustainable solutions to address this issue.",
          "translation": "Meskipun beberapa upaya telah dilakukan untuk mengurangi pengrusakan lingkungan, masalah ini masih berlanjut, dan penting untuk menemukan solusi yang berkelanjutan untuk menangani masalah ini."
        }
      ],
      "phonetics": {
        "us": "/ˌɛn.vɪr.ən.mən.tal dɪ.ˈɡreɪ.dʒɪ.ʃən/",
        "uk": "/ˌɛnvɪˈrɪnməntəl dɪˈɡreɪdʒɪˌeɪʃən/"
      },
      "meaning": "Pengrusakan lingkungan",
      "synonymMeanings": [
        "Penghancuran lingkungan",
        "Pengrusakan alam",
        "Dampak lingkungan",
        "Kerusakan lingkungan hidup"
      ]
    },
    {
      "id": "339dd33f-4174-407c-8204-194afca95e6e",
      "word": "Airborne pollutants",
      "synonyms": [
        "Toxic emissions",
        "atmospheric",
        "contaminants"
      ],
      "definition": "Substances, such as dust, smoke, and gases, that are in the air and can harm health or the environment.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The increasing levels of airborne pollutants have been linked to various respiratory diseases.",
          "translation": "Peningkatan kadar polusi udara telah terkait dengan berbagai penyakit pernapasan."
        },
        {
          "type": "Complex",
          "text": "While the government has implemented various policies to reduce airborne pollutants, the impact of these efforts is still unclear.",
          "translation": "Meskipun pemerintah telah melaksanakan berbagai kebijakan untuk mengurangi polusi udara, dampak upaya-upaya tersebut masih belum jelas."
        },
        {
          "type": "Compound",
          "text": "Airborne pollutants, including particulate matter and nitrogen dioxide, are major contributors to air pollution.",
          "translation": "Polusi udara, termasuk partikulat dan nitrogen dioksida, adalah kontributor utama polusi udara."
        },
        {
          "type": "Compound-Complex",
          "text": "Furthermore, airborne pollutants can also affect the quality of crops, leading to reduced yields and lower crop quality, which can have devastating effects on the economy.",
          "translation": "Selain itu, polusi udara juga dapat mempengaruhi kualitas tanaman, yang berujung pada penurunan hasil panen dan kualitas tanaman yang lebih rendah, sehingga dapat berdampak buruk pada perekonomian."
        }
      ],
      "phonetics": {
        "us": "/ˈɛərbɔrn pɔlʊˌtæntɪz/",
        "uk": "/ˈɛərbɔːn pɔləˌtæntɪz/"
      },
      "meaning": "Polusi udara",
      "synonymMeanings": [
        "Polusi udara",
        "Kotoran udara",
        "Zat berbahaya di udara"
      ]
    },
    {
      "id": "692d6dc0-86bb-4ae4-a975-1239d4a6e87c",
      "word": "Water scarcity",
      "synonyms": [
        "Water shortage",
        "drought"
      ],
      "definition": "A situation where there is not enough water to meet the needs of a place or its inhabitants.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Water scarcity is a significant problem in many parts of the world.",
          "translation": "Keterbatasan air merupakan masalah signifikan di banyak bagian dunia."
        },
        {
          "type": "Complex",
          "text": "The increasing demand for water has led to water scarcity in several regions, which in turn affects the livelihoods of local communities.",
          "translation": "Tingginya permintaan air telah menyebabkan keterbatasan air di beberapa wilayah, yang pada akhirnya memengaruhi kehidupan masyarakat setempat."
        },
        {
          "type": "Compound",
          "text": "Water scarcity and climate change are two major issues that require immediate attention from governments and international organizations.",
          "translation": "Keterbatasan air dan perubahan iklim merupakan dua masalah besar yang memerlukan perhatian segera dari pemerintah dan organisasi internasional."
        },
        {
          "type": "Compound-Complex",
          "text": "The lack of water resources has led to water scarcity in many areas, which affects the economic growth of these regions and the quality of life of their inhabitants, ultimately threatening the sustainability of the ecosystem.",
          "translation": "Kurangnya sumber daya air telah menyebabkan keterbatasan air di banyak wilayah, yang memengaruhi pertumbuhan ekonomi daerah-daerah tersebut dan kualitas hidup penduduknya, akhirnya mengancam keberlangsungan ekosistem."
        }
      ],
      "phonetics": {
        "us": "/ˈwɔːtər skærˈsɪti/",
        "uk": "/ˈwɔːtər skærˈsɪti/"
      },
      "meaning": "Keterbatasan air",
      "synonymMeanings": [
        "Kurangnya air",
        "Keterbatasan sumber daya air",
        "Krisis air",
        "Sulitnya mendapatkan air"
      ]
    },
    {
      "id": "ee6ae0c5-a3ef-48a8-a22a-37353653b0de",
      "word": "Waste management",
      "synonyms": [
        "Recycling",
        "disposal",
        "planning"
      ],
      "definition": "The systematic collection, transport, processing, and disposal of waste materials.",
      "userGuesses": [],
      "status": "hidden",
      "examples": [
        {
          "type": "Simple",
          "text": "Effective waste management is crucial for maintaining a clean environment.",
          "translation": "Manajemen limbah yang efektif sangat penting untuk menjaga lingkungan yang bersih."
        },
        {
          "type": "Complex",
          "text": "While some cities have implemented advanced waste management systems, many others still struggle with inadequate waste disposal facilities.",
          "translation": "Sementara beberapa kota telah mengimplementasikan sistem manajemen limbah canggih, banyak lainnya masih mengalami kesulitan dengan fasilitas pengelolaan limbah yang tidak memadai."
        },
        {
          "type": "Compound",
          "text": "Waste management and recycling are two sides of the same coin.",
          "translation": "Manajemen limbah dan daur ulang adalah dua sisi mata uang yang sama."
        },
        {
          "type": "Compound-Complex",
          "text": "In addition to reducing greenhouse gas emissions, implementing efficient waste management practices can also help to conserve natural resources and protect public health.",
          "translation": "Selain mengurangi emisi gas rumah kaca, melaksanakan praktek-praktek manajemen limbah yang efisien juga dapat membantu melestarikan sumber daya alam dan melindungi kesehatan masyarakat."
        }
      ],
      "phonetics": {
        "us": "/weɪst mænɪdʒmənt/",
        "uk": "/weɪst mænɪdʒmənt/"
      },
      "meaning": "Manajemen limbah",
      "synonymMeanings": [
        "pengelolaan limbah",
        "pengurangan limbah",
        "penanganan limbah"
      ]
    },
    {
      "id": "03912aa1-5e90-467e-9080-de00146cba9c",
      "word": "Climate mitigation",
      "synonyms": [
        "Emission reduction",
        "carbon sequestration"
      ],
      "definition": "The act of reducing the production of gases that contribute to the greenhouse effect, such as carbon dioxide, in order to slow down global warming.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "The government has introduced policies to reduce carbon emissions and promote climate mitigation.",
          "translation": "Pemerintah telah mengenalkan kebijakan untuk mengurangi emisi karbon dan mendorong upaya mitigasi iklim."
        },
        {
          "type": "Complex",
          "text": "Although climate change is a complex issue, reducing greenhouse gas emissions is a crucial step towards climate mitigation.",
          "translation": "Meskipun perubahan iklim merupakan masalah kompleks, mengurangi emisi gas rumah kaca adalah langkah kritis dalam upaya mitigasi iklim."
        },
        {
          "type": "Compound",
          "text": "The benefits of climate mitigation include not only reducing the risk of climate-related disasters but also improving air quality and promoting sustainable development.",
          "translation": "Keuntungan dari upaya mitigasi iklim mencakup tidak hanya mengurangi risiko bencana iklim, tetapi juga meningkatkan kualitas udara dan mendorong pembangunan berkelanjutan."
        },
        {
          "type": "Compound-Complex",
          "text": "The increasing level of greenhouse gas emissions is attributed to human activities such as burning fossil fuels and deforestation, which are major contributors to climate change, and reducing these emissions is essential for effective climate mitigation.",
          "translation": "Peningkatan level emisi gas rumah kaca disebabkan oleh kegiatan manusia seperti pembakaran bahan bakar fosil dan deforestasi, yang merupakan kontributor utama perubahan iklim, sehingga mengurangi emisi ini sangat penting untuk upaya mitigasi iklim yang efektif."
        }
      ],
      "phonetics": {
        "us": "/ˈklaɪmɪt̬ ˌmaɪtɪˈɡeʃən/",
        "uk": "/ˈklaɪmɪt̬ ˌmaɪtɪˈɡeɪʃən/"
      },
      "meaning": "Upaya pengurangan emisi gas berbasis karbon untuk mengurangi pemanasan global",
      "synonymMeanings": [
        "Upaya pengurangan dampak iklim",
        "Pengurangan emisi gas berbasis karbon",
        "Mengurangi pemanasan global"
      ]
    },
    {
      "id": "57e33a22-0b64-403e-bf63-29a34c193488",
      "word": "Zero-waste lifestyle",
      "synonyms": [
        "Sustainable living",
        "waste-free habits"
      ],
      "definition": "A lifestyle that aims to minimize waste and the use of non-renewable resources, with the ultimate goal of zero waste being produced.",
      "userGuesses": [],
      "status": "discovered",
      "examples": [
        {
          "type": "Simple",
          "text": "Adopting a zero-waste lifestyle is essential for protecting the environment.",
          "translation": "Mengadopsi hidup bergaya tidak membuang sangat penting untuk melindungi lingkungan."
        },
        {
          "type": "Complex",
          "text": "While some people argue that a zero-waste lifestyle is unrealistic, many others believe that it is a necessary step towards a more sustainable future.",
          "translation": "Meskipun ada yang berpendapat bahwa hidup bergaya tidak membuang tidak masuk akal, banyak orang lain percaya bahwa itu adalah langkah yang diperlukan menuju masa depan yang lebih berkelanjutan."
        },
        {
          "type": "Compound",
          "text": "By reducing our consumption of plastic and adopting a zero-waste lifestyle, we can significantly reduce the amount of waste we produce.",
          "translation": "Dengan mengurangi konsumsi plastik dan mengadopsi hidup bergaya tidak membuang, kita dapat secara signifikan mengurangi jumlah sampah yang kita produksi."
        },
        {
          "type": "Compound-Complex",
          "text": "However, achieving a zero-waste lifestyle requires a significant change in our behavior, as well as a willingness to invest in sustainable products and services.",
          "translation": "Namun, mencapai hidup bergaya tidak membuang memerlukan perubahan signifikan dalam perilaku kita, serta kesediaan untuk berinvestasi pada produk dan layanan yang berkelanjutan."
        }
      ],
      "phonetics": {
        "us": "/ˈziːroʊ wæst laɪfˈstaɪl/",
        "uk": "/ˈzɪəroʊ ˌweɪst ˈlaɪfˈstaɪl/"
      },
      "meaning": "Hidup bergaya tidak membuang.",
      "synonymMeanings": [
        "Hidup berkelanjutan",
        "Hidup hijau",
        "Hidup ramah lingkungan"
      ]
    }
  ],
  "createdAt": 1769720342578
}